Repository: GNOME/filemanager-actions
Catalog: docs/manual/*/*.po
Languages: cs

source: When <guilabel>Display item in selection context menu</guilabel> is checked, then your action will be a candidate to be displayed in the file manager context menu as soon as at least one item is selected in the file manager. Your action will so deal with currently selected item(s).In order to be actually displayed, all the conditions defined in your candidate action must be met by each item currently selected in the file manager.
cs: Když je zaškrtnuté <guilabel>Zobrazovat položku v kontextové nabídce výběru</guilabel>, pak se akce stane kandidátem na zobrazení v kontextové nabídce správce souborů, jakmile je ve správci souborů vybraná alespoň jedna položka. Vaše akce tak bude pracovat s právě vybranou položku, nebo i více vybranými položkami. Aby se opravdu zobrazila, musí být splněné všechny podmínky, které jsou pro ni definované, pro všechny právě vybrané položky ve správci souborů.

source: When an action targets the selection context menu, and is actually displayed in the file manager context menu, then it is also displayed in file manager' <guimenu>Edit</guimenu> menu.
cs: Když akce cílí na kontextovou nabídku výběru a je právě zobrazená v kontextové nabídce správce souborů, je zároveň zobrazená i v jeho nabídce <guimenu>Upravit</guimenu>.

source: This target is checked by default.
cs: Toto zacílení je zapnuté jako výchozí.

source: Targeting the location context menu
cs: Zacílení na kontextovou nabídku umístění

source: When <guilabel>Display item in location context menu</guilabel> checkbox is activated, then your action will be a candidate to be displayed in file manager' context menu when the file manager selection is empty. Your action will so deal with currently displayed location. In order to be actually displayed, all the conditions defined in your candidate action must be met by the location currently displayed in the file manager.
cs: Když je zaškrtnuté <guilabel>Zobrazovat položku v kontextové nabídce umístění</guilabel>, pak se akce stane kandidátem na zobrazení v kontextové nabídce správce souborů, jakmile ve správci souborů není vybraná žádná položka. Vaše akce tak bude pracovat s právě zobrazeným umístěním. Aby se opravdu zobrazila, musí být splněné všechny podmínky, které jsou pro ni definované, pro právě zobrazené umístění.

source: When an action targets the location context menu, and is actually displayed in file manager' context menu, then it is also displayed in file manager' <guimenu>File</guimenu> menu.
cs: Když akce cílí na kontextovou nabídku umístění a je právě zobrazená v kontextové nabídce správce souborů, je zároveň zobrazená i v jeho nabídce <guimenu>Soubor</guimenu>.

source: Targeting the toolbar
cs: Zacílení na nástrojovou lištu

source: When <guilabel>Display item in the toolbar</guilabel> checkbox is activated, then your action will be a candidate to be displayed in file manager;' toolbar.
cs: Když je zaškrtnuté <guilabel>Zobrazovat položku na nástrojové liště</guilabel>, bude akce kandidátem na zobrazení na nástrojové liště správce souborů.

source: Actions displayed in the toolbar only deal with the location which is currently displayed in the file-manager, not with the items which may be currently selected (or not). In order to be displayed, all the conditions defined in your candidate action must so be met by the current location.
cs: Akce zobrazené na nástrojové liště pracují pouze s umístěním, které je ve správci souborů zrovna zobrazené, ne s vybranými položkami. Aby se opravdu zobrazila, musí být splněné všechny podmínky, které jsou pro ni definované, pro právě zobrazené umístění.

source: Notes
cs: Poznámky

source: If your action is to be displayed in a context menu
cs: Když se má akce zobrazovat v kontextové nabídce

source: Whether it is the selection context menu or the location context menu, and both in file manager' context menus and in <guimenu>File</guimenu> or <guimenu>Edit</guimenu> menus, it will be displayed as
cs: Ať už jde o kontextovou nabídku výběru nebo kontextovou nabídku umístění, v obou kontextových nabídkách správce souborů a v nabídkách <guimenu>Soubor</guimenu> a <guimenu>Upravit</guimenu> bude zobrazena

source: the <guilabel>Context label</guilabel> as a label,
cs: s popiskem <guilabel>Popisek v nabídce</guilabel>

source: the <guilabel>Icon</guilabel>,
cs: s ikonou <guilabel>Ikona</guilabel>

source: these two properties being associated with the <guilabel>Tooltip</guilabel>.
cs: s místní nápovědou <guilabel>Vysvětlivka</guilabel> přidruženou k textu i ikoně

source: Depending of the exact configuration of your desktop environment, the icon may or may not be displayed in front of the label in the menu.
cs: Ikona před textem v nabídce může, a nebo nemusí, být zobrazená, záleží na konkrétním nastavení vašeho uživatelského prostředí.

source: You may embed some parameters in the label, the icon name or the tooltip. These parameters will be dynamically substituted at runtime with values which will depend on currently selected item(s).
cs: Součástí popisku do nabídky, názvu ikony a vysvětlivky mohou být parametry. Za běhu se pak dynamicky nahradí hodnotami, které závisí na právě vybraných položkách.

source: If your action is to be displayed in the toolbar
cs: Když se má akce zobrazovat na nástrojové liště

source: It will be displayed as
cs: Bude zobrazena

source: the <guilabel>Toolbar label</guilabel> as a label,
cs: s popiskem <guilabel>Popisek na nástrojové liště</guilabel>

source: Depending of the exact configuration of your desktop environment, the toolbar label may or may not be displayed in front of the icon in the toolbar.
cs: Text u ikony na nástrojové liště může, a nebo nemusí, být zobrazený, záleží na konkrétním nastavení vašeho uživatelského prostředí.

source: The toolbar label defaults to the same label as those used in menus. By unchecking the <guilabel>Use same label for icon in the toolbar</guilabel> checkbox you can define a label specific to the toolbar, which is usually shorter that those defined for the menus.
cs: Výchozí název pro nástrojovou lištu je stejný jako pro nabídku. Když zrušíte zaškrtnutí <guilabel>Použít stejný název na nástrojové liště</guilabel>, můžete pro nástrojovou lištu zadat odlišný, který obvykle bývá kvůli místu kratší, než ten pro nabídku.

source: You may embed some parameters in the toolbar label, the icon name or the tooltip. These parameters will be dynamically substituted at runtime with values which will depend on currently selected item(s).
cs: Součástí popisku do nástrojové lišty, názvu ikony a vysvětlivky mohou být parametry. Za běhu se pak dynamicky nahradí hodnotami, které závisí na právě vybraných položkách.

source: Defining several targets
cs: Definování několika cílů

source: An action may target the selection context menu, the location context menu and the toolbar, or one or more of these.
cs: Akce může cílit do kontextové nabídky výběru, do kontextové nabídky umístění a do nástrojové lišty, a to jak do jedné ze zmíněných nebo i do více naráz.

source: Defining no target at all
cs: Definici bez cíle

source: If no target is defined, <abbrev>i.e.</abbrev> if the three checkboxes are unchecked, then your action will never be displayed.
cs: Pokud akce necílí nikam, <abbrev>tj.</abbrev> všechna tři políčka jsou nezaškrtnutá, akce se nikdy nezobrazí.

source: What action should be executed ?
cs: Která akce má být spuštěna?

source: You most probably want that your action eventually ends up in executing something. And, as a matter of fact, having something to execute is one of the few conditions which are required for an action to be considered as valid.
cs: Nejspíše budete chtít, aby vaše akce případně skončila spuštěním něčeho. Ve skutečnosti to, že má něco vykonat, je novou podmínkou, která musí být splněná, aby akce byla považovaná za platnou.

source: As we have already seen, the command to be executed is configured in the <guilabel>Command</guilabel> page.
cs: Jak jsem již mohli vidět, příkaz, který se má vykonat, je nastavený na kartě <guilabel>Příkaz</guilabel>.

source: This command may take arguments, which themselves may embed parameters. These parameters will be expanded at runtime, with values which will depend on currently selected item(s).
cs: Příkaz může mít nějaké argumenty, které zase v sobě mohou mít vložené parametry. Za běhu se pak parametry dynamicky nahradí hodnotami, které závisí na právě vybraných položkách.

source: Available parameters
cs: Dostupné parametry

source: In the <guilabel>Command</guilabel> page, click on <guilabel>Legend</guilabel> button to see the list of available parameters.
cs: Jestli se chcete podívat na seznam dostupných parametrů, klikněte na kartě <guilabel>Příkaz</guilabel> na tlačítko <guilabel>Legenda</guilabel>.

source: List of available parameters
cs: Seznam dostupných parametrů

source: Shows the list of available parameters.
cs: Ukazuje seznam dostupných parametrů.

source: The available parameters
cs: Dostupné parametry

source: The <guibutton>Legend</guibutton> button has a toggling action: click once to display the <guilabel>Parameter Legend</guilabel> dialog box; click a second time to hide it.
cs: Tlačítko <guibutton>Legenda</guibutton> funguje jako přepínač: jedním kliknutím zobrazíte dialogové okno <guilabel>Legenda k parametrům</guilabel> a dalším kliknutím jej zase skryjete.

source: The word « <guilabel>first</guilabel> » may be misleading as it only refers to the list of selected items internally provided by the file manager to the <productname>FileManager-Actions</productname> plugin.
cs: Slovo „<guilabel>první</guilabel>“ může být trochou matoucí, protože se odkazuje na seznam vybraných položek tak, jak je správce souborů interně předává do zásuvného modulu <productname>SprávceSouborů-Akce</productname>.

source: In particular, it has <emphasis>nothing to do</emphasis> with the visual selection you may have done in the file manager window. And, in fact, which is the « <guilabel>first</guilabel> » selected item in a multiple selection is absolutely undefined and rather unpredictable.
cs: Přesněji řečeno, <emphasis>nemá to nic společného</emphasis> se zobrazením výběru, tak jak jej máte v okně správce souborů. A navíc, to která položka je „<guilabel>první</guilabel>“ vybraná při vícenásobném výběru, není nijak definováno a je to vcelku nepředvídatelné.

source: Where the action should it be executed ?
cs: Kde má být akce spuštěna?

source: Your action may be executed in a particular working directory.
cs: Vaše akce může být spuštěna v konkrétní pracovní složce.

source: You may specify it in the <guilabel>Command</guilabel> tab, in the <guilabel>Working directory</guilabel> entry box, or by clicking on <guibutton>Browse</guibutton> to select a folder on the filesystem.
cs: Můžete ji určit na kartě <guilabel>Příkaz</guilabel> ve vstupním poli <guilabel>Pracovní složka</guilabel>, nebo kliknout na <guibutton>Procházet</guibutton> a vybrat ji v souborovém systému.

source: Working directory frame
cs: Blok Pracovní složka

source: Focus on the working directory selection frame.
cs: Zaměřený blok pro výběr pracovní složky

source: The working directory defaults to <literal>%d</literal>, which runs the command in the base directory of the (first) selected item.
cs: Výchozí pracovní složkou je <literal>%d</literal>, což příkaz spustí v základní složce (první) vybrané položky.

source: In the particular case of the <literal>%d</literal> parameter, the « <guilabel>first</guilabel> » selected item is not very important because it is very likely that all selected items are located in the same base directory.
cs: Konkrétně u parametru <literal>%d</literal> nemá označení „<guilabel>první</guilabel>“ vybraná položka velký význam, protože se dá předpokládat, že všechny vybrané položky boudou ve stejné základní složce.

source: How should the action be executed ?
cs: Jak má být akce spuštěna?

source: Apart from configuring the conditions, the selection must be met in order your action be displayed in file manager menus, <productname>FileManager-Actions</productname> allows you to configure how exactly your command will be executed.
cs: Kromě konfigurace podmínek, kterém musí výběr splňovat, aby se vaše akce zobrazila v nabídkách správce souborů, umožňuje <productname>SprávceSouborů-Akce</productname> nastavit, jak přesně se má váš příkaz provést.

source: Click on the <guilabel>Execution</guilabel> tab to show the page which configures the execution of your command.
cs: Kliknutím na kartu <guilabel>Provádění</guilabel> si zobrazte stránku, na které se nastavuje provádění vašeho příkazu.

source: Configuration of the execution modes
cs: Nastavení režimů provádění

source: Shows how to configure the execution modes of a command.
cs: Ukazuje, jak nastavit režim provádění příkazu.

source: Execution mode
cs: Režim provádění

source: Configuration of the execution mode
cs: Nastavení režimu provádění

source: Focus on the execution mode frame.
cs: Zaměřený blok s režimy provádění.

source: The execution mode of your command may be chosen between following values:
cs: Režim provádění příkazu můžete vybírat z následujících hodnot:

source: Normal
cs: Normální

source: Starts the command as a standard graphical user interface.
cs: Spustí příkaz jako standardní aplikaci s grafickým uživatelským rozhraním.

source: Terminal
cs: V terminálu

source: Starts the preferred terminal of the desktop environment, and runs the command in it.
cs: Spustí upřednostňovaný terminál uživatelského prostředí a příkaz spustí v něm.

source: Embedded
cs: Vloženo

source: Makes use of a special feature of the file manager which may allow a terminal to be ran in it.
cs: Zařídí použití speciální funkce správce souborů, která umožňuje spuštění terminálu v sobě.

source: As for now, none of the managed file managers implement this feature.
cs: Žádný ze správců souborů tuto funkci zatím neimplementuje.

source: Display output
cs: Zobrazit výstup

source: Starts the preferred terminal of the desktop environment, and runs the command in it. At end, standard streams (stdout, stderr) are collected and displayed.
cs: Spustí upřednostňovaný terminál uživatelského prostředí a příkaz spustí v něm. Na konci vezme standardní datový proud (stdout, stderr) a zobrazí jej.

source: The execution mode of a command defaults to <literal>Normal</literal>. That is, the command is executed without any particular pre- or post-work.
cs: Výchozí režim provádění příkazu je <literal>Normální</literal>, což znamená, že je spuštěn bez dalších činností před a po.

source: Startup notification
cs: Oznámení spuštění

source: Configuration of the startup modes
cs: Nastavení režimů spuštění

source: Focus on the Startup mode frame.
cs: Zaměřený blok s režimy spuštění.

source: If the execution mode of the command is <literal>Normal</literal>, and if you know that the application will send a <literal>remove</literal> message with the <envar>DESKTOP_STARTUP_ID</envar> environment variable set, then check the <guilabel>Startup notify</guilabel> checkbox.
cs: Když je režim provádění příkazu <literal>Normální</literal> a víte, že aplikace pošle zprávu <literal>remove</literal> s nastavenou proměnnou prostředí <envar>DESKTOP_STARTUP_ID</envar>, tak zaškrtněte políčko <guilabel>Oznamovat spuštění</guilabel>.

source: See the <ulink url="http://www.freedesktop.org/Standards/startup-notification-spec" type="http"><citetitle>Startup Notification Protocol Specification</citetitle></ulink> for more details.
cs: Více k tomu najdete ve <ulink url="http://www.freedesktop.org/Standards/startup-notification-spec" type="http"><citetitle>specifikaci Startup Nofification Protocol</citetitle></ulink>.

source: Window class
cs: Třída okna

source: If the execution mode of the command is <literal>Normal</literal>, and if you know that the application will map at least one window with a given class name, then enter that name into the <guilabel>Startup Window Manager class</guilabel> entry box.
cs: Když je režim provádění příkazu <literal>Normální</literal> a víte, že aplikace namapuje nejméně jedno okno se zadaným názvem třídy, zadejte tento název do vstupního pole <literal>Třída spouštěného správce oken</literal>.

source: Owner of the execution
cs: Vlastník provádění

source: Configuration of the owner of the run
cs: Nastavení vlastníka provádění

source: Execute as
cs: Provádět jako

source: Enter in the <guilabel>Execute as user</guilabel> entry box the username or the <acronym>UID</acronym> of the user your command will be run as.
cs: Do vstupního pole <guilabel>Provádět jako uživatel</guilabel> zadejte uživatelské jméno nebo <acronym>UID</acronym> uživatele, pod kterým se bude příkaz provádět.

source: If you do not enter anything in this field, then the command will be executed as the current user.
cs: Pokud do pole nic nezadáte, bude se příkaz provádět pod aktuálním uživatelem.

source: Multiple executions
cs: Vícenásobná provádění

source: You may want your command to be executed once, providing it the list of selected items as argument.
cs: Můžete chtít, aby se váš příkaz spustil jen jednou a dostal při tom jako argument seznam všech vybraných položek.

source: Or you may prefer your command to be repeated for each selected item, providing a different item as argument for each execution.
cs: Nebo můžete dát přednost, aby se příkaz spustil opakovaně, zvlášť pro každou vybranou položku a jako argument dostal při každém spuštění jinou položku.

source: Actually, <productname>FileManager-Actions</productname> automatically handles these two behaviors, depending of the form and the order of the parameters in the command arguments.
cs: Ve skutečnosti se <productname>SprávceSouborů-Akce</productname> stará o toto dvojí chování automaticky, v závislosti na podobě a pořadí parametrů v argumentech příkazu.

source: Though some parameters are not depending on the count of the selection (<abbrev>e.g.</abbrev> « <literal>%c</literal> », the selection count itself), most have two declensions:
cs: Ačkoliv některé parametry nejsou závislé na počtu vybraných položek (<abbrev>např.</abbrev> „<literal>%c</literal>“ – přímo počet vybraných položek), většina má dvě podoby:

source: a « singular » one, <abbrev>e.g.</abbrev> « <literal>%b</literal> », the basename of the selected item;
cs: „jednotlivou“, <abbrev>např.</abbrev> „<literal>%b</literal>“ – základní název vybrané položky

source: a « plural » one, <abbrev>e.g.</abbrev> « <literal>%B</literal> », the space-separated list of the basenames of selected items.
cs: „množnou“, <abbrev>např.</abbrev> „<literal>%B</literal>“ – mezerami oddělovaný seznam základních názvů vybraných položek

source: When the selection is empty or contains only one element, and from this topic point of view, these two forms are exactly equivalent.
cs: Když je výběr prázdný nebo obsahuje právě jednu položku, je to z pohledu právě probíraného tématu to stejné.

source: When the selection contains more than one item:
cs: Když výběr obsahuje více než jednu položku:

source: if the first relevant parameter is of a singular form, then <productname>FileManager-Actions</productname> will consider that the command is only able to deal with one item at a time, and thus that it has to be ran one time for each selected item;
cs: Pokud je první parametr související s počtem položek v jednotlivé formě, pak <productname>SprávceSouborů-Akce</productname> bude předpokládat, že příkaz umí zacházet je s jednou položkou naráz a proto jej spustí jednotlivě pro každou z vybraných položek.

source: contrarily, if the first relevant parameter found is of the plural form, then <productname>FileManager-Actions</productname> will consider that the command is able to deal with a list of items, and thus the command will be executed only once;
cs: V kontrastu s tím, když je první nalezený parametr, který souvisí s počtem položek, v množné podobě, <productname>SprávceSouborů-Akce</productname> bude předpokládat, že příkaz umí zacházet se seznamem položek a spustí jej tak jen jednou naráz.

source: if all found parameters are irrelevant, then <productname>FileManager-Actions</productname> defaults to consider that the command should be executed only once.
cs: Pokud všechny nalezené parametry nesouvisí s počtem položek, pak <productname>SprávceSouborů-Akce</productname> bude předpokládat, že příkaz se má spustit jen jednou.

source: Characterization of the parameters <abbrev>vs.</abbrev> multiple execution
cs: Popis parametrů a porovnání vícenásobného spuštění

source: Parameter
cs: Parametr

source: Description
cs: Popis

source: Repetition
cs: Opakování

source: (first) basename
cs: (první) základní název souboru

source: singular
cs: jednotlivý

source: space-separated list of basenames
cs: mezerou oddělovaný seznam základních názvů vybraných souborů

source: plural
cs: množný

source: count of selected items
cs: počet vybraných položek

source: irrelevant
cs: nesouvisí

source: (first) base directory
cs: (první) základní složka

source: space-separated list of base directory of each selected items
cs: mezerou oddělovaný seznam základních složek vybraných položek

source: (first) filename
cs: (první) název souboru

source: space-separated list of selected filenames
cs: mezerou oddělovaný seznam názvů vybraných souborů

source: hostname of the (first) URI
cs: název hostitele z (první) adresy URI

source: mimetype of the (first) selected item
cs: typ MIME (první) vybrané položky

source: space-separated list of the mimetypes of the selected items
cs: mezerou oddělovaný seznam typů MIME vybraných položek

source: username of the (first) URI
cs: uživatelské jméno z (první) adresy URI

source: no-op operator which forces a singular form of execution
cs: žádná operace, jen vynutí jednotlivou podobu spuštění

source: no-op operator which forces a plural form of execution
cs: žádná operace, jen vynutí množnou podobu spuštění

source: port number of the (first) URI
cs: port z (první) adresy URI

source: scheme of the (first) URI
cs: schéma z (první) adresy URI

source: (first) URI
cs: (první) adresa URI

source: space-separated list of selected URIs
cs: mezerou oddělovaný seznam vybraných adres URI

source: (first) basename without the extension
cs: (první) základní název bez přípony

source: space-separated list of basenames without their extension
cs: mezerou oddělovaný seznam základních názvů vybraných souborů bez přípon

source: (first) extension
cs: přípona (první) souboru

source: space-separated list of extensions
cs: mezerou oddělovaný seznam přípon vybraných souborů

source: the « <placeholder-1/> » character
cs: znak „<placeholder-1/>“

source: Usage of singular <abbrev>vs.</abbrev> plural forms
cs: Použití jednotlivé <abbrev>vs.</abbrev> množné podoby

source: Say the current folder is <filename>/data</filename>, and the current selection contains the three files <filename>pierre</filename>, <filename>paul</filename> and <filename>jacques</filename>.
cs: Řekněme, že aktuální složkou je <filename>/data</filename> a aktuální výběr obsahuje tři soubory <filename>Petr</filename>, <filename>Pavel</filename> a <filename>Jana</filename>.

source: If we have requested <command>echo %b</command>,
cs: Když máme požadavek <command>echo %b</command>,

source: then the following commands will be successively run:
cs: spustí se postupně následující příkazy:

source: echo pierre
cs: echo Petr

source: echo paul
cs: echo Pavel

source: echo jacques
cs: echo Jana

source: This is because <literal>%b</literal> marks a <emphasis>singular</emphasis> parameter. The command is then run once for each of the selected items.
cs: Je to proto, že <literal>%b</literal> značí <emphasis>jednotlivý</emphasis> parametr. Příkaz je pak spuštěn jednou pro každou z vybraných položek.
