Repository: GNOME/filemanager-actions
Catalog: docs/manual/*/*.po
Languages: cs

source: Removing a defined folder-based condition is as simple as selecting it, and pressing <keycap>Del</keycap> (or clicking on <guibutton><inlinegraphic fileref="figures/remove.png"/></guibutton> button).
cs: Odstranění definované podmínky založené na složce se jednoduše provede jejím vybráním a zmáčknutím <keycap>Delete</keycap> (nebo kliknutím na tlačítko <guibutton><inlinegraphic fileref="figures/remove.png"/></guibutton>).

source: By default, the folder-based condition is just one « <literal>must match one of /</literal> » condition. As <literal>/</literal> is always the top of an Unix-like file system, then all selected items always match this condition.
cs: Ve výchozím stavu tvoří podmínky založené na základní názvu právě jedna podmínka „<literal>aspoň jedna shoda</literal>“. Protože „<literal>/</literal>“ je v unixových systémech vždy nejvyšší úrovní souborového systému, budou všechny vybrané položky vždy vyhovovat této podmínce.

source: If you target a <productname>Windows</productname> system, then this default value may not be what you actually want.
cs: Pokud budou cílovou platformou <productname>Windows</productname>, nemusí být tato výchozí hodnota to, co právě chcete.

source: Scheme-base-conditions
cs: Podmínky založené na schématu

source: You may decide that your action will appear depending on the schemes of the URIs of the items currently selected in the file-manager: you may define that each item of the selection must have some scheme; and you may simultaneously decide that none of the selected item(s) may have some other scheme.
cs: Můžete se rozhodnout, že vaše akce se objeví v závislosti na schématu URI právě vybraných položek ve správci souborů: můžete definovat, že každá z položek výběru musí mít nějaké schéma a současně můžete rozhodnout, že žádná z položek výběru nesmí mít jiné schéma.

source: Click on the <guilabel>Schemes</guilabel> tab to show the page which will permit you to configure your scheme-based conditions.
cs: Klikněte na kartu <guilabel>Schémata</guilabel>, která umožňuje nastavit podmínky založené na schématu.

source: Scheme-based conditions
cs: Podmínky založené na schématu

source: Shows the tab which lets you define scheme-based conditions.
cs: Ukazuje kartu, která umožňuje definovat podmínky založené na schématu.

source: The scheme-based conditions tab
cs: Karta s podmínkami založenými na schématu

source: In fact, scheme-based conditions are built as a list of « must match one of » and « must not match any of » patterns. In order for your action to be a candidate regarding these scheme-based conditions, each element of the selection must be valid for all the listed conditions: the scheme of each element must match at least one of the defined « must match one of » patterns, and must not match any of the defined « must not match any of » patterns.
cs: Ve skutečnosti podmínky založené na schématu tvoří seznam vzorů „aspoň jedna shoda“ a „vůbec žádná shoda“. Aby akce mohla být kandidátem s ohledem na tyto podmínky, musí být jednotlivé položky výběru platné pro všechny uvedené podmínky: schéma každé položky se musí shodovat alespoň s jedním definovaným vzorem „aspoň jedna shoda“ a nesmí se shodovat s žádným z definovaných vzorů „vůbec žádná shoda“.

source: When targeting the selection context menu, your scheme-based conditions will be checked against the currently selected items. When targeting the location context menu or the toolbar, your scheme-based conditions will be checked against the scheme of the current location.
cs: Když je cílem kontextová nabídka výběru, budou podmínky založené na schématu kontrolovány vůči právě vybraným položkám. Když je cílem kontextová nabídka/nástrojová lišta umístění, budou podmínky kontrolované vůči schématu aktuálního umístění.

source: Defining a new scheme-based condition involves two steps.
cs: Definice nové podmínky založené na schématu zahrnuje dva kroky.

source: Edit the newly inserted condition filter to the scheme you want match.
cs: Upravte nově přidaný filtr podmínky na schéma, které chcete porovnávat.

source: Scheme-based conditions only accept « <literal>*</literal> » wildcard, which stands for « any scheme ».
cs: Podmínka založené na schématu přijímají jako divoké karty pouze „<literal>*</literal>“, což značí „libovolné schéma“.

source: Or click on <guibutton>Common</guibutton> to select a scheme among those predefined in <menuchoice><guimenu>Edit</guimenu><guimenuitem>Preferences</guimenuitem></menuchoice>.
cs: Nebo klikněte na <guibutton>Běžná</guibutton> a vyberte schéma ze schémat předdefinovaných v <menuchoice><guimenu>Upravit</guimenu> <guimenuitem>Předvolby</guimenuitem></menuchoice>.

source: Selecting a scheme among predefined defaults
cs: Výběr schématu z předdefinovaných běžných

source: Show the list of predefined schemes.
cs: Ukazuje seznam předdefinovaných schémat.

source: A new scheme may only be selected here if it is not already defined as a scheme filter.
cs: Nové schéma zde může být vybráno jen v případě, že zatím není definováno v žádném filtru schémat.

source: To select a new scheme, click <guibutton>OK</guibutton>, or double-click on the desired row.
cs: Aby se nové schéma vybralo, klikněte na <guibutton>Budiž</guibutton> nebo dvojitě klikněte na požadovaný řádek.

source: Removing a defined scheme-based condition is as simple as selecting it, and pressing <keycap>Del</keycap> (or clicking on <guibutton><inlinegraphic fileref="figures/remove.png"/></guibutton> button).
cs: Odstranění definované podmínky založené na schématu se jednoduše provede jejím vybráním a zmáčknutím <keycap>Delete</keycap> (nebo kliknutím na tlačítko <guibutton><inlinegraphic fileref="figures/remove.png"/></guibutton>).

source: By default, the scheme-based condition is just one « <literal>must match one of *</literal> » condition, which means that schemes are not relevant for this action.
cs: Ve výchozím stavu tvoří podmínky založené na schématu jedna podmínka „<literal>aspoň jedna shoda</literal>“, která znamená, že podmínky založené na schématu nemají pro tuto akci význam.

source: Capability-based conditions
cs: Podmínky založené na schopnostech

source: Capabilities are some properties that a file may exhibit to the user.
cs: Jako schopnosti jsou označovány určité vlastnosti, které soubor může dávat uživateli najevo.

source: But except for the <literal>Local</literal> capability, all others depend on the user who executes the command.
cs: Kromě schopnosti <literal>Local</literal> (místní soubor), všechny ostatní závisí na uživateli, který příkaz spustil.

source: You may so decide that your action will appear, or not, depending on the capabilities of the selected item(s) <abbrev>vs.</abbrev> the current user.
cs: Můžete se rozhodnout, že vaše akce se objeví, nebo naopak neobjeví v závislosti na schopnostech právě vybraných položek <abbrev>vs.</abbrev> aktuálním uživateli.

source: Click on the <guilabel>Capabilities</guilabel> tab to show the page which will permit you to configure your capability-based conditions.
cs: Klikněte na kartu <guilabel>Schopnosti</guilabel>, která umožňuje nastavit podmínky založené na schopnostech.

source: Shows the tab which lets you define capability-based conditions.
cs: Ukazuje kartu, která umožňuje definovat podmínky založené na schopnostech.

source: The capability-based conditions tab
cs: Karta s podmínkami založenými na schopnostech

source: In fact, capability-based conditions are built as a list of « must match all of » and « must not match any of » patterns. In order for your action to be a candidate regarding these capability-based conditions, each element of the selection must be valid for all the listed conditions: the capability of each element must match each of the defined « must match all of » capabilities, and must not match any of the defined « must not match any of » ones.
cs: Ve skutečnosti podmínky založené na schopnostech tvoří seznam vzorů „aspoň jedna shoda“ a „vůbec žádná shoda“. Aby akce mohla být kandidátem s ohledem na tyto podmínky, musí být jednotlivé položky výběru platné pro všechny uvedené podmínky: schopnost každé položky se musí shodovat alespoň s jednou definovanou vzorem „aspoň jedna shoda“ a nesmí se shodovat s žádnou z definovaných „vůbec žádná shoda“.

source: When targeting the selection context menu, your capability-based conditions will be checked against the currently selected items. When targeting the location context menu or the toolbar, your capability-based conditions will be checked against those of the current location.
cs: Když je cílem kontextová nabídka výběru, budou podmínky založené na schoponostech kontrolovány vůči právě vybraným položkám. Když je cílem kontextová nabídka/nástrojová lišta umístění, budou podmínky kontrolované vůči aktuálnímu umístění.

source: Defining a new capability-based condition involves two steps.
cs: Definice nové podmínky založené na schopnostech zahrnuje dva kroky.

source: Press <keycap>Insert</keycap> to insert a new condition filter.
cs: Zmáčknutím <keycap>Insert</keycap> přidejte nový filtr podmínky.

source: Edit the newly inserted condition filter to the capability you want match.
cs: Upravte nově přidaný filtr podmínky na schopnost, kterou chcete porovnávat.

source: Or click on <guibutton><inlinegraphic fileref="figures/add.png"/></guibutton> to open the <guilabel>Adding a new capability</guilabel> dialog box.
cs: Nebo kliknutím na <guibutton><inlinegraphic fileref="figures/add.png"/></guibutton> otevřete dialogové okno <guilabel>Přidání nové schopnosti</guilabel>.

source: Managed capabilities
cs: Vedené schopnosti

source: Shows the list of managed capabilities.
cs: Ukazuje seznam vedených schopností.

source: The list of managed capabilities
cs: Seznam vedených schopností

source: A new capability may only be selected here if it is not already defined as a capability filter.
cs: Novou schopnost zde můžete vybrat jen v případě, že již není použitá v některém definovaném filtru schopností.

source: To select a new capability, click <guibutton>OK</guibutton>, or double-click on the desired row.
cs: Novou schopnost vyberete kliknutím na <guibutton>Budiž</guibutton> nebo dvojitým kliknutím na požadovaný řádek.

source: Indicates whether this a « must match all of » or a « must not match any of » condition.
cs: Určit v podmínce, jestli pro ni musí platit „všechny shody“ nebo „vůbec žádná shoda“.

source: Click on the <guilabel>Must match all of</guilabel> or <guilabel>Must not match any of</guilabel> radio button in the same row to set the corresponding condition.
cs: Kliknutím na skupinový přepínač <guilabel>Všechny shody</guilabel> nebo <guilabel>Vůbec žádná shoda</guilabel> ve stejném řádku nastavíte příslušnou podmínku.

source: Removing a defined capability-based condition is as simple as selecting it, and pressing <keycap>Del</keycap> (or clicking on <guibutton><inlinegraphic fileref="figures/remove.png"/></guibutton> button).
cs: Odstranění definované podmínky založené na schopnostech se jednoduše provede jejím vybráním a zmáčknutím <keycap>Delete</keycap> (nebo kliknutím na tlačítko <guibutton><inlinegraphic fileref="figures/remove.png"/></guibutton>).

source: By default, the capability-based condition list is empty. This means that capabilities are not relevant for this action.
cs: Ve výchozím stavu je seznam podmínek založených na schopnostech prázdný. Znamená to, že schopnosti nemají pro tuto akci význam.

source: Selection count condition
cs: Podmínka založená na počtu vybraných položek

source: You may define that your action will only appear if the current selection in the file manager has some precise count, or some precise relation with a given count.
cs: Můžete určit, že se vaše akce objeví, jen když aktuální výběr ve správci souborů bude mít přesně zadaný počet položek nebo jiný přesný vztah k zadanému počtu.

source: A selection count use case
cs: Příklad využití počtu vybraných položek

source: If your action consists in displaying the differences between two files, you may define here « <literal>Count = (equal to) 2</literal> ».
cs: Když vaše akce spočívá v zobrazení rozdílu mezi dvěma soubory, můžete zde definovat „<literal>Count = (equal to) 2</literal>“.

source: Click on the <guilabel>Environment</guilabel> tab to show the page which will permit you to configure your environment-based conditions.
cs: Klikněte na kartu <guilabel>Prostředí</guilabel>, na které můžete nastavit podmínky založené na prostředí.

source: Environment-based conditions
cs: Podmínky založené na prostředí

source: Shows the tab which lets you define environment-based conditions. This includes the selection count configuration, the desktop selection, along with the runtime filters.
cs: Ukazuje kartu, na které je možné definovat podmínky založené na prostředí. Což jsou nastavení počtu vybraných položek, výběr uživatelského a prostředí filtry provádění.

source: The environment-based conditions tab
cs: Karta s podmínkami založenými na prostředí

source: The selection count condition is defined in the <guilabel>Appears if selection contains</guilabel> frame.
cs: Podmínky podle počtu vybraných položek se definují v bloku <guilabel>Zobrazí se, pokud výběr obsahuje</guilabel>

source: Selection count condition frame
cs: Blok s podmínkou podle počtu vybraných položek

source: Appears if selection contains
cs: Zobrazí se, pokud výběr obsahuje

source: Focus on the <placeholder-1/> frame.
cs: Zaměřený blok <placeholder-1/>.

source: When targeting the selection context menu, the count condition defined here will be checked against the count of currently selected items. When targeting the location context menu or the toolbar, the count condition will be checked against zero because there is no selected item in this case.
cs: Když je cílem kontextová nabídka výběru, bude zde definovaná podmínky založené na počtu kontrolovány vůči právě vybraným položkám. Když je cílem kontextová nabídka/nástrojová lišta umístění, bude podmínky kontrolované vůči nule, protože v tomto případě žádná položka vybraná není.

source: To define a selection count condition:
cs: Když chcete definovat podmínku založenou na počtu vybraných položek:

source: Select in the <guilabel>Count</guilabel> drop-down list the operator you want apply to the selection count:
cs: V rozbalovacím seznamu <guilabel>Počet</guilabel> vyberte operátor, který chcete použít k porovnání počtu:

source: (strictly less than)
cs: (právě menší než)

source: (equal to)
cs: (rovno)

source: (strictly greater than)
cs: (právě větší než)

source: Enter the reference count you wish.
cs: Zadejte počet, se kterým chcete srovnávat.

source: The selection count defaults to « <literal>Count &gt; (strictly greater than) 0</literal> », which means that the action will be a candidate to be displayed as soon as at least one item is selected in the file manager.
cs: Ve výchozím stavu je podmínkou založenou na počtu „<literal>Count &gt; (právě větší než) 0</literal>“, což znamená, že akce bude kandidátem na zobrazení od okamžiku, kdy je ve správci souborů vybrána alespoň jedna položka.

source: Desktop selection
cs: Výběr uživatelského prostředí

source: You may define that your action:
cs: Můžete definovat, že vaše akce se bude:

source: will always appear,
cs: zobrazovat vždy

source: or will only appear in some given desktop environments,
cs: zobrazovat jen ve vybraných prostředích

source: or will not appear in some given desktop environments.
cs: nikdy zobrazovat ve vybraných prostředích

source: Only one choice between these three items is possible.
cs: Vždy může být vybrána jen jedna z těchto tří možností.

source: The desktop selection is defined in the <guilabel>Desktop environment</guilabel> frame.
cs: Uživatelské prostředí se definuje v bloku <guilabel>Uživatelské prostředí</guilabel>.

source: Desktop selection frame
cs: Blok pro výběr uživatelského prostředí

source: Desktop environment
cs: Uživatelské prostředí

source: To define the desktop environment condition:
cs: Když chcete definovat podmínku založenou na uživatelském prostředí:

source: First select the type of filter:
cs: Nejprve vyberte typ filtru:

source: should your action always appear, regardless of the desktop environment ?
cs: Má se akce zobrazit vždy, bez ohledu na uživatelské prostředí?

source: should your action only appear in some desktop environment(s) ?
cs: Má se akce objevit jen v některých uživatelských prostředích?

source: should your action never appear in some desktop environment(s) ?
cs: Nesmí se akce nikdy objevit v některých uživatelských prostředích?

source: If your action should not always appear, then select the relevant desktop environment(s) in the listbox in the right side.
cs: Pokud se vaše akce nemá objevovat vždy, vyberte příslušná uživatelská prostředí v seznamu vpravo.

source: The targeted desktop environment condition defaults to « <literal>Always appear</literal> », which means that the action will be a candidate to be displayed regardless of the current desktop environment.
cs: Jako výchozí cíl podmínky založené na uživatelském prostředí je „<literal>Zobrazit vždy</literal>“, což znamená, že akce bude kandidátem na zobrazení bez ohledu na aktuální uživatelské prostředí.

source: Executable found condition
cs: Podmínka nalezení spustitelného

source: You may define that your action will only appear if some prerequisite package is installed on your system. This is checked here by specifying that a specific file, known or at least supposed to be provided by the package, must be present on the file system, and executable.
cs: Můžete definovat, že se vaše akce objeví, jen pokud je ve vašem systému nainstalován zadaný balíček. Kontrola se provádí zde určením konkrétního souboru, o kterém víte, nebo alespoň předpokládáte, že jej balíček poskytuje a který musí být součástí vašeho systému a být spustitelný.

source: The executable found condition is defined in the <guilabel>Execution environment</guilabel> frame.
cs: Podmínka nalezení spustitelného souboru se definuje v bloku <guilabel>Prováděcí prostředí</guilabel>.

source: Execution environment frame
cs: Blok s prováděcím prostředím

source: Execution environment
cs: Prováděcí prostředí

source: To define the relevant file, enter its full filename in the <guilabel>Appears if the file is executable</guilabel> entry box, or click on <guibutton>Browse</guibutton> to select a file on the file system.
cs: Když chcete určit příslušný soubor, zadejte celý jeho název do vstupního pole <guilabel>Zobrazit, pokud je soubor spustitelný</guilabel>, nebo klikněte na <guibutton>Procházet</guibutton> a vyberte soubor v souborovém systému.

source: Leave the field empty if this condition is not relevant for your action.
cs: Pokud nemá tato podmínka pro vaši akci význam, ponechejte pole prázdné.

source: You may embed some parameters in the searched filename. These parameters will be dynamically substituted at runtime with values which will depend on currently selected item(s).
cs: Součástí názvu hledaného souboru mohou být některé parametry. Za běhu se pak dynamicky nahradí hodnotami, které závisí na právě vybraných položkách.

source: D-Bus registration condition
cs: Podmínka registrace k D-Bus

source: You may define that your action will only appear if some given name is registered on the D-Bus system at runtime.
cs: Můžete definovat, že se vaše akce objeví, jen pokud je na sběrnici D-Bus za běhu registrován zadaný název.

source: Click on the <guilabel>Environment</guilabel> tab to show the page which will permit you to configure your environment-based conditions, and focus on <guilabel>Execution environment</guilabel> frame.
cs: Klikněte na kartu <guilabel>Prostředí</guilabel>, na které můžete nastavit podmínky založené na prostředí a zaměřte blok <guilabel>Prováděcí prostředí</guilabel>.

source: To define the relevant name, enter it in the <guilabel>Appears if the name is registered on D-Bus</guilabel> entry box.
cs: Když chcete určit příslušný název, zadejte jej do vstupního pole <guilabel>Zobrazit, pokud je název registrován na D-Bus</guilabel>.

source: You may embed some parameters in the searched name. These parameters will be dynamically substituted at runtime with values which will depend on currently selected item(s).
cs: Součástí hledaného názvu mohou být některé parametry. Za běhu se pak dynamicky nahradí hodnotami, které závisí na právě vybraných položkách.

source: Customized condition
cs: Vlastní podmínka

source: You may define that your action will only appear if some given command outputs a <literal>true</literal> string on its standard output.
cs: Můžete definovat, že se vaše akce objeví, jen pokud zadaný příkaz na svém standardním výstupu vypíše řetězec <literal>true</literal>.

source: This lets you define your own customized condition filter, by writing a small script which outputs, or not, the <literal>true</literal> string on stdout when it is ran.
cs: To vám umožňuje definovat si svůj vlastní filtr podmínky. Stačí napsat malý skript, který při běhu na standardní výstup vypíše, nebo naopak nevypíše, řetězec <literal>true</literal>.

source: To define the command, enter it in the <guilabel>Appears if the command outputs "true"</guilabel> entry box.
cs: Když chcete příkaz určit, zadejte jej do vstupního pole <guilabel>Zobrazit, pokud je výstup příkazu „true“</guilabel>.

source: You may embed some parameters in the executed filename or its options. These parameters will be dynamically substituted at runtime with values which will depend on currently selected item(s).
cs: Součástí spouštěného souboru i jeho přepínačů mohou být některé parametry. Za běhu se pak dynamicky nahradí hodnotami, které závisí na právě vybraných položkách.

source: Running process condition
cs: Podmínka běžícího procesu

source: You may define that your action will only appear if some given binary is currently running.
cs: Můžete definovat, že se vaše akce objeví, jen pokud právě běží zadaný proces.

source: To define the binary, enter its name in the <guilabel>Appears if the binary is running</guilabel> entry box, or click on <guibutton>Browse</guibutton> to select a file on the file system.
cs: Když chcete určit název procesu, zadejte jej do vstupního pole <guilabel>Zobrazit, pokud běží proces</guilabel>, nebo klikněte na <guibutton>Procházet</guibutton> a vyberte v souborovém systému spustitelný soubor.

source: Even if you enter here the full filename of a binary, only its basename will be searched for in the processes list at runtime.
cs: I když zde zadáte plnou cestu ke spustitelnému souboru, bude se v běžících procesech hledat jen základní název.

source: Locating the action
cs: Umístění akce

source: Target configuration
cs: Nastavení cíle

source: Shows the three fields which let you configure the target of your action.
cs: Ukazuje tři pole, které vám umožňují nastavit cíl akce.

source: The file manager may display your action in different places, depending on what you will request here, and if some item is currently selected (or not).
cs: Správce souborů může zobrazit vaši akci na třech různých místech, v závislosti na tom, o co si zde požádáte a jestli je položka právě vybraná (nebo ne).

source: Click on the <guilabel>Action</guilabel> tab to show the page which will permit you to configure the locations your action targets.
cs: Klikněte na kartu <guilabel>Akce</guilabel>, na které můžete nastavit umístění cílů vaší akce.

source: Targeting the selection context menu
cs: Zacílení na kontextovou nabídku výběru
