Repository: GNOME/filemanager-actions
Catalog: docs/manual/*/*.po
Languages: cs

source: <application>FileManager-Actions configuration tool</application> User's Manual
cs: Uživatelská příručka ke <application>konfiguračnímu nástroji SprávceSouborů-Akce</application>

source: <productname>FileManager-Actions</productname> is a file manager extension whose principal function is to allow the user to add arbitrary actions to the file manager context menus. These actions may be organized in menus and submenus, exported and shared with other desktop environments.
cs: <productname>SprávceSouborů-Akce</productname> je rozšíření správce souborů, jehož základní funkcí je umožnit uživateli přidat si libovolnou akci do kontextové nabídky správce souborů. Tyto akce si může uspořádat přímo v nabídce, tak i v podnabídkách, exportovat je a sdílet je s ostatními uživatelskými prostředími.

source: This manual describes the <application>FileManager-Actions configuration tool</application> user interface, and explains how you may configure your menus and actions, making them be displayed and applied depending on specific conditions.
cs: Tato příručka popisuje uživatelské rozhraní <application>konfiguračního nástroje SprávceSouborů-Akce</application> a vysvětluje, jak můžete nastavit své nabídky a akce, aby se zobrazovaly a používaly v závislosti na konkrétních podmínkách.

source: This manual describes version 3.4 of FileManager-Actions configuration tool.
cs: Tato příručka popisuje konfigurační nástroj SprávceSouborů-Akce ve verzi 3.4.

source: GNOME Documentation Project
cs: Dokumentační projekt GNOME

source: FileManager-Actions configuration tool User's Manual v 3.1
cs: Uživatelská příručka v 3.1 ke konfiguračnímu nástroji SprávceSouborů-Akce

source: May 2011
cs: květen 2011

source: FileManager-Actions configuration tool User's Manual v 3.2
cs: Uživatelská příručka v 3.2 ke konfiguračnímu nástroji SprávceSouborů-Akce

source: January 2012
cs: leden 2012

source: FileManager-Actions configuration tool User's Manual v 3.4
cs: Uživatelská příručka v 3.4 ke konfiguračnímu nástroji SprávceSouborů-Akce

source: September 2015
cs: září 2015

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License (GFDL), Version 1.3 or any later version published by the Free Software Foundation with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. You can find a copy of the GFDL at this <ulink type="help" url="ghelp:fdl">link</ulink> or in the file COPYING-DOCS distributed with this manual.
cs: Je povoleno kopírovat, šířit a/nebo upravovat tento dokument za podmínek GNU Free Documentation License (GFDL) ve verzi 1.3 nebo v jakékoli novější verzi vydané nadací Free Software Foundation; bez neměnných oddílů, bez textů předních desek a bez textů zadních desek. Kopii licence GFDL naleznete pod <ulink type=\"help\" url=\"help:fdl\">tímto odkazem</ulink> nebo v souboru COPYING-DOCS dodávaném s touto příručkou.

source: This manual is part of a collection of GNOME manuals distributed under the GFDL. If you want to distribute this manual separately from the collection, you can do so by adding a copy of the license to the manual, as described in section 6 of the license.
cs: Tato příručka je součástí sbírky příruček GNOME šířených za podmínek licence GNU FDL. Pokud chcete tento dokument šířit odděleně od sbírky, musíte přiložit kopii licence dle popisu v oddílu 6 dané licence.

source: Many of the names used by companies to distinguish their products and services are claimed as trademarks. Where those names appear in any GNOME documentation, and the members of the GNOME Documentation Project are made aware of those trademarks, then the names are in capital letters or initial capital letters.
cs: Mnoho užívaných názvů určených k zviditelnění produktů nebo služeb jsou ochranné známky. Na místech, kde jsou tato jména v dokumentaci užita a členové Dokumentačního projektu GNOME jsou si vědomi skutečnosti, že se jedná o ochrannou známku, je takové jméno psáno velkými písmeny celé nebo s velkým písmenem na začátku.

source: DOCUMENT IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS FREE OF DEFECTS MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY, ACCURACY, AND PERFORMANCE OF THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS WITH YOU. SHOULD ANY DOCUMENT OR MODIFIED VERSION PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL WRITER, AUTHOR OR ANY CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER; AND
cs: DOKUMENT JE POSKYTOVÁN V PODOBĚ „JAK JE“, BEZ ZÁRUKY JAKÉHOKOLIV DRUHU, NEPOSKYTUJÍ SE ANI ODVOZENÉ ZÁRUKY, ZÁRUKY, ŽE DOKUMENT, NEBO JEHO UPRAVENÁ VERZE, JE BEZCHYBNÝ, NEBO ZÁRUKY PRODEJNOSTI, VHODNOSTI PRO URČITÝ ÚČEL, NEBO NEPORUŠENOSTI. RIZIKO NEKVALITY, NEPŘESNOSTI A ŠPATNÉHO PROVEDENÍ DOKUMENTU, NEBO JEHO UPRAVENÉ VERZE, NESETE VY. POKUD JE TENTO DOKUMENT NEBO JEHO UPRAVENÁ VERZE VADNÁ V JAKÉMKOLIV SMYSLU, VY (NIKOLIV PŮVODCE, AUTOR NEBO JAKÝKOLIV PŘISPĚVATEL) PŘEBÍRÁTE ODPOVĚDNOST ZA JAKÉKOLIV NÁKLADY NA NUTNÉ ÚPRAVY, OPRAVY ČI SLUŽBY. TOTO PROHLÁŠENÍ O ZÁRUCE PŘEDSTAVUJE ZÁKLADNÍ SOUČÁST TÉTO LICENCE. BEZ TOHOTO PROHLÁŠENÍ NENÍ PODLE TÉTO DOHODY POVOLENO UŽÍVÁNÍ ANI ÚPRAVY TOHOTO DOKUMENTU; DÁLE

source: UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER IN TORT (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL THE AUTHOR, INITIAL WRITER, ANY CONTRIBUTOR, OR ANY DISTRIBUTOR OF THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO ANY PERSON FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER DAMAGES OR LOSSES ARISING OUT OF OR RELATING TO USE OF THE DOCUMENT AND MODIFIED VERSIONS OF THE DOCUMENT, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES.
cs: ZA ŽÁDNÝCH OKOLNOSTÍ A ŽÁDNÝCH PRÁVNÍCH PŘEDPOKLADŮ, AŤ SE JEDNÁ O PŘEČIN (VČETNĚ NEDBALOSTNÍCH), SMLOUVU NEBO JINÉ, NENÍ AUTOR, PŮVODNÍ PISATEL, KTERÝKOLIV PŘISPĚVATEL NEBO KTERÝKOLIV DISTRIBUTOR TOHOTO DOKUMENTU NEBO UPRAVENÉ VERZE DOKUMENTU NEBO KTERÝKOLIV DODAVATEL NĚKTERÉ Z TĚCHTO STRAN ODPOVĚDNÝ NĚJAKÉ OSOBĚ ZA PŘÍMÉ, NEPŘÍMÉ, SPECIÁLNÍ, NAHODILÉ NEBO NÁSLEDNÉ ŠKODY JAKÉHOKOLIV CHARAKTERU, VČETNĚ, ALE NEJEN, ZA POŠKOZENÍ ZE ZTRÁTY DOBRÉHO JMÉNA, PŘERUŠENÍ PRÁCE, PORUCHY NEBO NESPRÁVNÉ FUNKCE POČÍTAČE NEBO JINÉHO A VŠECH DALŠÍCH ŠKOD NEBO ZTRÁT VYVSTÁVAJÍCÍCH Z NEBO VZTAHUJÍCÍCH SE K POUŽÍVÁNÍ TOHOTO DOKUMENTU NEBO UPRAVENÝCH VERZÍ DOKUMENTU, I KDYŽ BY TAKOVÁTO STRANA BYLA INFORMOVANÁ O MOŽNOSTI TAKOVÉHOTO POŠKOZENÍ.

source: DOCUMENT AND MODIFIED VERSIONS OF THE DOCUMENT ARE PROVIDED UNDER THE TERMS OF THE GNU FREE DOCUMENTATION LICENSE WITH THE FURTHER UNDERSTANDING THAT: <placeholder-1/>
cs: DOKUMENT A JEHO UPRAVENÉ VERZE JSOU ŠÍŘENY V SOULADU SE ZNĚNÍM LICENCE GNU FREE DOCUMENTATION LICENSE S NÁSLEDUJÍCÍM USTANOVENÍM: <_:orderedlist-1/>

source: FileManager-Actions
cs: SprávceSouborů-Akce

source: Introduction
cs: Úvod

source: The <application>FileManager-Actions configuration tool</application> application is the user interface which lets you precisely configure how, where and when your actions should appear in the file manager context menus, and how they will be executed.
cs: <application>Konfigurační nástroj SprávceSouborů-Akce</application> je uživatelské rozhraní, které umožňuje podrobně nastavit, jak, kde a kdy se mají v kontextové nabídce správce souborů objevit vaše vlastní akce a jak se mají spouštět.

source: <application>FileManager-Actions configuration tool</application> provides the following features:
cs: <application>Konfigurační nástroj SprávceSouborů-Akce</application> poskytuje následující funkce:

source: Define and configure actions from scratch.
cs: Definování a nastavení akcí od základu

source: Organize actions into menus, submenus and so on.
cs: Uspořádání akcí do nabídek, podnabídek atd.

source: Import and export actions and menus from and to outside world.
cs: Import a export akcí a nabídek z a do zbytku světa

source: <productname>FileManager-Actions</productname> also comes with additional features such as:
cs: K tomu <productname>SprávceSouborů-Akce</productname> poskytuje i pár dalších věcí:

source: A tracker plugin which exports in real time to D-Bus the currently selected files.
cs: Zásuvný modul pro tracker, který exportuje v reálném čase seznam vybraných souborů do sběrnice D-Bus

source: A command-line program which is able to run any action.
cs: Program pro příkazovou řádku, který dokáže spustit libovolnou akci

source: Associated with the D-Bus interface, this program lets the user run any action from a keyboard shortcut, applying this action to the item(s) currently selected in the file manager.
cs: Přidružením k rozhraní D-Bus umožňuje uživateli spustit libovolnou akci pomocí klávesové zkratky, přičemž se tato akce použije na právě vybranou položku či položky ve správci souborů.

source: A command-line program which is able to create a new action.
cs: Program pro příkazovou řádku, který dokáže vytvořit novou akci

source: All these features are more thoroughly described in the global <productname>FileManager-Actions</productname> documentation.
cs: Všechny zmíněné věci jsou postupně popsané v hlavní dokumentaci k aplikaci <productname>SprávceSouborů-Akce</productname>.

source: Starting with the version 3.4, <productname>FileManager-Actions</productname> is compatible with both <productname>Nautilus</productname> and <productname>Nemo</productname> file-managers.
cs: Počínaje verzi 3.4 je <productname>SprávceSouborů-Akce</productname> kompatibilní jak se správcem souborů <productname>Nautilus</productname>, tak i <productname>Nemo</productname>.

source: Getting Started
cs: Začínáme

source: Starting <application>FileManager-Actions configuration tool</application>
cs: Spuštění <application>konfiguračního nástroje SprávceSouborů-Akce</application>

source: You can start <application>FileManager-Actions configuration tool</application> in the following ways:
cs: <application>Konfigurační nástroj SprávceSouborů-Akce</application> můžete spustit následujícími způsoby:

source: <guimenu>System</guimenu> menu
cs: <guimenu>Systémová</guimenu> nabídka

source: Choose <menuchoice><guisubmenu>Preferences</guisubmenu><guisubmenu>Look and Feel</guisubmenu><guimenuitem>FileManager-Actions Configuration Tool</guimenuitem></menuchoice>.
cs: Zvolte <menuchoice><guisubmenu>Předvolby</guisubmenu> <guisubmenu>Vzhled</guisubmenu> <guimenuitem>Konfigurační nástroj SprávceSouborů-Akce</guimenuitem></menuchoice>.

source: Command line
cs: Příkazový řádek

source: To start <application>FileManager-Actions configuration tool</application> from a command line, type the following command:
cs: Pro spuštění <application>konfiguračního nástroje FileManager-Actions</application> z příkazové řádky napište následující příkaz:

source: then press <keycap>Return</keycap>.
cs: a zmáčkněte <keycap>Enter</keycap>.

source: To view available command line options, type:
cs: Pokud se chcete podívat na přepínače příkazové řádky, napište:

source: The first run
cs: První spuštění

source: When you start <application>FileManager-Actions configuration tool</application>, the following window is displayed.
cs: Po spuštění <application>konfiguračního nástroje FileManager-Actions</application> se objeví následující okno.

source: <application>FileManager-Actions configuration tool</application> Start Up Window
cs: Okno <application>konfiguračního nástroje FileManager-Actions</application> po spuštění

source: FileManager-Actions configuration tool
cs: konfiguračního nástroje SprávceSouborů-Akce

source: Shows <placeholder-1/> main window. Contains menubar, toolbar, display area, an empty items list in the left, several disabled properties tabs, and statusbar.
cs: Ukazuje hlavní okno <placeholder-1/>. Obsahuje nabídkovou lištu, nástrojovou lištu, zobrazovací oblast, prázdný seznam položek po levé straně, několik nepřístupných karet s vlastnostmi a stavovou lištu.

source: The empty <application>FileManager-Actions configuration tool</application> main window
cs: Prázdné okno <application>konfiguračního nástroje FileManager-Actions</application>

source: The <application>FileManager-Actions configuration tool</application> main window contains the following elements:
cs: Hlavní okno <application>konfiguračního nástroje FileManager-Actions</application> obsahuje následující prvky:

source: Menubar.
cs: Nabídková lišta

source: The menus on the menubar contain all of the commands you need to use in <application>FileManager-Actions configuration tool</application>.
cs: Nabídky v nabídkové liště obsahují všechny příkazy, které potřebujete při používání <application>konfiguračního nástroje FileManager-Actions</application>.

source: Shortcuts are available for some commands:
cs: Pro některé příkazy jsou k dispozici klávesové zkratky:

source: Create a new action.
cs: Vytvořit novou akci

source: Save modified actions and menus.
cs: Uložit změněné akce a nabídky

source: Quit the application.
cs: Ukončit aplikaci

source: Cut the current selection, keeping it in the clipboard.
cs: Vyjmout aktuální výběr, uchovat jej ve schránce

source: Copy the current selection to the clipboard.
cs: Zkopírovat aktuální výběr do schránky

source: Insert the content of the clipboard before the current item.
cs: Vložit obsah schránky před aktuální položku

source: Insert the content of the clipboard as subitem(s) of the current item.
cs: Vložit obsah schránky jako dílčí položku či položky do aktuální položky

source: Delete the current selection.
cs: Smazat aktuální položku

source: Reload the actions and menus.
cs: Znovu načíst akce a nabídky

source: Display the help.
cs: Zobrazit nápovědu

source: Toolbar.
cs: Nástrojová lišta

source: Several toolbars may be displayed below the menubar, depending of your choices in the <menuchoice><guimenu>View</guimenu><guimenuitem>Toolbars</guimenuitem></menuchoice> submenu.
cs: Pod nabídkovou lištou může být zobrazeno několik nástrojových lišt, záleží co si nastavíte v podnabídce <menuchoice><guimenu>Zobrazit</guimenu> <guimenuitem>Nástrojové lišty</guimenuitem></menuchoice>.

source: Items list.
cs: Seznam položek

source: The list on the left of the main window contains all items, whether they are actions or menus, currently available for edition in <application>FileManager-Actions configuration tool</application>.
cs: Seznam v levé části hlavního okna obsahuje všechny položky, ať už to jsou akce nebo nabídky, které jsou aktuálně dostupné pro úpravy v <application>konfiguračním nástroji FileManager-Actions</application>.

source: Items may be sorted in ascending or descending alphabetical order, or not sorted at all, being directly organized and managed by the user.
cs: Položky mohou být seřazené ve vzestupném nebo sestupném abecedním pořadí, nebo mohou být neseřazené, respektive přímo uspořádané a spravované uživatelem.

source: Invalid items are displayed in red color.
cs: Neplatné položky jsou zobrazené červenou barvou.

source: Modified items are displayed in italic characters.
cs: Změněné položky jsou zobrazené kurzívou.

source: Sort buttons
cs: Řadicí tlačítka

source: Three buttons allow you to toggle between sort modes.
cs: Tři tlačítka vám umožňují přepínání mezi režimy řazení.

source: Properties tabs.
cs: Karty s vlastnostmi

source: The right part of the main window displays all is needed to define how, when and where actions and menus should be displayed.
cs: Pravá část hlavního okna zobrazuje vše, co je potřebné k zadefinování jak, kdy a kde se mají akce a nabídky zobrazit.

source: Action/Menu
cs: Akce/nabídka

source: Define in which file manager menus the item should appear, and how it will be displayed.
cs: Definuje, ve které nabídce správce souborů se má položka objevit a jak bude zobrazená.

source: Command
cs: Příkaz

source: Specify which command to execute, and which parameters pass to it.
cs: Určuje, který příkaz se má spustit a jaké se mu mají předat parametry.

source: Execution
cs: Provádění

source: Specify how the command should be executed.
cs: Určuje, jak má být příkaz proveden.

source: Basenames
cs: Základní názvy

source: Define the basename filters the file manager selection must satisfy in order the action or menu be candidate for display.
cs: Definuje filtry základních názvů, který musí výběr ve správci souborů splňovat, aby se akce nebo nabídka stala kandidátem na zobrazení.

source: Mimetypes
cs: Typy MIME

source: Define the mimetype filters the file manager selection must satisfy in order the action or menu be candidate for display.
cs: Definuje filtry typů MIME, které musí výběr ve správci souborů splňovat, aby se akce nebo nabídka stala kandidátem na zobrazení.

source: Folders
cs: Složky

source: Define the folder filters the file manager selection must satisfy in order the action or menu be candidate for display.
cs: Definuje filtry složek, který musí výběr ve správci souborů splňovat, aby se akce nebo nabídka stala kandidátem na zobrazení.

source: Schemes
cs: Schémata

source: Define the scheme filters the file manager selection must satisfy in order the action or menu be candidate for display.
cs: Definuje filtry schémat, který musí výběr ve správci souborů splňovat, aby se akce nebo nabídka stala kandidátem na zobrazení.

source: Capabilities
cs: Schopnosti

source: Define the capability filters the file manager selection must satisfy in order the action or menu be candidate for display.
cs: Definuje filtry schopností, který musí výběr ve správci souborů splňovat, aby se akce nebo nabídka stala kandidátem na zobrazení.

source: Environment
cs: Prostředí

source: Define some environment conditions the file manager selection must satisfy in order the action or menu be candidate for display.
cs: Definuje některé podmínky prostředí, který musí výběr ve správci souborů splňovat, aby se akce nebo nabídka stala kandidátem na zobrazení.

source: Properties
cs: Vlastnosti

source: Display item properties.
cs: Zobrazuje vlastnosti položky.

source: Statusbar.
cs: Stavová lišta

source: The statusbar displays some status informations about the currently selected row in the items list.
cs: Stavová lišta zobrazuje některé informace o právě vybraném řádku v seznamu položek.

source: When no relevant information is to be displayed, the statusbar displays the count of loaded menus, actions and profiles.
cs: Když nejsou k zobrazení žádné související informace, zobrazuje stavová lišta počet načtených nabídek, akcí a profilů.

source: The « read-only » icon <inlinegraphic fileref="figures/read-only.png"/> is displayed in the right of the statusbar when appropriate.
cs: V příslušných situacích je na stavové liště vpravo zobrazená ikona „jen ke čtení“ <inlinegraphic fileref="figures/read-only.png"/>.

source: Creating your first action
cs: Vytvoření vaší první akce

source: In this example, we are going to create an action which displays some pretty informations about the current selection.
cs: V tomto příkladu vytvoříme akci, která bude zobrazovat některé pěkné informace o aktuálním výběru.

source: Checking for prerequisites
cs: Kontrola předpokladů

source: This action will require <productname>Zenity</productname>.
cs: Tato akce vyžaduje aplikaci <productname>Zenity</productname>.

source: <productname>Zenity</productname> is a program which will allow you to create a graphical user interface from a command-line.
cs: <productname>Zenity</productname> je program, který umožňuje vytvořit grafické uživatelské rozhraní z příkazové řádky.

source: You should check that this program is installed on your system, by example by typing the following command in a terminal:
cs: Měli byste zkontrolovat, jestli jej máte nainstalovaný v systému. Například zadejte následující příkaz v terminálu:

source: Creating the action
cs: Vytvoření akce

source: To create a new action, choose <menuchoice><shortcut><keycombo><keycap>Ctrl</keycap><keycap>N</keycap></keycombo></shortcut><guimenu>File</guimenu><guisubmenu>New action</guisubmenu></menuchoice>.
cs: Abyste vytvořili novou akci, zvolte <menuchoice><shortcut><keycombo><keycap>Ctrl</keycap> <keycap>N</keycap></keycombo></shortcut> <guimenu>Soubor</guimenu> <guisubmenu>Nová akce</guisubmenu></menuchoice>.

source: A new action is inserted in the items list, and its properties are displayed in the tabs on the right pane.
cs: Nová akce se vloží do seznamu položek a její vlastnosti se zobrazí v kartách na panelu vpravo.

source: The label of the currently edited action (this one) is added to the application name in the title bar.
cs: Název právě upravované akce (té naší) se přidá k názvu programu na hlavičkové liště.

source: Default properties of a new action
cs: Výchozí vlastnosti nové akce

source: Shows the default properties of a newly created action.
cs: Ukazuje výchozí vlastnosti nově vytvořené akce.

source: In the <guilabel>Items list</guilabel>, the new action is displayed in italic characters.
cs: V <guilabel>Seznamu položek</guilabel> je nová akce zobrazená kurzívou.

source: Italics are used as a reminder that the item has not yet been saved.
cs: Kurzíva se používá jako připomenutí, že položka zatím nebyla uložena.

source: As another reminder that there is some pending modifications, an asterisk (« <literal>*</literal> ») comes to prefix the application name in the title bar.
cs: Dalším připomenutím, že máte nějaké neuložené změny, je hvězdička („<literal>*</literal>“) před názvem aplikace v hlavičkové liště.

source: Qualifying your new action
cs: Bližší vymezení nové akce

source: It merely consists of choosing how your action will be displayed in the file manager context menu.
cs: V podstatě jde o volbu, jak se vaše akce zobrazí v kontextové nabídce správce souborů.

source: Enter <userinput>My first action</userinput> in the <guilabel>Context label</guilabel> entry box.
cs: Do vstupního pole <userinput>Popisek v nabídce</userinput> zadejte <guilabel>Moje první akce</guilabel>.

source: The <guilabel>Context label</guilabel> entry box contains the label of the action as you want it to be displayed in the file manager context menu.
cs: Pole <guilabel>Popisek v nabídce</guilabel> obsahuje popisek akce tak, jak chcete, aby se objevoval v kontextové nabídce správce souborů.

source: The label is a mandatory property of your action. If it happens to be empty, then your action will be considered as invalid by <productname>FileManager-Actions</productname>: it will be displayed in red in <guilabel>Items list</guilabel> and will never be candidate to be displayed in the file manager context menus.
cs: Jedná se o povinnou vlastnost akce. Pokud by zůstal prázdný, byla by vaše akce považována aplikací <productname>SprávceSouborů-Akce</productname> za neplatnou: v <guilabel>Seznamu poližek</guilabel> by byla zobrazená červeně a nikdy by se nestala kandidátem na zobrazení v kontextové nabídce správce souborů.

source: Enter <userinput>This will execute an action with some parameters</userinput> in the <guilabel>Tooltip</guilabel> entry box.
cs: Do vstupního pole <userinput>Vysvětlivka</userinput> zadejte <guilabel>Provede nějakou činnost se zadanými parametry</guilabel>.
