Repository: GNOME/filemanager-actions
Catalog: docs/manual/*/*.po
Languages: cs

source: As of version 3.0, suggested shortcut, as described in <ulink url="http://www.nautilus-actions.org/?q=node/377" type="http">DES-EMA specification</ulink> cannot be configured in <application>FileManager-Actions configuration tool</application>, and is not honored by the menu plugin. But, thanks to the tracker plugin, you are always able to define a shortcut at the desktop level, assigning this shortcut to the fma-run program, making it execute the action of your choice.
cs: Od verze 3.0 nelze v souladu se <ulink url="http://www.nautilus-actions.org/?q=node/377" type="http">specifikací DES-EMA</ulink> v <application>konfiguračním nástroji SprávceSouborů-Akce</application> nastavit navrhované klávesové zkratky a ty ani nejsou brány do úvahy zásuvným modulem nabídky. Ale díky zásuvnému modulu pro tracker si můžete nadefinovat klávesovou zkratku kdykoliv na úrovni uživatelského prostředí a přiřadit ji programu fma-run, aby spouštěl vámi vytouženou akci.

source: Menu separator
cs: Oddělovač nabídky

source: As of version 3.0, menu separators cannot be configured in <application>FileManager-Actions configuration tool</application>, and are not honored by any known file-managers.
cs: Od verze 3.0 nelze oddělovače nabídky v <application>konfiguračním nástroji SprávceSouborů-Akce</application> nastavit a nejsou uplatňovány v žádném známém správci souborů.

source: About <application>FileManager-Actions configuration tool</application>
cs: O <application>konfiguračním nástroji SprávceSouborů-Akce</application>

source: The first version of <productname>FileManager-Actions</productname> was initially written by Frederic Ruaudel (<email>grumz@grumz.net</email>) and Rodrigo Moya (<email>rodrigo@gnome-db.org</email>). It has been thoroughly improved and is currently maintained by Pierre Wieser (<email>pwieser@trychlos.org</email>).
cs: První verzi aplikace <productname>SprávceSouborů-Akce</productname> napsali Frederic Ruaudel (<email>grumz@grumz.net</email>) a Rodrigo Moya (<email>rodrigo@gnome-db.org</email>). Později ji výrazně vylepšil a v současnosti spravuje Pierre Wieser (<email>pwieser@trychlos.org</email>).

source: Artwork is due to courtesy of Ulisse Perusin (<email>uli.peru@gmail.com</email>) and DragonArtz (<ulink url="http://www.dragonartz.net/" type="http">http://www.dragonartz.net</ulink>).
cs: Za grafiku zaslouží poděkování Ulisse Perusin (<email>uli.peru@gmail.com</email>) a DragonArtz (<ulink url="http://www.dragonartz.net/" type="http">http://www.dragonartz.net</ulink>).

source: To find more information about <productname>FileManager-Actions</productname>, please visit the <ulink url="http://www.nautilus-actions.org/" type="http"/><productname>FileManager-Actions</productname> website.
cs: Pokud se chcete o aplikaci <productname>SprávceSouborů-Akce</productname> dozvědět více, navštivte webové stránky <productname>SprávceSouborů-Akce</productname> na adrese <ulink url="http://www.nautilus-actions.org/" type="http"/>.

source: To report a bug or make a suggestion regarding <productname>FileManager-Actions</productname>, the <application>FileManager-Actions configuration tool</application> or this manual, follow the directions in the <ulink url="ghelp:user-guide#feedback" type="help">GNOME Feedback Page</ulink>, or you may prefer, at your convenience, directly open a bug or a request for enhancement in <ulink url="https://gitlab.gnome.org/GNOME/filemanager-actions/issues/new" type="http">GNOME Gitlab</ulink>.
cs: Pokud chcete nahlásit chybu nebo navrhnou vylepšení týkající se <productname>SprávceSouborů-Akce</productname> nebo této příručky, řiďte se instrukcemi na stránce <ulink url="ghelp:user-guide#feedback" type="help">Ohlasy GNOME</ulink>, nebo, pokud je to pro vás pohodlnější, přímo otevřete chybové hlášení či návrh na vylepšení na webu <ulink url="https://gitlab.gnome.org/GNOME/filemanager-actions/issues/new" type="http">GNOME Gitlab</ulink>.

source: Version 1.3, 3 November 2008
cs: Verze 1.3, 3. listopadu 2008

source: Everyone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.
cs: Kdokoliv je oprávněn kopírovat a šířit doslovné kopie tohoto dokumentu s licencí, ale nesmí v něm provádět žádné změny.

source: translator-credits
cs: Marek Černocký <marek@manet.cz>
