Repository: GNOME/filemanager-actions
Catalog: docs/manual/*/*.po
Languages: cs

source: The <guilabel>Tooltip</guilabel> entry box contains the text you want to be displayed as a short help to your action.
cs: Pole <guilabel>Vysvětlivka</guilabel> obsahuje text, který chcete, aby se zobrazovat jako stručná nápověda k akci.

source: Select <inlinegraphic fileref="figures/stock-icon-about.png"/> in the <guilabel>Icon</guilabel> drop-down list.
cs: V rozbalovacím seznamu <guilabel>Ikona</guilabel> vyberte <inlinegraphic fileref="figures/stock-icon-about.png"/>.

source: The <guilabel>Icon</guilabel> selection defines the icon which will be associated with your action in file manager context menus and in the toolbar.
cs: Vybraná <guilabel>Ikona</guilabel> definuje ikonu, která bude přiřazená k vaší akci v kontextové nabídce a nástrojové liště správce souborů.

source: You have two ways of choosing the icon associated to your action:
cs: Máte dvě možnosti, jak pro akci vybrat přidruženou ikonu:

source: Click on the <guilabel>Icon</guilabel> drop-down list to select an icon.
cs: Klikněte na rozbalovací seznam <guilabel>Ikona</guilabel> a vyberte ikonu.

source: Click on <guibutton>Browse</guibutton> to search for an image in the filesystem.
cs: Klikněte na <guibutton>Procházet</guibutton> a vyhledejte obrázek mezi soubory.

source: Specifying the command to be executed
cs: Určení spouštěného příkazu

source: When you will select your action in the file manager context menu, this command will be executed, with arguments of your choice.
cs: Když v kontextové nabídce správce souborů vyberete svoji akci, bude proveden tento příkaz, s argumenty podle vašeho výběru.

source: Click on the <guilabel>Command</guilabel> tab to show the page which will permit you to enter the command.
cs: Klikněte na kartu <guilabel>Příkaz</guilabel>, aby se zobrazila stránka, na které můžete příkaz zadat.

source: Command page
cs: Karta Příkaz

source: Shows the Command tab. This tab contains the name of the profile, the command to be executed along with its parameters, and the configuration of the starting working directory.
cs: Ukazuje kartu Příkaz. Tato karta obsahuje název profilu, příkaz k provedení spolu s jeho parametry a nastavení počáteční pracovní složky.

source: Enter <userinput>zenity</userinput> in the <guilabel>Path</guilabel> entry box.
cs: Do vstupního pole <userinput>Cesta</userinput> zadejte <guilabel>zenity</guilabel>.

source: The <guilabel>Path</guilabel> entry box defines the command which will be executed when you will select your action in the file manager context menu.
cs: Pole <guilabel>Cesta</guilabel> definuje příkaz, který bude proveden, když v kontextové nabídce správce souborů vyberete svoji akci.

source: You have two ways of defining the command to be executed:
cs: Existují dva způsoby, jak definovat příkaz, který se má spustit:

source: Enter it in the <guilabel>Path</guilabel> entry box.
cs: Zadejte jej do vstupního pole <guilabel>Cesta</guilabel>.

source: Click on <guibutton>Browse</guibutton> to select the executable file on the filesystem.
cs: Klikněte na <guibutton>Procházet</guibutton> a vyhledejte jej v souborovém systému.

source: If the command you enter does not have an absolute path, then it will be searched for in the <envar>PATH</envar> variable at execution time.
cs: Pokud příkaz, který jste zadali, nemá absolutní cestu, bude hledán v cestách uvedených v okamžiku spuštění v proměnné prostředí <envar>PATH</envar>.

source: Enter <userinput>--info --text='%c selected item(s): %U'</userinput> in the <guilabel>Parameters</guilabel> entry box.
cs: Do vstupního pole <userinput>Parametry</userinput> zadejte <userinput>--info --text='%c vybraných položek: %U'</userinput>.

source: The <guilabel>Parameters</guilabel> contains the arguments which will be passed to your command when it will be executed. These arguments may embed parameters which will be expanded at runtime.
cs: Pole <guilabel>Parametry</guilabel> obsahuje argumenty, které budou předány vašemu příkazu při spuštění. Argumenty mohou obsahovat parametry, které bud při spuštění rozvinuty.

source: If both <guilabel>Path</guilabel> and <guilabel>Parameters</guilabel> are empty, then this action will be considered as invalid: it will be displayed in red in <guilabel>Items list</guilabel> and will never be candidate to be displayed in the file manager context menus.
cs: Pokud jsou prázdná pole <guilabel>Cesta</guilabel> i <guilabel>Parametry</guilabel>, bude akce považována za neplatnou: v <guilabel>Seznamu položek</guilabel> bude zobrazená červeně a nikdy nebude kandidátem na zobrazení v kontextové nabídce správce souborů.

source: Saving
cs: Uložení

source: To save all pending modifications, choose <menuchoice><shortcut><keycombo><keycap>Ctrl</keycap><keycap>S</keycap></keycombo></shortcut><guimenu>File</guimenu><guisubmenu>Save</guisubmenu></menuchoice>.
cs: Pro uložení všech provedených změn zvolte <menuchoice><shortcut><keycombo><keycap>Ctrl</keycap> <keycap>S</keycap></keycombo></shortcut> <guimenu>Soubor</guimenu> <guisubmenu>Uložit</guisubmenu></menuchoice>.

source: The file manager automatically takes into account your new action, and displays it in its context menu.
cs: Správce souborů automaticky vezme do úvahy vaši novou akci a bude ji zobrazovat v kontextové nabídce.

source: Your first action in the file manager context menu
cs: Vaše první akce v kontextové nabídce správce souborů

source: Shows the first action in the file manager context menu.
cs: Ukazuje vaši první akci v kontextové nabídce správce souborů.

source: Cliking of the item in the file manager context menu activates it, and executes the corresponding command.
cs: Kliknutím na položku v kontextové nabídce správce souborů ji aktivujete a provede se příslušný příkaz.

source: The result of the execution of your first action
cs: Výsledek spuštění vaší první akce

source: Shows the result of the execution of your first action. This is <placeholder-1/> dialog box, displaying the URI of the selected item.
cs: Ukazuje výsledek spuštění vaší první akce. Jedná se o dialogové okno <placeholder-1/>, ve kterém je zobrazená adresa URI vybrané položky.

source: Using <application>FileManager-Actions configuration tool</application>
cs: Používání <application>konfiguračního nástroje SprávceSouborů-Akce</application>

source: Defining the conditions
cs: Definování podmínek

source: Whether your action will eventually be displayed in the file manager context menus or in its toolbar depends on the conditions you will have defined for it.
cs: To, jestli akce bude případně zobrazená v kontextové nabídce správce souborů nebo jeho nástrojové liště, závisí na podmínkách, které pro ni nadefinujete.

source: Conditions may be put against the location the file manager currently points to, or against the currently selected items in this location.
cs: Podmínky mohou být kladeny vůči místu, které správce souborů právě zobrazuje, nebo vůči právě vybraným položkám v tomto místě.

source: Each time the selection or the location change in the file manager, <productname>FileManager-Actions</productname> checks all your actions, comparing the defined conditions against the new location and selection: all defined conditions must be satisfied in order your action be actually displayed.
cs: Pokaždé, když se změní výběr nebo umístění ve správci souborů, <productname>SprávceSouborů-Akce</productname> projde všechny vaše akce a porovná definované podmínky vůči novému umístění a výběru. Aby se akce skutečně zobrazovala, musí být být splněny všechny definované podmínky.

source: For now, all managed file managers have removed this API from their extension library. The toolbar is still configurable in <productname>FileManager-Actions</productname>, but is will not be honored by any of the targeted file managers.
cs: V současnosti mají všichni správci souborů toto API ze své rozšiřující knihovny odstraněno. Nástrojovou lištu je sice stále možné v aplikaci <productname>SprávceSouborů-Akce</productname> nastavit, ale nebude uplatňována v žádném cílovém správci souborů.

source: Basename-based conditions
cs: Podmínky založené na základním názvu

source: You may decide that your action will appear depending on the basenames of the items currently selected in the file-manager: you may define that each item of the selection must meet some sort of basename, and you may simultaneously decide that none of the selected item(s) can have some other sort of basename.
cs: Můžete se rozhodnout, že vaše akce se objeví v závislosti na základním názvu právě vybraných položek ve správci souborů: můžete definovat, že každá z položek výběru musí splňovat určitý nárok na základní název a současně můžete rozhodnout, že žádná z položek výběru nesmí mít jiný druh základního názvu.

source: Click on the <guilabel>Basenames</guilabel> tab to show the page which will permit you to configure your basename-based conditions.
cs: Klikněte na kartu <guilabel>Základní názvy</guilabel>, která umožňuje nastavit podmínky založené na základní názvu.

source: Shows the tab which lets you define basename-based conditions.
cs: Ukazuje kartu, která umožňuje definovat podmínky založené na základním názvu.

source: The basename-based conditions tab
cs: Karta s podmínkami založenými na základním názvu

source: In fact, basename-based conditions are built as a list of « must match one of » and « must not match any of » patterns. In order for your action to be a candidate regarding these basename-based conditions, each element of the selection must be valid for all the listed conditions: the basename of each element must match at least one of the defined « must match one of » patterns, and must not match any of the defined « must not match any of » patterns.
cs: Ve skutečnosti podmínky založené na základním názvu tvoří seznam vzorů „aspoň jedna shoda“ a „vůbec žádná shoda“. Aby akce mohla být kandidátem s ohledem na tyto podmínky, musí být jednotlivé položky výběru platné pro všechny uvedené podmínky: základní název každé položky se musí shodovat alespoň s jedním definovaným vzorem „aspoň jedna shoda“ a nesmí se shodovat s žádným z definovaných vzorů „vůbec žádná shoda“.

source: If at least one element of the selection does not match all the defined conditions, then your action will not be displayed.
cs: Pokud alespoň jedna položka z výběru nevyhovuje všem definovaným podmínkám, nebude akce zobrazena.

source: When targeting the selection context menu, your basename-based conditions will be checked against the currently selected items. When targeting the location context menu or the toolbar, your basename-based conditions will be checked against the basename of the current location.
cs: Když je cílem kontextová nabídka výběru, budou podmínky založené na základním názvu kontrolovány vůči právě vybraným položkám. Když je cílem kontextová nabídka/nástrojová lišta umístění, budou podmínky kontrolované vůči základnímu názvu aktuálního umístění.

source: Defining a new basename-based condition involves two steps.
cs: Definice nové podmínky založené na základním názvu zahrnuje dva kroky.

source: Define the new condition filter.
cs: Definovat nový filtr podmínky

source: Press <keycap>Insert</keycap> or click on <guibutton><inlinegraphic fileref="figures/add.png"/></guibutton> button to insert a new condition filter
cs: Zmáčknutím <keycap>Insert</keycap> nebo kliknutím na tlačítko <guibutton><inlinegraphic fileref="figures/add.png"/></guibutton> přidejte nový filtr podmínky.

source: Edit the newly inserted condition filter to the basename you want match.
cs: Upravte nově přidaný filtr podmínky na základní název, který chcete porovnávat.

source: A basename-based condition may use « <literal>*</literal> » or « <literal>?</literal> » wildcard characters.
cs: Podmínky založené na základních názvech mohou využívat divoké karty „<literal>*</literal>“ a „<literal>?</literal>“.

source: Indicates whether this a « must match one of » or a « must not match any of » condition.
cs: Určit v podmínce, jestli pro ni musí platit „aspoň jedna shoda“ nebo „vůbec žádná shoda“.

source: Click on the <guilabel>Must match one of</guilabel> or <guilabel>Must not match any of</guilabel> radio button in the same row to set the corresponding condition.
cs: Kliknutím na skupinový přepínač <guilabel>Aspoň jedna shoda</guilabel> nebo <guilabel>Vůbec žádná shoda</guilabel> ve stejném řádku nastavíte příslušnou podmínku.

source: Depending of your target operating system, make sure that the <guilabel>Match case</guilabel> checkbox is activated (or not).
cs: V závislosti na cílovém operačním systému se ujistěte, že je (nebo naopak není) zaškrtnuté políčko <guilabel>Rozlišovat velikost písmen</guilabel>.

source: When activated, all filters are considered as case sensitive, which means that <filename>/my/file</filename> filename is considered distinct from <filename>/My/File</filename> one.
cs: Když je zapnuto, počítá se u všech filtrů s rozlišováním velikosti písmen, což znamená, že například název souboru <filename>/můj/soubor</filename> je považován za odlišný od <filename>/Můj/Soubor</filename>.

source: This is the default behavior on Unix-like systems.
cs: Jedná se o výchozí chování unixových systémů.

source: When deactivated, filters are considered as case insensitive, which means that <filename>/my/file</filename> and <filename>/My/File</filename> filenames are considered the same name.
cs: Když je vypnuto, u všech filtrů se nerozlišuje velikosti písmen, což znamená, že například názvy souborů <filename>/můj/soubor</filename> a <filename>/Můj/Soubor</filename> jsou považovány za shodné.

source: This is most probably what you want if you target some sort of <productname>Windows</productname> system.
cs: To je pravděpodobně to, co chcete, když budete pracovat na systému <productname>Windows</productname>.

source: Removing a defined basename-based condition is as simple as selecting it, and pressing <keycap>Del</keycap> (or clicking on <guibutton><inlinegraphic fileref="figures/remove.png"/></guibutton> button).
cs: Odstranění definované podmínky založené na základním názvu se jednoduše provede jejím vybráním a zmáčknutím <keycap>Delete</keycap> (nebo kliknutím na tlačítko <guibutton><inlinegraphic fileref="figures/remove.png"/></guibutton>).

source: By default, the basename-based condition is just one « <literal>must match one of *</literal> » condition. As all basenames always match the « <literal>*</literal> » condition, this just means that basename-based conditions are not considered as relevant for the action.
cs: Ve výchozím stavu tvoří podmínky založené na základní názvu právě jedna podmínka „<literal>aspoň jedna shoda</literal>“. Protože všechny základní názvy vždy vyhovují podmínce „<literal>*</literal>“, znamená to, že podmínky založené na základním názvu nemají pro tuto akci význam.

source: Mimetype-based conditions
cs: Podmínky založené na typu MIME

source: You may decide that your action will appear depending on the mimetypes of the items currently selected in the file-manager: you may define that each item of the selection must meet some sort of mimetype; and you may simultaneously decide that none of the selected item(s) can have some other sort of mimetype.
cs: Můžete se rozhodnout, že vaše akce se objeví v závislosti na typu MIME právě vybraných položek ve správci souborů: můžete definovat, že každá z položek výběru musí splňovat určitý nárok na typ MIME a současně můžete rozhodnout, že žádná z položek výběru nesmí mít jiný druh typu MIME.

source: Click on the <guilabel>Mimetypes</guilabel> tab to show the page which will permit you to configure your mimetype-based conditions.
cs: Klikněte na kartu <guilabel>Typy MIME</guilabel>, která umožňuje nastavit podmínky založené na typu MIME.

source: Shows the tab which lets you define mimetype-based conditions.
cs: Ukazuje kartu, která umožňuje definovat podmínky založené na typu MIME.

source: The mimetype-based conditions tab
cs: Karta s podmínkami založenými na typu MIME

source: In fact, mimetype-based conditions are built as a list of « must match one of » and « must not match any of » patterns. In order for your action to be a candidate regarding these mimetype-based conditions, each element of the selection must be valid for all the listed conditions: the mimetype of each element must match at least one of the defined « must match one of » patterns, and must not match any of the defined « must not match any of » patterns.
cs: Ve skutečnosti podmínky založené na typu MIME tvoří seznam vzorů „aspoň jedna shoda“ a „vůbec žádná shoda“. Aby akce mohla být kandidátem s ohledem na tyto podmínky, musí být jednotlivé položky výběru platné pro všechny uvedené podmínky: typ MIME každé položky se musí shodovat alespoň s jedním definovaným vzorem „aspoň jedna shoda“ a nesmí se shodovat s žádným z definovaných vzorů „vůbec žádná shoda“.

source: When targeting the selection context menu, your mimetype-based conditions will be checked against the currently selected items. When targeting the location context menu or the toolbar, your mimetype-based conditions will be checked against the mimetype of the current location, which happens to be the well known « inode/directory » mimetype.
cs: Když je cílem kontextová nabídka výběru, budou podmínky založené na typu MIME kontrolovány vůči právě vybraným položkám. Když je cílem kontextová nabídka/nástrojová lišta umístění, budou podmínky kontrolované vůči typu MIME aktuálního umístění, což bude dobře známý typ MIME „inode/directory“.

source: Defining a new mimetype-based condition involves two steps.
cs: Definice nové podmínky založené na typu MIME zahrnuje dva kroky.

source: Edit the newly inserted condition filter to the mimetype you want match.
cs: Upravte nově přidaný filtr podmínky na typ MIME, který chcete porovnávat.

source: A mimetype must be defined as a <literal>group/subgroup</literal> expression.
cs: Typ MIME musí být definován výrazem <literal>skupina/podskupina</literal>.

source: The « <literal>*</literal> » wildcard is supported only in some situations:
cs: Divoká karta „<literal>*</literal>“ je podporovaná jen v některých situacích:

source: The « <literal>*/*</literal> » expression matches all mimetypes. As a convenient shortcut, the « <literal>*</literal> » literal is also accepted for this same purpose.
cs: Výrazu „<literal>*/*</literal>“ vyhoví všechny typy MIME. Pro pohodlí se používá zjednodušený výraz „<literal>*</literal>“, který slouží stejnému účelu.

source: A <literal>group/*</literal> string matches all subgroups of <literal>group</literal> mimetype.
cs: Výrazu <literal>skupina/*</literal> vyhoví všechny podskupiny patřící do <literal>skupiny</literal> typů MIME.

source: The <literal>*/subgroup</literal> string is not accepted as a valid wildcard.
cs: Výraz <literal>*/podskupina</literal> není přijímán jako platná divoká karta.

source: Removing a defined mimetype-based condition is as simple as selecting it, and pressing <keycap>Del</keycap> (or clicking on <guibutton><inlinegraphic fileref="figures/remove.png"/></guibutton> button).
cs: Odstranění definované podmínky založené na typu MIME se jednoduše provede jejím vybráním a zmáčknutím <keycap>Delete</keycap> (nebo kliknutím na tlačítko <guibutton><inlinegraphic fileref="figures/remove.png"/></guibutton>).

source: By default, the mimetype-based condition is just one « <literal>must match one of */*</literal> » condition. As all mimetypes always match the « <literal>*/*</literal> », this just means that mimetypes are not considered as relevant for the action.
cs: Ve výchozím stavu tvoří podmínky založené na základní názvu právě jedna podmínka „<literal>aspoň jedna shoda</literal>“. Protože všechny typy MIME vždy vyhovují podmínce „<literal>*/*</literal>“, znamená to, že podmínky založené na typu MIME nemají pro tuto akci význam.

source: Example of usual mimetypes
cs: Příklad běžných typů MIME

source: Matches all items.
cs: Odpovídá všem položkám

source: Matches all regular files.
cs: Odpovídá všem běžným souborům

source: Matches only directories.
cs: Odpovídá právě jen složkám

source: Folder-based conditions
cs: Podmínky založené na složce

source: You may decide that your action will appear depending on the directory the items currently selected in the file-manager are located in: you may define that each item of the selection must be located in one hierarchy or in another; and you may simultaneously decide that none of the selected item(s) can be located in some other hierarchy.
cs: Můžete se rozhodnout, že vaše akce se objeví v závislosti na složce právě vybraných položek ve správci souborů: můžete definovat, že každá z položek výběru musí být umístěná v nějaké hierarchii složek a současně můžete rozhodnout, že žádná z položek výběru nesmí být umístěná v jiné hierarchii.

source: A folder-based condition must be understood as the specification of the hierarchy in which the currently examined item should (or should not) stay: this is a pattern on the dirname of the element.
cs: Podmínky založené na složce je třeba chápat jako určení hierarchie, ve které by se právě zkoumaná položka měla nacházet (nebo naopak neměla): jedná se o vzor cesty k položce.

source: Click on the <guilabel>Folders</guilabel> tab to show the page which will permit you to configure your folder-based conditions.
cs: Klikněte na kartu <guilabel>Složky</guilabel>, která umožňuje nastavit podmínky založené na složce.

source: Shows the tab which lets you define folder-based conditions.
cs: Ukazuje kartu, která umožňuje definovat podmínky založené na složce.

source: The folder-based conditions tab
cs: Karta s podmínkami založenými na složce

source: In fact, folder-based conditions are built as a list of « must match one of » and « must not match any of » patterns. In order for your action to be a candidate regarding these folder-based conditions, each element of the selection must be valid for all the listed conditions: each element must be located in one of the defined « must match one of » folders, and must not match any of the defined « must not match any of » folders.
cs: Ve skutečnosti podmínky založené na složce tvoří seznam vzorů „aspoň jedna shoda“ a „vůbec žádná shoda“. Aby akce mohla být kandidátem s ohledem na tyto podmínky, musí být jednotlivé položky výběru platné pro všechny uvedené podmínky: každá položka musí být umístěná alespoň v jedné definované složce „aspoň jedna shoda“ a nesmí být umístěná v žádném z definovaných složek „vůbec žádná shoda“.

source: When targeting the selection context menu, your folder-based conditions will be checked against the dirname of each currently selected items. When targeting the location context menu or the toolbar, your folder-based conditions will be checked against the current location.
cs: Když je cílem kontextová nabídka výběru, budou podmínky založené na složce kontrolovány vůči složkám právě vybraných položek. Když je cílem kontextová nabídka/nástrojová lišta umístění, budou podmínky kontrolované vůči aktuálnímu umístění.

source: Defining a new folder-based condition involves two steps.
cs: Definice nové podmínky založené na složce zahrnuje dva kroky.

source: Edit the newly inserted condition filter to the folder you want match.
cs: Upravte nově přidaný filtr podmínky na složku, kterou chcete porovnávat.

source: The « <literal>*</literal> » and « <literal>?</literal> » characters are accepted as wildcards at any level of the defined folder filter.
cs: Znaky „<literal>*</literal>“ a „<literal>?</literal>“ lez použít jako divoké karty v kterékoliv úrovni definovaného filtru složek.

source: Or click on <guibutton>Browse</guibutton> to select a folder on the file system.
cs: Nebo klikněte na <guibutton>Procházet</guibutton> a složku najděte v souborovém systému.
