Repository: GNOME/filemanager-actions
Catalog: docs/manual/*/*.po
Languages: cs

source: Contrarily, if we have requested <command>echo %B</command>,
cs: V kontrastu s tím, když máme požadavek <command>echo %B</command>,

source: then the following command will be run:
cs: spustí se následující příkaz:

source: echo pierre paul jacques
cs: echo Petr Pavel Jana

source: This is because <literal>%B</literal> marks a <emphasis>plural</emphasis> parameter. The command is then run only once, with the list of selected items as arguments.
cs: Je to proto, že <literal>%B</literal> značí <emphasis>množný</emphasis> parametr. Příkaz je pak spuštěn jen jednou, se seznamem vybraných položek jako argumentem.

source: If we have requested <command>echo %b %B</command>,
cs: Když máme požadavek <command>echo %b %B</command>,

source: echo pierre pierre paul jacques
cs: echo Petr Petr Pavel Jana

source: echo paul pierre paul jacques
cs: echo Pavel Petr Pavel Jana

source: echo jacques pierre paul jacques
cs: echo Jana Petr Pavel Jana

source: This is because the first <emphasis>relevant</emphasis> parameter is <literal>%b</literal>, and so the command is run once for each selected item, replacing at each occurrence the <literal>%b</literal> parameter with the corresponding item. The second parameter is computed and added as arguments to the executed command.
cs: Je to proto, že první parametr <emphasis>související</emphasis> s počtem položek je <literal>%b</literal> a příkaz je tak spuštěn jednou pro každou z vybraných položek, přičemž se výskyt parametru <literal>%b</literal> nahradí příslušnou položkou. Druhý parametr je vypočítán a předán jako argument spouštěného příkazu.

source: And if we have requested <literal>echo %B %b</literal>,
cs: A když máme požadavek <literal>echo %B %b</literal>,

source: then the following commands will be run:
cs: spustí se následující příkaz:

source: echo pierre paul jacques pierre
cs: echo Petr Pavel Jana Petr

source: This is because the first <emphasis>relevant</emphasis> parameter here is <literal>%B</literal>. The command is then run only once, replacing <literal>%B</literal> with the space-separated list of basenames. As the command is only run once, the <literal>%b</literal> is substituted only once with the (first) basename.
cs: Je to proto, že první parametr <emphasis>související</emphasis> s počtem položek je <literal>%B</literal>. Příkaz se tak spustí jen jednou, přičemž nahradí <literal>%B</literal> seznamem základních názvu oddělovaným mezerami. Protože se příkaz spustí jen jednou, je <literal>%b</literal> nahrazeno jen jednou (prvním) základním názvem.

source: Using profiles to extend your action
cs: Použití profilů pro rozšíření akcí

source: There are some situations where you will want a given action behave slightly differently depending on the currently selected items or the current runtime environment.
cs: Vyskytují se situace, kdy budete chtít, aby se daná akce chovala lehce odlišně v závislosti na právě vybrané položce nebo aktuálním běhovém prostředí.

source: Open a terminal here
cs: Otevřít terminál zde

source: Say you have an action which opens a terminal in the current location.
cs: Řekněme, že máte akci, která otevře terminál s aktuálním umístěním jako s pracovní složkou.

source: You have configured it to open your preferred terminal in the location your file manager currently points to.
cs: Musíte ji nastavit, aby otevřela upřednostňovaný terminál v umístění, na které právě ukazuje správce souborů.

source: But what if you want to select a directory in your file manager, and directly open your terminal in this directory ? If you keep based on the current file manager location, your terminal will open in the parent of the targeted directory.
cs: Ale co v případě, že chcete ve správci souborů vybrat složku a přímo otevřít terminál v této složce? Pokud budete vycházet z aktuálního umístění ve správci souborů, otevře se terminál ve skutečnosti v rodičovské složce vybrané složky.

source: One solution is to define a new profile to your action, configuring this profile to open the terminal in the targeted directory.
cs: Jedním řešením je nadefinovat pro akci nový profil a nastavit jej, aby otevřel terminál ve vybrané složce.

source: At runtime, <productname>FileManager-Actions</productname> will successively examine each profile attached to your action. If the first profile targets a file while you have selected a directory, then <productname>FileManager-Actions</productname> will just try with your second profile.
cs: Za běhu bude <productname>SprávceSouborů-Akce</productname> postupně zkoumat jednotlivé profily připojené k akci. Když první profil bude cílit na soubor, zatímco je zrovna vybraná složka, zkusí <productname>SprávceSouborů-Akce</productname> prostě váš druhý profil.

source: To create a new profile, first select the action in the items list, then choose <menuchoice><guisubmenu>File</guisubmenu><guimenuitem>New profile</guimenuitem></menuchoice>.
cs: Když chcete vytvořit nový profil, vyberte nejprve v seznamu položek akci a pak zvolte <menuchoice><guisubmenu>Soubor</guisubmenu> <guimenuitem>Nový profil</guimenuitem></menuchoice>.

source: A new profile is created in your action.
cs: Ve vaší akci se vytvoří nový profil.

source: You can now define the conditions which must be met in order this profile be selected, and the command which will be executed.
cs: Nyní můžete definovat podmínky, které musí být splněné, aby se tento profil vybral, a příkaz, který se bude spouštět.

source: Ordering the profiles inside an action
cs: Pořadí profilů v akci

source: At runtime, <productname>FileManager-Actions</productname> will begin with examining the conditions set on your action.
cs: Za běhu bude <productname>SprávceSouborů-Akce</productname> zkoumat podmínky nastavené u akce.

source: If these conditions (the action-conditions) are met, then <productname>FileManager-Actions</productname> will examine in order each profile.
cs: Když jsou tyto podmínky (podmínky akce) splněny, <productname>SprávceSouborů-Akce</productname> bude zkoumat postupně jednotlivé profily.

source: If the conditions defined in a profile are met, then this profile will be validated, and the review of other profiles will stop.
cs: Když jsou splněné podmínky definované v profilu, je tento profil prohlášen za platný a zkoumání dalších profilů je zastaveno.

source: If no profile is found valid at runtime, then the action will be itself considered invalid, and will not be displayed in the file manager context menu.
cs: Pokud za běhu není žádný profil vyhodnocen jako platný, je akce jako takové považována za neplatnou a nebude zobrazena v kontextové nabídce správce souborů.

source: Profiles of an action are ordered, and they are examined in that order at runtime. The first profile whose conditions are met will be validated, and made selectable in the file manager context menu.
cs: Pořadí, v jakém jsou profily v akci uspořádané, je pořadí, ve kterém budou zkoumány. První profil, jehož podmínky jsou splněny, bude prohlášen za platný a objeví se v kontextové nabídce správce souborů.

source: So, ordering of the profiles may be important for your action: the first valid profile found is the only one selected.
cs: Proto může být seřazení profilů pro vaši akci důležité: první nalezený platný profil bude jako jediný vybrán.

source: You may order your profiles inside an action in two ways.
cs: Změnit pořadí profilů v rámci akce můžete dvěma způsoby.

source: Cut the profile to be moved, select the profile before which you want your cut profile to be inserted, and paste it.
cs: Vyjměte profil, které potřebujete přesunout, vyberete profil před místem, na kterých chcete vyjmutý profil vložit a vložte jej.

source: Click on the profile to be moved, and drag it to its right place.
cs: Klikněte na profil, který potřebujete přesunout, a přetáhněte jej na správné místo.

source: Organizing actions in menus
cs: Uspořádání akcí v nabídkách

source: As your list of actions will grow, you most probably will want to organize them into menus, submenus, and so on.
cs: Jak váš seznam akcí poroste, bude je nejspíše chtít uspořádat do nabídek, podnabídek atd.

source: In order to create a new menu, choose <menuchoice><guimenu>File</guimenu><guimenuitem>New menu</guimenuitem></menuchoice>.
cs: Když chcete vytvořit novou nabídku, zvolte <menuchoice><guimenu>Soubor</guimenu> <guimenuitem>Nová nabídka</guimenuitem></menuchoice>.

source: A menu may be created anywhere in the list of your actions, but inside of an action (<abbrev>i.e.</abbrev> not between two profiles of an action).
cs: Nabídku můžete vytvořit kdekoliv ve vašem seznamu akcí, akorát ne uvnitř akce (<abbrev>tj.</abbrev> ne mezi dvěma profily akce).

source: As an action, the exact place where a new menu will be inserted depends on the current sort order:
cs: Stejně jako u akcí, i u nabídky její přesné umístění závisí na aktuálním řazení:

source: Manual order:
cs: Ruční pořadí:

source: The new menu is inserted just before the current action or menu.
cs: Nová nabídka je vložena přímo před aktuální akci nebo nabídku.

source: This place will not change when you later modify the label of the menu.
cs: Toto místo se nezmění, ani když později změníte název nabídky.

source: Ascending (resp. descending) alphabetical order:
cs: Vzestupné (resp. sestupné) abecední řazení:

source: The new menu is inserted at the correct place, regarding the default « <literal>New Nautilus menu</literal> » label.
cs: Nová nabídka se vloží na správně místo podle svého výchozího názvu „<literal>Nová nabídka</literal>“.

source: This place will be automatically changed, each time you modify the label of the menu.
cs: Toto místo automaticky změní pokaždé, když změníte název nabídky.

source: As an action, too, a menu requires a label, and may have an icon and a tooltip. Also, you may define some conditions in order your menu be candidate to be displayed in the file manager context menu. If the defined conditions are not met at runtime, then your whole menu, including its submenus, its actions and so on, will not be displayed.
cs: Stejné jako akce, i nabídka musí mít název a volitelně může mít ikonu a vysvětlivku. I u ní můžete definovat podmínky, za kterých se může stát kandidátem na zobrazení v kontextové nabídce správce souborů. Pokud za běhu nejsou podmínky splněny, pak celá nabídka, včetně svých podnabídek, akcí atd. nebude zobrazena.

source: Sorting the items list
cs: Řazení položek seznamu

source: Your actions and menus will be displayed in file manager context menus in the same order that they are listed in the <guilabel>Items list</guilabel>, on the left pane of the main <application>FileManager-Actions configuration tool</application> window.
cs: Akce a nabídky budou v kontextové nabídce správce souborů zobrazené ve stejném pořadí, jako jsou vypsané v <guilabel>Seznamu položek</guilabel>, tj. levém panelu hlavního okna <application>Konfigurační nástroj SprávceSouborů-Akce</application>.

source: You may decide to:
cs: Můžete se rozhodnout:

source: sort your actions and menus in ascending or descending alphabetical order of their label,
cs: řadit své akce a nabídky ve vzestupném, či sestupném, abecedním pořadí podle jejich názvů

source: or do not sort, and manually organize your actions and menus in your own order.
cs: neřadit je automaticky a seřadit je ručně podle svého

source: Alphabetically sorting your actions and menus
cs: Abecední řazení akcí a nabídek

source: In these modes, actions and menus are sorted depending of their label, inside of their parent.
cs: V tomto režimu se akce a nabídky řadí podle svého názvu, v rámci svého rodiče.

source: Sort buttons in the main window
cs: Řadicí tlačítka v hlavním okně

source: Shows the three sort buttons in the main window.
cs: Ukazuje tři řadicí tlačítka v hlavním okně.

source: You may sort your actions by:
cs: Akce můžete uspořádat pomocí:

source: Click on <guibutton><inlinegraphic fileref="figures/sort-asc.png"/></guibutton> (<abbrev>resp.</abbrev><guibutton><inlinegraphic fileref="figures/sort-desc.png"/></guibutton>) button to sort your actions in ascending (<abbrev>resp.</abbrev> descending) order.
cs: kliknutí na tlačítko <guibutton><inlinegraphic fileref="figures/sort-asc.png"/></guibutton> (<abbrev>resp.</abbrev> <guibutton><inlinegraphic fileref="figures/sort-desc.png"/></guibutton>) pro seřazení ve vzestupném (<abbrev>resp.</abbrev> sestupném) pořadí

source: Or edit the corresponding preference.
cs: změny příslušných předvoleb

source: Manually organizing your actions and menus
cs: Ruční uspořádání akcí a nabídek

source: When items are manually sorted in the list, new items are usually inserted just at the current position.
cs: Když jsou položky v seznamu řazené ručně, vloží se nové položky obvykle přímo na aktuální pozici.

source: There is nonetheless the case where an action is selected, and not expanded (or has currently only one profile). Inserting a new profile will not insert it before the action, but inside of the action.
cs: Nicméně existuje případ, když je vybraná akce a není rozbalená (nebo má právě jeden profil). Vložení nového profilu se neprovede před tuto akci, ale do ní.

source: To choose this mode:
cs: Tento režim můžete vybrat pomocí:

source: Click on <guibutton><inlinegraphic fileref="figures/sort-manual.png"/></guibutton> button.
cs: kliknutí na tlačítko <guibutton><inlinegraphic fileref="figures/sort-manual.png"/></guibutton>

source: Editing
cs: Úpravy

source: With <application>FileManager-Actions configuration tool</application>, you may safely cut, copy, paste to and from the clipboard.
cs: V aplikaci <application>SprávceSouborů-Akce</application> můžete bezpečně vyjímat, kopírovat a vkládat do a ze schránky.

source: Cut/Delete
cs: Vyjmout/smazat

source: Deletion applies to current selection.
cs: Mazání se použije na aktuální výběr.

source: Be warned that selecting and deleting all profiles of an action leaves it without any profile, so in an invalid state. The name of the action will be written in red (because it is invalid) and italic (because it has been modified) characters.
cs: Pamatujte, že vybráním a smazáním všech profilů akce ji ponecháte bez profilu, takže bude v neplatném stavu. Název akce bude vypsaný červeně (protože je neplatná) a kurzívou (protože byla změněna).

source: Multiple selection
cs: Vícenásobný výběr

source: Multiple selection is possible in <application>FileManager-Actions configuration tool</application>. You can extend the current selection by pressing <keycap>Ctrl</keycap> or <keycap>Shift</keycap> while selecting an item to add to the selection.
cs: V <application>konfiguračním nástroji SprávceSouborů-Akce</application> můžete vybrat více položek naráz. Dělá se to podržením kláves <keycap>Ctrl</keycap> nebo <keycap>Shift</keycap> a současným vybíráním položek.

source: <application>FileManager-Actions configuration tool</application> only accepts homogeneous multiple selections. That is, you may select one or more profiles, or one or more actions or menus. A multiple selection containing both profiles and actions or menus is not allowed. This is because <application>FileManager-Actions configuration tool</application> would not know where to paste such a selection.
cs: Vícenásobný výběr ale musí být jednotný. Tzn. můžete vybrat jeden či více profilů nebo jednu či více akcí nebo nabídek. Vícenásobný výběr obsahující jak profily, tak akce nebo nabídky, není dovolen. Je to proto, že <application>konfigurační nástroj SprávceSouborů-Akce</application> by nevěděl, kam má výběr vložit.

source: Note that selecting any row means also selecting children of this row. These children are said « implicitely selected »: they will be part of next edition operations, but are not considered when verifying if selection is homogeneous. Also, they cannot be explicitely selected (nor unselected).
cs: Upozorňujeme, že vybrání řádků znamená také výběr potomků tohoto řádku. Tito potomci jsou prostě „vybráni implicitně“ – budou součástí editačních operací, ale nebudou bráni v úvahu při ověřování, jestli je výběr jednotný. Navíc nemohou být vybrání výslovně (nebo naopak z výběru zrušeni).

source: Saving your modifications
cs: Uložení změn

source: To save your modifications, choose <menuchoice><shortcut><keycombo><keycap>Ctrl</keycap><keycap>S</keycap></keycombo></shortcut><guimenu>File</guimenu><guisubmenu>Save</guisubmenu></menuchoice>.
cs: Když chcete uložit své úprav, zvolte <menuchoice><shortcut><keycombo><keycap>Ctrl</keycap ><keycap>S</keycap></keycombo></shortcut> <guimenu>Soubor</guimenu> <guisubmenu>Uložit</guisubmenu></menuchoice>.

source: All your pending modifications will be saved. New items will be created by the first available writable I/O provider.
cs: Všechny neuložené změny budou uloženy. Nové položky budou vytvořeny prvním dostupným zapisovatelným poskytovatelem V/V.

source: <productname>FileManager-Actions</productname> also has an Auto-save feature which is configurable in <guimenuitem>Preferences</guimenuitem> dialog box.
cs: <productname>SprávceSouborů-Akce</productname> má také funkci automatického ukládání, kterou lze nastavit v dialogovém okně <guimenuitem>Předvolby</guimenuitem>.

source: Exporting your actions
cs: Export akcí

source: Importing actions
cs: Import akcí

source: Setting your own preferences
cs: Nastavení svých vlastních předvoleb

source: Choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Preferences</guimenuitem></menuchoice> to access to the configuration of your preferences.
cs: Do nastavení předvoleb se dostanete pomocí <menuchoice><guimenu>Upravit</guimenu> <guimenuitem>Předvolby</guimenuitem></menuchoice>.

source: Runtime preferences
cs: Předvolby běhu

source: Shows the tab which lets you define runtime preferences.
cs: Ukazuje kartu, na které můžete definovat předvolby běhu.

source: Runtime execution preferences
cs: Předvolby provádění běhu

source: Shows the tab which lets you define runtime execution preferences.
cs: Ukazuje kartu, na které můžete definovat předvolby provádění běhu.

source: Let the user explicitely configure the current desktop.
cs: Umožňuje uživateli přímo nastavit uživatelské prostředí.

source: User interface preferences
cs: Předvolby uživatelského rozhraní

source: UI preferences
cs: Předvolby uživatelského rozhraní

source: Shows the tab which lets you define UI preferences.
cs: Ukazuje kartu, na které můžete definovat předvolby uživatelského rozhraní.

source: Import preferences
cs: Předvolby importu

source: Shows the tab which lets you define import preferences.
cs: Ukazuje kartu, na které můžete definovat předvolby importu.

source: Export preferences
cs: Předvolby exportu

source: Shows the tab which lets you define export preferences.
cs: Ukazuje kartu, na které můžete definovat předvolby exportu.

source: Schemes preferences
cs: Předvolby schémat

source: Shows the tab which lets you define schemes preferences.
cs: Ukazuje kartu, na které můžete definovat předvolby schémat.

source: I/O providers preferences
cs: Předvolby poskytovatelů V/V

source: Shows the tab which lets you define I/O providers preferences.
cs: Ukazuje kartu, na které můžete definovat předvolby poskytovatelů V/V.

source: Miscellaneous informations
cs: Různé

source: The new action is also displayed in red color in the items list. Red color is used as an indicator that the item is invalid, that is that the item cannot be candidate to be displayed in a file manager context menu because some of its informations are missing or erroneous. Here, and though this newly inserted action has some suitable defaults, it lacks a command to be executed to be considered valid by <application>FileManager-Actions configuration tool</application>
cs: Rovněž nová akce je v seznamu položek zobrazená červenou barvou. Ta se používá ke sdělení, že položka je neplatná, takže nemůže být kandidátem na zobrazení v kontextové nabídce správce souborů z důvodu chybějících nebo chybných údajů. Přestože má nově vložená akce některé vhodné výchozí hodnoty, schází ji příkaz, který se má provádět, a proto ji nemůže <application>konfigurační nástroj SprávceSouborů-Akce</application> považovat za platnou.

source: Known Bugs and Limitations
cs: Známé chyby a omezení

source: Known bugs
cs: Známé chyby

source: Known bugs are available in <ulink url="https://gitlab.gnome.org/GNOME/filemanager-actions/issues" type="http">GNOME Gitlab</ulink>. Older known bugs are available in <ulink url="https://bugzilla.gnome.org/buglist.cgi?product=filemanager-actions&amp;bug_status=UNCONFIRMED&amp;bug_status=NEW&amp;bug_status=ASSIGNED&amp;bug_status=REOPENED" type="http">GNOME Bugzilla</ulink>.
cs: Známé chyby najdete na webu <ulink url="https://gitlab.gnome.org/GNOME/filemanager-actions/issues" type="http">GNOME Gitlab</ulink>, starší známé chyby pak na <ulink url="https://bugzilla.gnome.org/buglist.cgi?product=filemanager-actions&amp;bug_status=UNCONFIRMED&amp;bug_status=NEW&amp;bug_status=ASSIGNED&amp;bug_status=REOPENED" type="http">GNOME Bugzilla</ulink>.

source: If you find some new bug in <productname>FileManager-Actions</productname>, you are welcome to open it by pointing your favorite browser to <ulink url="https://gitlab.gnome.org/GNOME/filemanager-actions/issues/new" type="http">GNOME Gitlab</ulink>.
cs: Pokud najdete v aplikaci <productname>SprávceSouborů-Akce</productname> nějakou novou chybu, budeme rádi když nám ji oznámíte přes web <ulink url="https://gitlab.gnome.org/GNOME/filemanager-actions/issues/new" type="http">GNOME Gitlab</ulink>.

source: <ulink url="https://bugzilla.gnome.org/show_bug.cgi?id=616532" type="http">#616532</ulink> Directory selection
cs: <ulink url="https://bugzilla.gnome.org/show_bug.cgi?id=616532" type="http">#616532</ulink> Výběr složky

source: When you're browsing the folder you want to export to in the <application>FileManager-Actions configuration tool</application>'s export assistant you can't select it as the directory to export to. Instead you have to go to the directory a level up and select the directory you want to export to there.
cs: Když vybíráte složku, kterou chcete exportovat v průvodci exportem <application>konfiguračního nástroje SprávceSouborů-Akce</application>, nedá se složka pro export vybrat. Místo toho musíte jít v hierarchii složek o úroveň výš a výběr složky potvrdit zde.

source: Known limitations
cs: Známá omezení

source: As of version 3.0, execution mode may be configured in <application>FileManager-Actions configuration tool</application> but is not yet honored by known file-managers.
cs: Od verze 3.0 lze v <application>konfiguračním nástroji SprávceSouborů-Akce</application> nastavit režim provádění, ale není uplatňován v žádném známém správci souborů.

source: This concern working directory, execution mode, startup notification and execution's owner parameters.
cs: Jedná se o parametry pracovní složka, režim provádění, oznámení o spuštění a vlastník provádění.

source: Suggested shortcut
cs: Doporučené klávesové zkratky
