Repository: GNOME/filemanager-actions
Catalog: po/*.po
Languages: da, id, it, ta

source: No valid profile is candidate to execution. Exiting.
da: Ingen gyldig profil er kandidat til udførelse. Afslutter.
id: Tidak ada profil valid yang menjadi kandidat untuk eksekusi. Keluar.

source: Execute an action on the specified target.
da: Udfør en handling på det angivne mål.
id: Jalankan tindakan pada target yang dinyatakan.

source: Error: action “%s” doesn’t exist.
da: Fejl: Handlingen “%s” findes ikke.
id: Galat: aksi "%s" tidak ada.

source: Error: action “%s” is disabled.
da: Fejl: Handlingen “%s” er deaktiveret.
id: Galat: aksi "%s" dinonaktifkan.

source: Error: action “%s” is not valid.
da: Fejl: Handlingen “%s” er ikke gyldig.
id: Galat: aksi "%s" tak valid.

source: Set a key=value pair in a key file.
da: Angiv et nøgle=værdi-par i en nøglefil.
id: Menetapkan pasangan kunci=nilai dalam suatu berkas kunci.

source: The group to be updated
da: Gruppen som skal opdateres
id: Grup yang akan diperbarui

source: The key to be updated
da: Nøglen som skal opdateres
id: Kunci yang akan diperbarui

source: The type of the value to be set, may be “str”, “int” or “bool”
da: Typen for den værdi der skal angives; kan være “str”, “int” eller “bool”
id: Tipe nilai yang akan ditetapkan, mungkin "str", "int", atau "bool"

source: The value to be set
da: Værdien der skal angives
id: Nilai yang akan ditata

source: Output the version number and exit gracefully
da: Skriv versionsnummeret og afslut kontrolleret
id: Tampilkan nomor versi dan keluar secara baik-baik

source: Error: a group is mandatory.
da: Fejl: En gruppe er obligatorisk.
id: Galat: suatu grup adalah wajib.

source: Error: a key is mandatory.
da: Fejl: En nøgle er obligatorisk.
id: Galat: suatu kunci adalah wajib.

source: Error: a type is mandatory for setting/updating a value.
da: Fejl: En type er obligatorisk for at angive/opdatere en værdi.
id: Galat: suatu tipe adalah wajib untuk menetapkan/memperbarui sebuah nilai.

source: Error: unknown type: %s. Use “str”, “int” or “bool”.
da: Fejl: ukendt type %s. Brug “str”, “int” eller “bool”.
id: Galat: tipe tidak dikenal: %s. Gunakan “str", "int”, atau “bool”.

source: Error: a value is mandatory.
da: Fejl: En værdi er obligatorisk.
id: Galat: suatu nilai adalah wajib.

source: A list of capabilities each item of the selection must satisfy in order for the item to be candidate. Capabilities may be negated. Capabilities have to be chosen between following predefined ones: • “Owner”: current user is the owner of selected items • “Readable”: selected items are readable by user (probably more usefull when negated) • “Writable”: selected items are writable by user • “Executable”: selected items are executable by user • “Local”: selected items are local. Defaults to empty list.
id: Daftar kapabilitas yang mesti dipenuhi oleh setiap item pilihan agar item menjadi kandidat. Kapabilitas dapat dinegasikan. Kapabilitas harus dipilih antara berikut yang telah dipradefinisi: • "Owner": pengguna saat ini adalah pemilik item yang dipilih • "Readable": item yang dipilih dapat dibaca oleh pengguna (mungkin lebih berguna saat dinegasikan) • "Writable": item yang dipilih dapat ditulis oleh pengguna • "Executable": item yang dipilih dapat dieksekusi oleh pengguna • "Local": item yang dipilih adalah lokal. Default ke daftar kosong.

source: Existing item was overriden due to user request.
id: Butir yang ada ditimpa karena permintaan pengguna.

source: Error when querying informations for %s URI: %s
id: Galat ketika mengkueri informasi bagi URI %s: %s

source: Standard output:
id: Keluaran standar:

source: This format has been introduced in v 1.11 serie. This is the lightest schema still compatible with GConf command-line tools, while keeping backward compatibility with the FileManager-Actions Configuration Tool oldest versions. The exported schema file may later be imported via : • Import assistant of the FileManager-Actions Configuration Tool, • drag-n-drop into the FileManager-Actions Configuration Tool, • or via the gconftool-2 --import-schema-file command-line tool.
id: Format ini telah diperkenalkan di v 1,11 Serie. Ini adalah skema yang paling ringan yang masih kompatibel dengan alat baris perintah GConf, sambil menjaga kompatibilitas dengan alat konfigurasi tindakan FileManager versi tertua. File skema yang diekspor kemudian dapat diimpor melalui: • Impor asisten dari FileManager-tindakan Configuration tool, • drag-n-drop ke dalam alat konfigurasi tindakan FileManager, • atau melalui alat baris perintah gconftool-2--Import-schema-berkas.

source: Import OK
id: Impor OK

source: Mimetype filter
id: Filter mimetype

source: Display informations about this program
id: Menampilkan informasi tentang program ini

source: <b>Nautilus menu layout</b>
id: <b>Tata letak menu Nautilus</b>

source: Add items to the Nautilus popup menu
it: Aggiunge elementi al menù contestuale di Nautilus
ta: நாடுலஸ் துள்ளு பட்டியலுக்கு உருப்படிகளை சேர்

source: Nautilus Actions Configuration
it: Configurazione azioni di Nautilus
ta: நாடுலஸ் செயல்கள் வடிவமைப்பு

source: (C) 2005-2007 Frederic Ruaudel <grumz@grumz.net>
it: © 2005-2007 Frederic Ruaudel <grumz@grumz.net>

source: <b>%%</b>: a percent sign
it: <b>%%</b>: un segno di percentuale
ta: <b>%%</b>: ஒரு சதவீதம் குறி

source: <b>%M</b>: space-separated list of the selected file(s)/folder(s) with their full paths
it: <b>%M</b>: elenco, separato da spazi, del file e delle cartelle selezionati con i loro percorsi completi
ta: <b>%M</b>: தேர்ந்தெடுக்கப்பட்ட கோப்பு(கள்)/அடைவு(கள்) அவற்றின் பாதைகளுடன் இடைவெளி பிரித்த பட்டியல்

source: <b>%U</b>: username of the GnomeVFS URI
it: <b>%U</b>: nome utente dell'URI di GnomeVFS
ta: <b>%U</b>: GnomeVFS URIஇன் பயனர் பெயர்

source: <b>%d</b>: base folder of the selected file(s)
it: <b>%d</b>: cartella di base del file o dei file selezionati
ta: <b>%d</b>: அடிப்படை கோப்புறையின் தேர்ந்தெடுக்கப்பட்ட கோப்புகள்

source: <b>%f</b>: the name of the selected file or the 1st one if many are selected
it: <b>%f</b>: il nome del file o del primo file, se la selezione ne contiene diversi
ta: <b>%f</b>: தேர்ந்தெடுக்கப்பட்ட கோப்பின் பெயர் அல்லது பல தேர்ந்தெடுக்கப்பட்டால் முதலாவது

source: <b>%h</b>: hostname of the GnomeVFS URI
it: <b>%h</b>: nome dell'host dell'URI di GnomeVFS
ta: <b>%h</b>: GnomeVFS URIஇன் புரவலன் பெயர்

source: <b>%m</b>: space-separated list of the basenames of the selected file(s)/folder(s)
it: <b>%m</b>: elenco, separato da spazi, dei nomi di base dei file e delle cartelle selezionati
ta: <b>%m</b>: தேர்ந்தெடுக்கப்பட்ட கோப்புகள்/கோப்புறைகளின் இடைவெளியால் பிரிக்கப்பட்ட அடிப்படை பெயர்கள்

source: <b>%s</b>: scheme of the GnomeVFS URI
it: <b>%s</b>: schema dell'URI di GnomeVFS
ta: <b>%s</b>: GnomeVFS URIஇன் திட்டம்

source: <b>%u</b>: GnomeVFS URI
it: <b>%u</b>: URI di GnomeVFS

source: <b>Action</b>
it: <b>Azione</b>
ta: <b>থবক</b>

source: <b>Appears if file matches</b>
it: <b>Appare se il file concorda</b>
ta: <b>கோப்பு பொருந்தினால் தோன்றும்</b>

source: <b>Appears if scheme is in this list</b>
it: <b>Appare se lo schema è presente in questo elenco</b>
ta: <b>இந்த பட்டியலில் திட்டம் இருந்தால் தோன்றுகிறது</b>

source: <b>Appears if selection contains</b>
it: <b>Appare se la selezione contiene</b>
ta: <b>தேர்ந்தெடுத்தல் கொண்டிருந்தால் தோன்றுகிறது</b>

source: <b>Nautilus Menu Item</b>
it: <b>Voce del menù di Nautilus</b>
ta: <b> நாடுலஸ் பட்டி உருப்படி</b>

source: <b>Profiles</b>
it: <b>Profili</b>
ta: <b>விவரங்கள்</b>

source: <i><b><span size="small">e.g., %s</span></b></i>
it: <i><b><span size="small">es., %s</span></b></i>

source: <span weight="bold" size="larger">place primary text here</span> place secondary text here
it: <span weight="bold" size="larger">inserire qui il testo principale</span> inserire qui il testo secondario
ta: <span weight="bold" size="larger">முதன்மை உரையை இங்கே இடவும்</span> இரண்டாவது உரையை இங்கே இடவும்

source: A string with wildcards (? or *) that will be used to match the filenames. You can set several filename patterns by separating them with a semi-colon (;).
it: Una stringa con caratteri speciali (? o *) che sarà utilizzata per trovare i nomi di file. È possibile selezionare diversi modelli di nome di file, separandoli col punto e virgola (;).
ta: ஒரு சரம் ஒயில்ட் கார்ட்களுடன் (? அல்லது*) கோப்பு பெயர்களுடன் பொருந்த பயன்படும். நீங்கள் பல்வேறு கோப்பு பெயர் தோற்றங்களை ஒரு அரைப்புள்ளியால் (;) பிரிக்க அமைக்கலாம்.

source: A string with wildcards (? or *) that will be used to match the mimetypes of files. You can set several mimetype patterns by separating them with a semi-colon (;).
it: Una stringa con caratteri speciali (? o *) che sarà utilizzata per trovare i tipi dei file. È possibile impostare diversi modelli di tipo di file, separandoli con il punto e virgola (;).
ta: ஒரு சரம் ஒயில்ட் கார்ட்களுடன் (? அல்லது*) mimetypeகளுடன் பொருந்த பயன்படும். நீங்கள் பல்வேறு mimetype தோற்றங்களை ஒரு அரைப்புள்ளியால் (;) பிரிக்க அமைக்கலாம்.

source: Action
it: Azione
ta: செயல்

source: Advanced Conditions
it: Condizioni avanzate
ta: கூடுதல் விதிமுறைகள்

source: Appears if selection has multiple files or folders
it: Appare se la selezione contiene più file o cartelle
ta: தேர்ந்தெடுத்தல் பல கோப்புகள் அல்லது கோப்புறைகளை கொண்டிருந்தால் தோன்றுகிறது

source: Both
it: Entrambi
ta: இரண்டும்

source: Click to add a new scheme.
it: Fare clic per aggiungere un nuovo schema.
ta: ஒரு புதிய திட்டத்தை சேர்க்க சொடுக்கு

source: Click to choose a command from the file chooser dialog.
it: Fare clic per scegliere un comando dalla finestra di dialogo per la scelta del file
ta: கோப்பு தேர்ந்தெடுத்தல் உரையாடலிருந்து ஒரு கட்டளையை சொடுக்கு

source: Click to choose a custom icon from a file instead of a predefined icon from the drop-down list.
it: Fare clic per scegliere un'icona personalizzata da un file invece di usare l'icona predefinita dall'elenco a discesa.
ta: ஒரு தனிபயன் சின்னத்தை ஒரு கோப்பிலிருந்து கீழ்விரி பட்டியலிலிருந்து தேர்ந்தெடுக்க சொடுக்கவும்.

source: Click to remove the selected scheme.
it: Fare clic per eliminare lo schema selezionato.
ta: தேர்ந்தெடுக்கப்பட்ட திட்டத்தை நீக்க சொடுக்கு

source: Click to toggle the display of the list of special tokens you can use in the parameter field.
it: Fare clic per abilitare la visualizzazione dell'elenco dei simboli che possono essere usati come parametro.
ta: சிறப்பு டோக்கன்கள் பட்டியலை காட்ட மாற்ற சொடுக்கவும் நீங்கள் அளவுரு புலத்தை பயன்படுத்தலாம்.

source: Conditions
it: Condizioni
ta: நிபந்தனைகள்

source: Create a copy of the selected action.
it: Crea una copia dell'azione selezionata.
ta: தேர்ந்தெடுக்கப்பட்ட செயலின் ஒரு நகலை உருவாக்கு

source: Delete the action without any confirmation nor the possibility to restore it.
it: Elimina l'azione senza chiedere conferma e senza la possibilità di ripristinarla.
ta: எந்த உறுதிப்படுத்தலும் இல்லாமல் செயலை அழிக்க வேண்டாம் அல்லது மறுசேமிக்க வேண்டாம்.

source: Duplicate
it: Duplica
ta: இன்னொன்று

source: Export existing configs
it: Esporta le configurazioni esistenti
ta: இருக்கும் கட்டமைப்புகளை ஏற்று

source: File to Import:
it: File da importare:
ta: கோப்பு வரை இறக்குமதி செய்:

source: Filenames:
it: Nomi dei file:
ta: கோப்புபெயர்கள்:

source: Icon:
it: Icona:
ta: சின்னம்:

source: If selected, the filename patterns will be matched case sensitive (eg, *.jpg will not match photo.JPG)
it: Se selezionato, i modelli del nome del file differenzieranno le maiuscole dalle minuscole (es, *.jpg non concorderà con immagine.JPG)
ta: தேர்ந்தெடுக்கப்பட்டால், கோப்பு பெயர் தோற்றங்கள் எழுத்துணர்வை கொண்டிருக்கும் (eg, *.jpg will not match photo.JPG)

source: Import new configurations
it: Importa nuove configurazioni
ta: புதிய கட்டமைப்புகள் இறக்கு

source: Import/Export
it: Importa/esporta
ta: இறக்குமதி/ஏற்றுமதி

source: Import/Export Settings
it: Impostazioni di importazione ed esportazione
ta: இறக்குமதி/ஏற்றுமதி அமைவுகள்

source: Label of the menu item in the Nautilus popup menu.
it: Etichetta dell'elemento nel menù contestuale di Nautilus.
ta: விளக்கச்சீட்டு இதில் பட்டியல் நாடுலஸ் துள்ளு பட்டியல்.

source: Label:
it: Etichetta:
ta: அடையாளம்:

source: Manage importation of external action configurations and exportation of existing actions.
it: Gestisce l'importazione di configurazioni di un'azione esterna e l'esportazione di azioni esistenti.
ta: வெளியார்ந்த செயல் கட்டமைப்புகள் மற்றும் இருக்கும் செயல்களை மேலாண்மை செய்யவும்

source: Match case
it: Maiuscolo/minuscolo
ta: பொருந்தும் நிலை

source: Mimetypes:
it: Tipi MIME:

source: Nautilus Action Editor
it: Editor delle azioni di Nautilus
ta: நாடுலஸ் செயல் தொகுப்பாளர்

source: Nautilus Action Profile Editor
it: Editor dei profili delle azioni di Nautilus
ta: நாடுலஸ் செயல் விவரகுறிப்பு தொகுப்பாளர்

source: Nautilus Actions
it: Azioni di Nautilus
ta: நாடுலஸ் செயல்கள்

source: Nautilus Actions Configuration Tool Application to configure Nautilus Action extension
it: Strumento di configurazione delle azioni di Nautilus Applicazione per configurare l'estensione per le azioni di Nautilus
ta: Nautilus Actions கட்டமைப்பு கருவி Nautilus Action விரிவாக்கங்களை கட்டமைக்கும் பயன்பாடுகள்

source: Only files
it: Solo file
ta: கோப்புகள் மட்டும்

source: Only folders
it: Solo cartelle
ta: கோப்புகள் மட்டும்

source: Parameters that will be sent to the program. Click on the 'Legend' button to see the different replacement tokens.
it: Parametri che saranno inviati al programma. Fare clic sul pulsante «Legenda» per visualizzare i diversi simboli di sostituzione.
ta: நிரலுக்கு அனுப்பப்படும் அளவுருக்கள். 'லெஜண்ட்' பொத்தானை அழுத்தி பல்வேறு மாற்ற டோக்கன்களை பார்க்கவும்.

source: Parameters:
it: Parametri:
ta: அளவுருக்கள்:

source: Path:
it: Percorso:
ta: பாதை:

source: Project Website
it: Sito del progetto

source: Save in Folder:
it: Salva nella cartella:
ta: கோப்புறையில் சேமி:

source: Select the configurations you want to export. Use Shift or Ctrl key to select more than one.
it: Selezionare le configurazioni da esportare. Utilizzare i tasti Maiusc o Ctrl per selezionarne più di una.
ta: ஏற்ற வேண்டிய கட்டமைப்புகளை தேர்ந்தெடுக்கவும். Shift அல்லது Ctrl விசைகளை பயன்படுத்தி அதிகமாக தேர்ந்தெடுக்கவும்.

source: Select the configurations you want to export:
it: Selezionare le configurazioni da esportare:
ta: ஏற்ற வேண்டிய கட்டமைப்புகளை தேர்ந்தெடு:

source: Select the file you want to import.
it: Selezionare il file da importare.
ta: இறக்க வேண்டிய கோப்பினை தேர்ந்தெடு

source: Select the folder you want your config to be saved in. This folder must exist.
it: Selezionare la cartella in cui salvare la configurazione. La cartella deve esistere.
ta: உங்கள் கட்டமைப்பை சேமிக்கும் கோப்புறையை தேர்ந்தெடு. இந்த கோப்புறை இருக்க வேண்டும்.

source: Select the kind of files where you want your action to appear. If you don't know what to choose, try selecting just 'file' which is the most common choice. You can add a new scheme by clicking on the '+' button.
it: Selezionare il tipo dei file per i quali si vuole che sia disponibile l'azione. Se non si sa cosa scegliere, provare a selezionare solo «file», la scelta più comune. È possibile aggiungere un nuovo schema facendo clic sul pulsante «+».

source: The command that will be launched by selecting the action in Nautilus popup menu.
it: Il comando che sarà eseguito selezionando l'azione dal menù contestuale di Nautilus.
ta: இந்த கட்டளை Nautilus பாப்பப் மெனுவில் தேர்ந்தெடுக்கப்பட்ட செயலை துவக்குகிறது.

source: This software is licensed under the GNU Genaral Public License (GPL)
it: Questo software è rilasciato sotto i termini della GNU General Public License (GPL)

source: Tooltip of the menu item that will appear in the Nautilus statusbar.
it: Il suggerimento dell'elemento del menù che sarà visualizzato nella barra di stato di Nautilus.
ta: மெனு உருப்படியின் உதவிக்கருவி Nautilus நிலைப்பட்டையில் இருக்கும்.

source: Tooltip:
it: Suggerimento:
ta: உதவிகருவி:

source: _Browse
it: _Esplora
ta: உலாவி (_B)

source: _Legend
it: _Legenda
ta: இதிகாசம் (_L)

source: Can't duplicate action '%s'!
it: Impossibile duplicare l'azione «%s».
ta: '%s' இன் செயலை போலியாக்க முடியாது!

source: Icon
it: Icona
ta: சின்னம்

source: Label
it: Etichetta
ta: விளக்கச்சீட்டு

source: Could not load interface for Nautilus Actions Config Tool
it: Impossibile caricare l'interfaccia dello strumento di configurazione delle azioni di Nautilus
ta: நாடுலஸ் செயல்கள் அமைப்பு கருவிக்கு ஒரு இடைமுகத்தை ஏற்ற முடியவில்லை

source: /path/to
it: /percorso/del/comando/

source: folder1
it: cartella1

source: folder2
it: cartella2

source: folder
it: cartella
ta: அடைவு

source: Can't copy action's profile '%s'!
it: Impossibile copiare il profilo dell'azione «%s».
ta: செயலின் உருவரை '%s'யை பிரதி எடுக்க முடியவில்லை!

source: Can't paste action's profile '%s'!
it: Impossibile incollare il profilo dell'azione «%s».
ta: செயலின் உருவரை '%s'யை ஒட்ட முடியவில்லை!

source: %s Copy
it: Copia di %s
ta: '%s' யின் பிரதி

source: Can't delete action's profile '%s'!
it: Impossibile eliminare il profilo dell'azione «%s».
ta: செயலின் உருவரை '%s'யை நீக்க முடியவில்லை!

source: Profile Name
it: Nome del profilo
ta: உருவரை பெயர்

source: Icon of the menu item in the Nautilus popup menu
it: Icona dell'elemento nel menù contestuale di Nautilus
ta: நாடுலஸ் துள்ளு பட்டியில் தோன்ற வேண்டிய மெனு உருப்படியின் சின்னம்

source: Add a New Action
it: Aggiungi una nuova azione
ta: புதிய செயல் சேர்

source: Edit Action "%s"
it: Modifica l'azione «%s»
ta: செயல் "%s" ஐ திருத்து

source: Can't parse file '%s' as GConf schema description file!
it: Impossibile analizzare il file «%s» come file di descrizione di uno schema di GConf.
ta: கோப்பு '%s'ஐ GConf schema விவரிப்பு கோப்பாக பகுக்க முடியவில்லை!

source: Action '%s' importation failed!
it: Importazione dell'azione «%s» non riuscita.
ta: செயல் '%s' ஐ இறக்குமதி செய்ய முடியவில்லை!

source: %sLocal Files
it: %sFile locali
ta: %sஉள்ளமை கோப்புகள்

source: %sSSH Files
it: %sFile SSH
ta: %sSSH கோப்புகள்

source: %sWindows Files
it: %sFile di Windows
ta: %sWindows கோப்புகள்

source: %sFTP Files
it: %sFile FTP
ta: %sFTP கோப்புகள்

source: %sWebdav Files
it: %sFile WebDav
ta: %sWebdav கோப்புகள்

source: New Scheme Description
it: Descrizione del nuovo schema
ta: புதிய திட்டம் விவரணம்

source: Scheme
it: Schema
ta: திட்டம்

source: Add a New Profile
it: Aggiungi un nuovo profilo
ta: புதிய உருவரையை சேர்க்கவும்

source: Edit Profile "%s"
it: Modifica il profilo «%s»
ta: உருவரை "%s" ஐ திருத்து

source: The label of the menu item
it: L'etichetta della voce del menù
ta: பட்டியல் உருப்படியின் அடையாளம்

source: LABEL
it: ETICHETTA

source: The tooltip of the menu item
it: Il suggerimento della voce del menù
ta: பட்டியல் உருப்படியின் கருவிக்குறிப்பு

source: TOOLTIP
it: SUGGERIMENTO

source: The icon of the menu item (filename or GTK stock ID)
it: L'icona della voce del menù (nome del file o ID dello stock di icone GTK)
ta: மெனு உருப்படியின் சின்னம் (கோப்பு பெயர் அல்லது GTK ஸ்டாக் ID)

source: ICON
it: ICONA

source: The path of the command
it: Percorso del comando
ta: கட்டளையின் பாதை

source: PATH
it: PERCORSO

source: The parameters of the command
it: I parametri del comando
ta: கட்டளையின் அளபுருக்கள்.

source: PARAMS
it: PARAMETRI

source: A pattern to match selected files against. May include wildcards (* or ?) (you must set one option for each pattern you need)
it: Un modello per individuare i file selezionati. Può contenere caratteri speciali (* o ?) (è necessario impostare una opzione per ogni modello di cui si ha bisogno)
ta: ஒரு தோற்றம் தேர்ந்தெடுக்கப்பட்ட கோப்புகளுக்கு எதிராக பொருந்த வேண்டும். ஒயில்ட் கார்ட்களை சேர்க்க வேண்டும் (* அல்லது ?) (உங்களுக்கு வேண்டிய ஒவ்வொரு தோற்றத்தில் ஒரு விருப்பத்தை அமைக்க வேண்டும்)

source: EXPR
it: ESPRESSIONE

source: A pattern to match selected files' mimetype against. May include wildcards (* or ?) (you must set one option for each pattern you need)
it: Un modello per individuare il tipo MIME del file selezionato. Può contenere caratteri speciali (* o ?) (è necessario impostare una opzione per ogni modello di cui si ha bisogno)
ta: ஒரு தோற்றம் தேர்ந்தெடுக்கப்பட்ட கோப்புகளின் mimetypeக்கு எதிராக பொருந்த வேண்டும். ஒயில்ட் கார்ட்களை சேர்க்க வேண்டும் (* அல்லது ?) (உங்களுக்கு வேண்டிய ஒவ்வொரு தோற்றத்தில் ஒரு விருப்பத்தை அமைக்க வேண்டும்)

source: Set it if the selection can contain files
it: Impostare se la selezione può contenere file
ta: தேர்ந்தெடுத்தல் கோப்புகளை கொண்டிருந்தால் அமை

source: Set it if the selection can contain folders
it: Impostare se la selezione può contenere cartelle
ta: தேர்ந்தெடுத்தல் கோப்புறைகளை கொண்டிருந்தால் அமை

source: Set it if the selection can have several items
it: Impostare se la selezione può contenere più di un elemento
ta: பல்வேறு உருப்படிகளை தேர்ந்தெடுத்தல் கொண்டிருத்தால் அமை

source: A GnomeVFS scheme where the selected files should be located (you must set it for each scheme you need)
it: Uno schema di Gnome VFS dove i file selezionati dovrebbero essere posizionati (è necessario impostarlo per ogni schema di cui si ha bisogno)
ta: ஒரு GnomeVFS திட்டத்தில் தேர்ந்தெடுக்கப்பட்ட கோப்புகளை வைக்க வேண்டும் (இதனை நீங்கள் ஒவ்வொரு திட்டத்திற்கு வேண்டிய மட்டும் அமைக்க வேண்டும்)

source: SCHEME
it: SCHEMA

source: The path of the file where to save the new GConf schema definition file [default: /tmp/config_UUID.schemas]
it: Il percorso del file dove salvare la nuova definizione dello schema di GConf [predefinito: /tmp/config_UUID.schemas]
ta: புதிய GConf schema விவரிப்பு கோப்பினை சேமிக்க இருக்கும் பாதை[default: /tmp/config_UUID.schemas]

source: Syntax error: - %s Try %s --help
it: Errore di sintassi: - %s Usare %s --help
ta: இலக்கண பிழை: - %s %s --helpஐ முயற்சிக்கவும்

source: Creating %s...
it: Creazione di %s...
ta: %sஐ உருவாக்குகிறது...

source: Failed: Can't create %s: %s
it: Errore: impossibile creare %s: %s
ta: தோல்வியுற்றது: %sஐ உருவாக்க முடியவில்லை: %s

source: OK, saved in %s
it: Ok, salvato in %s
ta: சரி, %sஇல் சேமிக்கப்பட்டது

source: Failed: %s
it: Errore: %s
ta: தோல்வியுற்றது: %s

source: Can't write data in file %s
it: Impossibile scrivere informazioni nel file %s
ta: கோப்பு %sஇல் தரவை எழுத முடியவில்லை

source: Can't open file %s for writing
it: Impossibile aprire il file %s in scrittura
ta: கோப்பு %sஇல் எழுத திறக்க முடியவில்லை

source: The label of the menu item that will appear in the Nautilus popup menu when the selection matches the appearance condition settings
it: L'etichetta della voce del menù che sarà visualizzata nel menù contestuale di Nautilus quando la selezione corrisponde alle impostazioni della condizione di apparizione
ta: தேர்வு தோற்ற நிபந்தனை அமைப்புடன் பொருந்தினால் நாடுலஸ் துள்ளு பட்டியில் தோன்ற வேண்டிய மெனு உருப்படியின் அடையாளம்

source: The tooltip of the menu item that will appear in the Nautilus statusbar when the user points to the Nautilus popup menu item with his/her mouse
it: Il suggerimento della voce del menù che sarà visualizzata nella barra di stato di Nautilus quando si passa con il mouse sulla voce del menù contestuale di Nautilus
ta: பயனர் நாடுலஸ் துள்ளு மெனுவில் அவரது சொடுக்கியால் சுட்டும் போது நாடுலஸ் நிலைப்படியில் தோன்ற வேண்டிய கருவிக்குறிப்பு

source: The icon of the menu item
it: L'icona dell'elemento del menù
ta: பட்டியல் உருப்படியின் சின்னம்

source: The icon of the menu item that will appear next to the label in the Nautilus popup menu when the selection matches the appearance conditions settings
it: L'icona della voce del menù che sarà visualizzata dopo l'etichetta nel menù contestuale di Nautilus quando la selezione corrisponde alle impostazioni delle condizioni di apparizione
ta: தேர்வு தோற்ற நிபந்தனை அமைப்புடன் பொருந்தினால் நாடுலஸ் துள்ளு பட்டியில் அடையாளத்துக்கு பக்கதில் தோன்ற வேண்டிய மெனு உருப்படியின் சின்னம்

source: A description name of the profile
it: Un nome descrittivo del profilo
ta: உருவரை பெயரின் விவரம்
