Repository: GNOME/filemanager-actions
Catalog: po/*.po
Languages: da, id, it, ta

source: When checked, the item will be candidate to be displayed in the file manager context menu, with a non-empty selection.
da: Når markeret vil elementet være kandidat til at blive vist med en ikke-tom markering i Nautilus' genvejsmenu.

source: Display item in _location context menu
da: Vis element i _placeringsgenvejsmenuen

source: When checked, the item will be candidate to be displayed in the file manager context menu when the selection is empty. In this case, the defined conditions will be applied to the current displayed folder.
da: Når markeret vil elementet være kandidat til at blive vist i Nautilus' genvejsmenu, når markeringen er tom. I dette tilfælde vil de definerede betingelser blive anvendt på den mappe, der vises nu.

source: _Context label :
da: _Genvejsetiket:
id: Label _konteks :

source: The label of the item in the file manager context menus.
da: Elementets etiket i Nautilus' genvejsmenuer.

source: Display item in the _toolbar
da: Vis element på _værktøjslinjen

source: When checked, the item will be candidate to be displayed in the file manager toolbar. In this case, the defined conditions will be applied to the current folder, and do not depend of the possible current selection.
da: Når markeret vil elementet være kandidat til at blive vist på Nautilus' værktøjslinje. I dette tilfælde vil de definerede betingelser blive anvendt på den mappe, der vises nu, og ikke afhænge af en mulig aktuel markering.

source: Use s_ame label for icon in the toolbar
da: _Brug samme etiket for ikon på værktøjslinjen

source: When checked, the label displayed in the toolbar will be the same that the one displayed in the context menus.
da: Når markeret vil etiketten vist på værktøjslinjen være den samme, som den der vises i genvejsmenuerne.

source: T_oolbar label :
da: V_ærktøjslinjeetiket:
id: _Label bilah alat :

source: The label displayed in the file manager toolbar.
da: Etiketten vist på Nautilus' værktøjslinje.

source: Toolti_p :
da: Værktøjsti_p:

source: The tooltip displayed in the file manager user interface.
da: Værktøjstippet vist i Nautilus' brugergrænseflade.

source: _Icon :
da: _Ikon:
id: _Ikon :

source: _Browse…
da: _Gennemse …
id: Ram_ban…

source: The name of a themed icon or the filename of an image.
da: Et tematiseret ikons navn eller et billedes filnavn.

source: <b> Nautilus item </b>
da: <b> Nautilus-element </b>
id: <b> Butir Nautilus </b>

source: This tab lets you determine the main characteristics of the currently selected item.
da: Dette faneblad lader dig bestemme det valgte elements hovedegenskaber.

source: _Label :
da: _Etiket:

source: <b> Profile </b>
da: <b> Profil </b>
id: <b> Profil </b>

source: _Path :
da: _Sti:

source: P_arameters :
da: _Parametre:
id: P_arameter :

source: _Working directory :
da: Ar_bejdsmappe:
id: Direktori _kerja :

source: The path of the command. If this is not an absolute path, then the PATH environment variable at execution time will be considered.
da: Stien til kommandoen. Hvis det ikke er en absolut sti, vil PATH-miljøvariablen blive benyttet ved kørselstid.

source: _Browse...
da: _Gennemse …
id: Ram_ban...

source: The parameters of the command.
da: Kommandoens parametre.
id: Parameter perintah.

source: Le_gend
da: Fo_rklaring
id: Le_genda

source: Example
da: Eksempel
id: Contoh

source: <small><i>Example</i></small>
da: <small><i>Eksempel</i></small>
id: <small><i>Contoh</i></small>

source: The default working directory the command should be started in.
da: Standardarbejdsmappen kommandoen vil starte i.

source: B_rowse...
da: G_ennemse …
id: _Ramban...

source: <b> Command </b>
da: <b> Kommando </b>
id: <b> Perintah </b>

source: This tab lets you choose the command to be executed, along with its parameters. Defining several profiles lets you have several commands, each applying with a different set of conditions.
da: Dette faneblad lader dig vælge den kommando, der skal køres, sammen med dens parametre. Ved at definere flere profiler kan du have flere kommandoer, som køres med hver deres forskellige sæt af betingelser.

source: _Command
da: _Kommando
id: _Perintah

source: The command will be started as a standard graphical user interface.
da: Kommandoen vil blive startet som en almindelig grafisk brugergrænseflade.

source: In a _terminal
da: I en _terminal
id: Dalam _terminal

source: The command will be started in the preferred terminal of the graphical environment.
da: Kommandoen vil blive startet i dit grafiske miljøs foretrukne terminal.
id: Perintah akan dimulai di terminal yang dipilih dari lingkungan grafis.

source: _Embedded
da: _Indlejret
id: T_ertanam

source: This option makes use of a special feature of the file manager, which would allow a terminal to be ran inside of it. An acceptable fallback is running in the standard terminal.
da: Denne mulighed gør brug af en særlig funktion i Nautilus, som tillader, at en terminal kan køre inden i den. Et acceptabelt alternativ er kørsel i standardterminalen.

source: _Display output
da: _Visningsoutput
id: _Tampilkan keluaran

source: The command will be run in a terminal. The terminal will be closed at the end of the execution; standard error and output streams will be displayed. An acceptable fallback is running in the standard terminal.
da: Kommandoen vil blive kørt i en terminal. Terminalen vil blive lukket efter afvikling af kommandoen; standardfejl og outputstrømme vil blive vist. Et acceptabelt alternativ er kørsel i standardterminalen.

source: <b> Execution mode </b>
da: <b> Kørselstilstand </b>
id: <b> Mode eksekusi </b>

source: _Startup notify
da: _Påmindelse ved opstart

source: When checked, it is known that the run command will send a “remove” message to the desktop environment. See the Startup Notification Protocol Specification for more details. Only relevant when chosen execution mode is Normal.
da: Når markeret vides det, at den kørte kommando sender en fjernelsesbesked til skrivebordsmiljøet. Se specifikationen for opstartspåmindelseprotokollen for flere detaljer. Kun relevant når den valgte kørselstilstand er normal.

source: Startup Window Manager _class :
da: Opstart a_f vindueshåndteringsklasse:

source: When specified, this should be the name of a WM class of at least one window of the run command. See the Startup Notification Protocol Specification for more details. Only relevant when chosen execution mode is Normal.
da: Når angivet skal det være navnet på en vindueshåndteringsklasse på mindst et vindue af den kørte kommando. Se specifikationen for opstartspåmindelseprotokollen (Startup Notification Protocol Specification) for flere detaljer. Kun relevant når den valgte kørselstilstand er normal.

source: <b> Startup mode </b>
da: <b> Opstartstilstand </b>
id: <b> Mode awal mula </b>

source: Execute as _user :
da: Kør som _bruger:
id: Jalankan sebagai pengg_una :

source: Enter here the user the command should be ran as. The user may be defined by his numeric UID or his login name. Leave the field empty to run the command as the current user.
da: Indtast brugeren, som kommandoen skal køres som, her. Brugeren kan identificeres ved sit numeriske UID eller sit brugernavn. Lad feltet være tomt for at køre kommandoen som den aktuelle bruger.

source: <b> Execute as user </b>
da: <b> Kør som bruger </b>
id: <b> Eksekusi sebagai pengguna </b>

source: This advanced tab lets you precisely define how your command will be executed.
da: Fanebladet med avancerede indstillinger lader dig definere nøjagtigt, hvordan kommandoen skal køres.

source: E_xecution
da: K_ørsel
id: E_ksekusi

source: The current item will appear if the basename of each element of the selection matches one filter of the “Must match one of” column, while not matching any of the filters of the “Must not match any of” column.
da: Det aktuelle element vil optræde, hvis basisnavnet på hvert element i markeringen matcher et filter i kolonnen “Skal matche en af”, mens det ikke matcher nogen af filtrene i kolonnen “Må ikke matche nogen af”.

source: This list lets you determine for which basenames the currently selected item will be displayed in the Nautilus context menu. Basenames may use “*” and “?” wildcards. Basenames may be negated to specify for which basenames your item must not appear.
da: Denne liste lader dig bestemme, for hvilke basisnavne det valgte element vil blive vist i Nautilus' genvejsmenu. Basisnavne kan bruge jokertegnene “*” og “?”. Basisnavne kan negeres for at angive, for hvilke basisnavne elementet ikke skal optræde.

source: Click to add a new basename filter.
da: Klik for at tilføje et nyt basisnavnefilter.

source: Click to remove the current basename filter.
da: Klik for at fjerne det aktuelle basisnavnefilter.

source: Match _case
da: _Match store/små bogstaver
id: _Cocok huruf besar kecil

source: Click to define the above basename filters as case sensitive.
da: Klik for at angive at basisnavnefiltrene ovenfor skal skelne mellem store og små bogstaver.

source: <b> Basenames conditions </b>
da: <b> Betingelser for basisnavne </b>
id: <b> Kondisi nama basis </b>

source: This tab lets you determine for which basenames the currently selected item will be displayed in the Nautilus context menu. Basenames may be negated to specify for which basenames your item must not appear.
da: Dette faneblad lader dig bestemme, for hvilke basisnavne det valgte element vil blive vist i Nautilus' genvejsmenu. Basisnavne kan negeres for at angive, for hvilke basisnavne elementet ikke skal optræde.

source: _Basenames
da: _Basisnavne
id: _Basename

source: The current item will appear if the mimetype of each element of the selection matches one filter of the “Must match one of” column, while not matching any of the filters of the “Must not match any of” column.
da: Det aktuelle element vil optræde, hvis MIME-typen for hvert element i markeringen matcher et filter i kolonnen “Skal matche en af”, mens det ikke matcher nogen af filtrene i kolonnen “Må ikke matche nogen af”.

source: This list lets you determine for which mimetypes the currently selected item will be displayed in the Nautilus context menu. Mimetypes may be specified as “*”, “*/*”, “group/*” or “group/subgroup”. Mimetypes may be negated to specify for which type of objects your item must not appear.
da: Denne liste lader dig bestemme, for hvilke MIME-typer det valgte element vil blive vist i Nautilus' genvejsmenu. MIME-typer kan angives som “*”, “*/*”, “gruppe/*” or “gruppe/undergruppe”. MIME-typer kan negeres for at angive, for hvilken type objekter elementet ikke skal optræde.

source: Click to add a new mimetype filter.
da: Klik for at tilføje et nyt MIME-typefilter.

source: Click to remove the current mimetype filter.
da: Klik for at fjerne det aktuelle MIME-typefilter.

source: <b> Mimetypes conditions </b>
da: <b> Betingelser for MIME-typer </b>
id: <b> Kondisi mimetype </b>

source: This tab lets you determine for which mimetypes the currently selected item will be displayed in the Nautilus context menu. Mimetypes may be specified as “*”, “/*”, “group/*” or “group/subgroup”. Mimetypes may be negated to specify for which type of objects your item must not appear.
da: Dette faneblad lader dig bestemme, for hvilke MIME-typer det valgte element vil blive vist i Nautilus' genvejsmenu. MIME-typer kan angives som “*”, “*/*”, “gruppe/*” or “gruppe/undergruppe”. MIME-typer kan negeres for at angive, for hvilken type objekter elementet ikke skal optræde.

source: _Mimetypes
da: _MIME-typer
id: _Mimetype

source: The current item will appear if the location of each element of the selection is one or inside one of the paths of the “Must match one of” column, while not being one or inside one of the “Must not match any of” column.
da: Det aktuelle element vil optræde, hvis placeringen af hvert element i markeringen er en eller er inden i en af stierne i kolonnen “Skal matche en af”. Samtidig må det ikke være en eller være inden i en i kolonnen “Må ikke matche nogen af”.

source: This list lets you determine where (in which folders) the currently selected files must be found in order for the item to be displayed in the Nautilus context menu. Folders may use “*” or “?” wildcards. Folder filters may be negated to specify for which folders your item must not appear.
da: Denne liste lader dig bestemme, hvor (i hvilke mapper) de valgte filer skal være, for at elementet vil blive vist i Nautilus' genvejsmenu. Mapper kan bruge jokertegnene “*” og “?”. Mappefiltre kan negeres for at angive, for hvilke mapper elementet ikke skal optræde.

source: Click to add a new folder filter.
da: Klik for at tilføje et nyt mappefilter.

source: Click to browse the filesystem in order to select a new folder filter.
da: Klik for at gennemse filsystemet for at vælge et nyt mappefilter.

source: Click to remove the current folder filter.
da: Klik for at fjerne det aktuelle mappefilter.

source: <b> Folders conditions </b>
da: <b> Betingelser for mapper </b>
id: <b> Kondisi folder </b>

source: This tab lets you determine where (in which folders) the currently selected files must be found in order for the item to be displayed in the Nautilus context menu. Folder filters may be negated to specify for which folders your item must not appear.
da: Dette faneblad lader dig bestemme, hvor (i hvilke mapper) de valgte filer skal være, for at elementet vil blive vist i Nautilus' genvejsmenu. Mappefiltre kan negeres for at angive, for hvilke mapper elementet ikke skal optræde.

source: _Folders
da: _Mapper
id: _Folder

source: The current item will appear if the scheme of each element of the selection matches one of the “Must match one of” column, while not matching any of the “Must not match any of” column.
da: Det aktuelle element vil optræde, hvis typen for hvert element i markeringen matcher et filter i kolonnen “Skal matche en af”, mens det ikke matcher nogen af filtrene i kolonnen “Må ikke matche nogen af”.

source: This list lets you determine which schemes the currently selected files must satisfy in order for the item to be displayed in the Nautilus context menu. Filters may be negated to specify for which schemes your item must not appear.
da: Denne liste lader dig bestemme, hvilke typer de valgte filer skal opfylde, for at elementet vil blive vist i Nautilus' genvejsmenu. Filtre kan negeres for at angive, for hvilke typer elementet ikke skal optræde.

source: Click to add a new scheme filter.
da: Klik for at tilføje et nyt typefilter.

source: De_faults…
da: S_tandarder …
id: _Baku…

source: Click to select a new scheme filter among default schemes.
da: Klik for at vælge et nyt typefilter blandt standardtyperne.

source: Click to remove the current scheme filter.
da: Klik for at fjerne det aktuelle typefilter.

source: <b> Schemes conditions </b>
da: <b> Betingelser for typer </b>
id: <b> Kondisi skema </b>

source: This tab lets you determine which schemes the currently selected files must satisfy in order for the item to be displayed in the Nautilus context menu. Filters may be negated to specify for which schemes your item must not appear.
da: Dette faneblad lader dig bestemme, hvilke typer de valgte filer skal opfylde, for at elementet vil blive vist i Nautilus' genvejsmenu. Filtre kan negeres for at angive, for hvilke typer elementet ikke skal optræde.

source: _Schemes
da: _Typer
id: _Skema

source: The current item will appear if each element of the selection matches all capabilities of the “Must match all of” column, while not matching any capability of the “Must not match any of” column.
da: Det aktuelle element vil optræde, hvis hvert element i markeringen matcher alle egenskaber i kolonnen “Skal matche en af”, mens det ikke matcher nogen af egenskaberne i kolonnen “Må ikke matche nogen af”.

source: This list lets you determine which capabilities the currently selected files must satisfy in order for the item to be displayed in the Nautilus context menu. Capabilities may be negated to specify for which capabilities your item must not appear.
da: Denne liste lader dig bestemme, hvilke egenskaber de valgte filer skal opfylde, for at elementet vil blive vist i Nautilus' genvejsmenu. Egenskaber kan negeres for at angive, for hvilke egenskaber elementet ikke skal optræde.

source: Click to add a new capability filter.
da: Klik for at tilføje et nyt egenskabsfilter.

source: Click to remove the current capability.
da: Klik for at fjerne den aktuelle egenskab.

source: <b> Capabilities conditions </b>
da: <b> Betingelser for egenskaber </b>
id: <b> Kondisi kapabilitas </b>

source: This tab lets you determine which capabilities the currently selected files must satisfy in order for the item to be displayed in the Nautilus context menu. Filters may be negated to specify for which capabilities your item must not appear.
da: Dette faneblad lader dig bestemme, hvilke egenskaber de valgte filer skal opfylde, for at elementet vil blive vist i Nautilus' genvejsmenu. Filtre kan negeres for at angive, for hvilke egenskaber elementet ikke skal optræde.

source: Ca_pabilities
da: _Egenskaber
id: Ka_pabilitas

source: _Count :
da: Anta_l:
id: _Cacah :

source: <b> Appears if selection contains </b>
da: <b> Optræder hvis markeringen indeholder </b>
id: <b> Muncul bila seleksi memuat </b>

source: Item may appear depending of the desktop environment.
da: Elementet kan optræde afhængigt af skrivebordsmiljøet.

source: _Always appears
da: _Optræder altid
id: Sel_alu muncul

source: _Only appears in selected environments
da: Op_træder kun i valgte miljøer

source: _Never appears in selected environments
da: O_ptræder aldrig i valgte miljøer

source: <b> Desktop environment </b>
da: <b> Skrivebordsmiljø </b>
id: <b> Lingkungan desktop </b>

source: Appears if the file is e_xecutable :
da: Optræder hvis filen er _eksekverbar:

source: Appears if the name is _registered on D-Bus :
da: Optræder hvis navnet er _registreret på D-Bus:

source: Appears if the command outputs “_true” :
da: Optræder hvis kommandoens output er “t_rue”:

source: Appears if the _binary is running :
da: Optræder hvis _binærfilen kører:

source: Bro_wse…
da: _Gennemse …
id: Ra_mban…

source: This is an advanced condition based on the presence of an executable file on the file system. This may be used for example to test for a prerequisite package.
da: Dette er en avanceret betingelse baseret på tilstedeværelsen af en ekskverbar fil i filsystemet. Dette kan f.eks. bruges til at teste for en nødvendig pakke.
id: Ini adalah kondisi lanjutan berdasarkan keberadaan berkas yang dapat dieksekusi pada sistem berkas. Ini dapat digunakan misalnya untuk menguji paket prasyarat.

source: This is an advanced condition based on the presence of a particular service on the D-Bus system. This may be used for example for testing that a prerequisite service is currently available.
da: Dette er en avanceret betingelse baseret på tilstedeværelsen af en bestemt tjeneste i D-Bussystemet. Dette kan f.eks. bruges til at teste for, om en nødvendig tjeneste er tilgængelig.

source: This is an advanced condition based on a runtime result. Enter here a command which is able to display the exact “true” string on its standard output. This may be used for example for testing a complex condition.
da: Dette er en avanceret betingelse baseret på resultatet af en kørsel. Indtast en kommando, som er i stand til at vise den nøjagtige “true”-streng i standardoutput. Dette kan f.eks. bruges til at teste for en sammensat betingelse.

source: Brow_se…
da: G_ennemse …
id: Ramba_n…

source: This is an advanced condition based on the presence of a running binary. Note that only the basename of the binary is checked, not its dirname nor its parameters. This may be used for example for testing the presence of a prerequisite daemon.
da: Dette er en avanceret betingelse baseret på tilstedeværelsen af kørende binærfil. Bemærk at kun binærfilens basisnavn tjekkes og ikke dens (ophavs)mappenavn eller parametre. Dette kan f.eks. bruges til at teste for tilstedeværelsen af en nødvendig dæmon.

source: <b> Execution environment </b>
da: <b> Kørselsmiljø </b>
id: <b> Lingkungan eksekusi </b>

source: This tab lets you determine some advanced conditions the currently selected files must satisfy in order for the item to be displayed in the file manager context menu.
da: Dette faneblad lader dig bestemme nogle avancerede egenskaber, de aktuelt valgte filer skal opfylde, for at elementet vil blive vist i Nautilus' genvejsmenu.

source: _Environment
da: _Miljø
id: _Lingkungan

source: E_nabled
da: A_ktiveret
id: Diaktifka_n

source: Check the box to enable this item. If unchecked, then the item will never appear in the file manager context menus or toolbar.
da: Markér afkrydsningsfeltet for at aktivere dette element. Hvis umarkeret vil elementet aldrig optræde i Nautilus' genvejsmenuer eller værktøjslinje.

source: _Description :
da: _Beskrivelse:
id: _Deskripsi :

source: Enter here a free text which may be used (e.g. in a Web service or in a search tool) to describe your item.
da: Indtast en frit valgt tekst, som kan bruges (f.eks. i en webtjeneste eller et søgeværktøj) til at beskrive dit element.

source: Suggested _shortcut :
da: Foreslået genve_j:
id: Pintasan yang di_sarankan :

source: Enter here the keyboard touch combination you suggest as a shortcut to your action. Note: this is not yet implemented in FileManager-Actions.
da: Indtast tastekombinationen, som du foreslår som genvej til din handling. Bemærk: Dette er endnu ikke implementeret i Nautilus-handlinger.

source: <b> Action editable properties </b>
da: <b> Handlingsegenskaber som kan redigeres </b>
id: <b> Properti aksi yang dapat disunting </b>

source: Read-only item
da: Skrivebeskyttet element
id: Butir hanya-baca

source: This box is checked if the item cannot be edited. There may be multiple reasons for why an item cannot be edited. See your User’s Manual.
da: Dette afkrydsningsfelt er markeret, hvis elementet ikke kan redigeres. Der kan være mange grunde til, et element ikke kan redigeres. Se din brugermanuel.

source: I/O provider :
da: I/O-udbyder:
id: Penyedia I/O :

source: <b> Read-only properties </b>
da: <b> Skrivebeskyttede egenskaber </b>
id: <b> Properti hanya baca </b>

source: This tab lets you edit some miscellaneous properties, and access some non-modifiable information.
da: Dette faneblad lader dig redigere diverse egenskaber og tilgå ikke-redigerbar information.

source: P_roperties
da: _Egenskaber
id: P_roperti

source: Must match one of
da: Skal matche en af
id: Harus cocok dengan salah satu dari

source: Must match all of
da: Skal matche alle
id: Harus cocok dengan semua dari

source: Must not match any of
da: Må ikke matche nogen af
id: Tidak boleh cocok dengan salah satu dari

source: “%s” filter already exists in the list. Please provide another one.
da: Filteret “%s” findes allerede på listen. Angiv venligst et andet.
id: Filter "%s" sudah ada dalam daftar. Harap berikan yang lain.

source: new-filter
da: nyt-filter
id: tapis baru

source: Display information about this program
da: Vis oplysninger om dette program

source: Display help about this program
da: Vis hjælp til dette program
id: Menampilkan bantuan tentang program ini

source: Edit your preferences
da: Redigér dine indstillinger
id: Menyunting preferensi Anda

source: Quit the application
da: Afslut programmet
id: Keluar aplikasi

source: Insert a new menu at the current position
da: Indsæt en ny menu på den aktuelle placering
id: Menyisipkan menu baru pada posisi saat ini

source: Define a new action
da: Definér en ny handling
id: Mendefinisikan suatu aksi baru

source: Define a new profile attached to the current action
da: Definér en ny profil knyttet til den aktuelle handling
id: Menentukan profil baru yang melekat pada tindakan saat ini
