Repository: GNOME/filemanager-actions
Catalog: po/*.po
Languages: da, id, it, ta

source: Execute as user
da: Kør som bruger
id: Jalankan sebagai pengguna

source: The user the command must be ran as. The user may be identified by its numeric UID or by its login. The profile is ignored if defined with a non-existing UID or login. Defaults to empty: the command will be executed as the current user.
da: Brugeren som kan køre kommandoen. Brugeren kan identificeres ved sit numeriske UID eller sit login. Profilen ignoreres, hvis den er defineret med et ikke-eksisterende UID eller login. Som standard tom: kommandoen vil blive kørt som den aktuelle bruger.
id: Perintah harus dijalankan sebagai pengguna ini. Pengguna dapat diidentifikasi dengan UID numerik atau dengan login-nya. Profil diabaikan jika didefinisikan dengan UID atau login yang tidak ada. Defaultnya kosong: perintah akan dieksekusi sebagai pengguna saat ini.

source: Error when querying information for %s URI: %s
da: Fejl under forespørgsel om informationer for %s-URI: %s

source: file:///path/to/file1.mid
da: file:///sti/til/fil1.mid
id: berkas:///path/ke/berkas1.mid

source: file:///path/to/file2.jpeg
da: file:///sti/til/fil2.jpeg
id: berkas:///path/ke/berkas2.jpeg

source: audio/x-midi
da: lyd/x-midi

source: image/jpeg
da: billede/jpeg

source: test.example.net
da: test.eksempel.dk

source: user
da: bruger
id: pengguna

source: Output of the run command
da: Den kørte kommandos output
id: Keluaran dari menjalankan perintah

source: Run command:
da: Kør kommando:
id: Jalankan perintah:

source: Standard error:
da: Standardfejl:
id: Galat standar:

source: FileManager-Actions Desktop I/O Provider
da: Nautilus-handlingers skrivebords-I/O-udbyder
id: Penyedia I/O Desktop FileManager-Actions

source: Export as a ._desktop file
da: Eksportér som ._desktop-fil
id: Ekspor sebagai sebuah berkas .desktop

source: This format has been introduced with v 3.0 series, and should be your newly preferred format when exporting items. It let you easily share your actions with the whole world, including with users of other desktop environments, as long as their own application implements the DES-EMA specification which describes this format. The exported .desktop file may later be imported via : • Import assistant of the FileManager-Actions Configuration Tool, • drag-n-drop into the FileManager-Actions Configuration Tool, • or by copying it into a XDG_DATA_DIRS/file-manager/actions directory.
da: Dette format blev introduceret med v. 3.0-serien, og bør være dit nye foretrukne format til eksport af elementer. Det lader dig let dele dine handlinger med hele verden, inklusive brugere af andre skrivebordsmiljøer, så længe deres egen applikation implementerer DES-EMA-specifikationen, som beskriver dette format. Den eksporterede .desktop-fil kan senere importeres via: • Importassistenten i Nautilus-handlingers konfigurationsværktøj, • træk-og-slip ind i Nautilus-handlingers konfigurationsværktøj, • eller ved at kopiere den ind i en XDG_DATA_DIRS/file-manager/actions-mappe.

source: The Desktop I/O Provider is not able to handle the URI
da: Skrivebords-I/O-udbyderen kan ikke håndtere URI'en
id: Penyedia I/O Desktop tidak mampu menangani URI

source: unknown type: %s
da: ukendt type: %s
id: tipe tak dikenal: %s

source: FileManager-Actions GConf I/O Provider
da: Nautilus-handlingers GConf-I/O-udbyder
id: Penyedia I/O GConf FileManager-Actions

source: Item ID not found.
da: Element-id blev ikke fundet.
id: ID butir tidak ditemukan.

source: Unwaited key path %s while importing a menu.
da: Uventet nøglesti %s mens en menu blev importeret.

source: Element %s at line %d already found, ignored.
da: Punktet %s i linje %d allerede fundet; ignoreres.
id: Elemen %s pada baris %d telah ditemukan, diabaikan.

source: Invalid item ID: waited for %s, found %s at line %d.
da: Ugyldigt element-id: forventede %s, fandt %s i linje %d.
id: ID butir tidak valid: menunggu %s, menemukan %s pada baris %d.

source: Unknown element %s found at line %d while waiting for %s.
da: Ukendt punkt %s fundet i linje %d, mens %s var forventet.
id: Elemen %s yang tidak dikenal ditemukan pada baris %d ketika menunggu %s.

source: Unknown type %s found at line %d, while waiting for Action or Menu.
da: Ukendt type %s fundet i linje %d, mens handling eller menu blev forventet.
id: Tipe %s yang tidak dikenal ditemukan pada baris %d, ketika menunggu Aksi atau Menu.

source: The XML I/O Provider is not able to handle the URI
da: XML-I/O-udbyderen kan ikke håndtere URI'en
id: Penyedia I/O XML tidak mampu menangani URI

source: Export as a _full GConf schema file
da: Eksportér som en _fuld GConf-skemafil
id: Ekspor sebagai suatu berkas skema GConf _penuh

source: This used to be the historical export format. The exported schema file may later be imported via : • Import assistant of the FileManager-Actions Configuration Tool, • drag-n-drop into the FileManager-Actions Configuration Tool, • or via the gconftool-2 --import-schema-file command-line tool.
da: Dette var tidligere eksportformatet. Den eksporterede skemafil kan senere importeres via: • Importassistenten i Nautilus-handlingers konfigurationsværktøj, • træk-og-slip ind i Nautilus-handlingers konfigurationsværktøj, • eller kommandolinjeværktøjet gconftool-2 --import-schema-file.

source: Export as a _light GConf schema (v2) file
da: Eksportér som en _let GConf-skemafil (v2)
id: Ekspor sebagai sebuah berkas skema GConf _ringan (v2)

source: This format has been introduced in v 1.11 series. This is the lightest schema still compatible with GConf command-line tools, while keeping backward compatibility with the FileManager-Actions Configuration Tool oldest versions. The exported schema file may later be imported via : • Import assistant of the FileManager-Actions Configuration Tool, • drag-n-drop into the FileManager-Actions Configuration Tool, • or via the gconftool-2 --import-schema-file command-line tool.
da: Dette format blev introduceret i v. 1.11-serien. Dette er det letteste skema, som stadig er kompatibelt med GConf-kommandolinjeværktøjerne, mens bagud-kompatibilitet med de ældste versioner af Nautilus-handlingers konfigurationsværktøj bevares. Den eksporterede skemafil kan senere importeres via: • Importassistenten i Nautilus-handlingers konfigurationsværktøj, • træk-og-slip ind i Nautilus-handlingers konfigurationsværktøj, • eller kommandolinjeværktøjet gconftool-2 --import-schema-file.

source: Export as a GConf _dump file
da: Eksportér som en GConf-_dumpfil
id: Ekspor sebagai sebuah berkas _curah GConf

source: This format has been introduced in v 1.11 series. Though not backward compatible with FileManager-Actions Configuration Tool versions previous to 1.11, it may still be imported via standard GConf command-line tools. The exported dump file may later be imported via : • Import assistant of the FileManager-Actions Configuration Tool (1.11 and above), • drag-n-drop into the FileManager-Actions Configuration Tool (1.11 and above), • or via the gconftool-2 --load command-line tool.
da: Dette format blev introduceret i v. 1.11-serien. Det er ikke bagud-kompatibelt med Nautilus-handlingers konfigurationsværktøj ældre end v. 1.11, men kan stadig importeres med standard-GConf-kommandolinjeværktøjer. Den eksporterede dumpfil kan senere importeres via: • Importassistenten i Nautilus-handlingers konfigurationsværktøj (1.11 og senere), • træk-og-slip ind i Nautilus-handlingers konfigurationsværktøj (1.11 og senere), • eller kommandolinjeværktøjet gconftool-2 --load.

source: Quit on Escape
da: Afslut ved escape
id: Keluar saat Escape

source: Should the assistant “Quit” when the user hits Escape ?
da: Skal assistenten “afslutte”, når brugeren trykker Escape?
id: Mestikah asisten "Keluar" ketika pengguna menekan Escape?

source: Warn on Escape
da: Advar ved Escape
id: Peringatkan saat Escape

source: Should the user be asked to confirm when exiting the assistant via Escape ?
da: Skal brugeren spørges, når assistenten afsluttes med Escape?
id: Mestikah pengguna dimintai konfirmasi ketika keluar dari asisten melalui Escape?

source: Are you sure you want to quit this assistant ?
da: Er du sikker på, du ønsker at afslutte assistenten?
id: Anda yakin hendak keluar dari asisten ini?

source: _Cancel
da: _Annullér
id: Bata_l

source: XML UI filename
da: XML-UI-filnavn
id: Nama berkas UI XML

source: The filename which contains the XML UI definition
da: Filnavnet som indeholder XML-UI-definitionen
id: Nama berkas yang memuat definisi UI XML

source: Has its own GtkBuilder
da: Har sin egen GtkBuilder
id: Memiliki GtkBuilder-nya sendiri

source: Whether this BaseWindow reallocates a new GtkBuilder each time it is opened
da: Hvorvidt dette BaseWindow genallokerer en ny GtkBuilder, hver gang det åbnes
id: Apakah BaseWindow ini merealokasikan sebuah GtkBuilder baru setiap kali dibuka

source: Toplevel name
da: Topniveaunavn
id: Nama aras puncak

source: The internal GtkBuildable name of the toplevel window
da: Det interne GtkBuildable-navn på topniveauvinduet
id: Nama GtkBuildable internal dari jendela aras puncak

source: Parent BaseWindow
da: Ophavets BaseWindow
id: BaseWindow Induk

source: A pointer (not a reference) to the BaseWindow parent of this BaseWindow
da: En pointer (ikke en reference) til dette BaseWindows ophavsbasisvindue

source: WSP name
da: WSP-navn
id: Nama WSP

source: The string which handles the window size and position in user preferences
da: Strengen som håndterer vinduesstørrelse og -placering i brugerindstillinger

source: Destroy the Gtk toplevel
da: Ødelæg Gtk-topniveauet
id: Hancurkan Gtk tingkat puncak

source: Whether the embedded Gtk Toplevel should be destroyed at dispose time
da: Hvorvidt det indlejrede GTK-topniveau skal ødelægges ved tidspunktet for fjernelse

source: Unable to load %s UI XML definition: %s
da: Kunne ikke indlæse UI-XML-definitionen %s: %s

source: Unable to load %s dialog definition.
da: Kunne ikke indlæse dialogdefinitionen %s.
id: Tidak bisa memuat definisi dialog %s.

source: File is not a valid .desktop file
da: Filen er ikke en gyldig .desktop-fil
id: Berkas bukan berkas .desktop yang valid

source: Unrecognized desktop file Version “%s”
da: Kunne ikke genkende desktop-filversionen “%s”
id: Berkas desktop Versi "%s" yang tidak dikenal

source: Starting %s
da: Starter %s
id: Memulai %s

source: Application does not accept documents on command line
da: Programmet accepterer ikke dokumenter på kommandolinjen
id: Aplikasi tidak menerima dokumen pada baris perintah

source: Unrecognized launch option: %d
da: Kunne ikke genkende opstartstilvalget: %d
id: Opsi peluncuran yang tidak dikenal: %d

source: Can’t pass document URIs to a “Type=Link” desktop entry
da: Kan ikke overføre dokument-URI'er til en desktop-post med “Type=Link”
id: Tak bisa mengangsurkan URI ke suatu entri desktop "Type=Link"

source: Not a launchable item
da: Ikke et kørbart element
id: Bukan suatu butir yang dapat diluncurkan

source: FileManager-Actions Configuration Tool
da: Nautilus-handlingers konfigurationsværktøj
id: Alat Konfigurasi FileManager-Actions

source: A user interface to edit your own contextual actions
da: En brugergrænseflade til at redigere dine egne kontekstafhængige handlinger med
id: Suatu antarmuka pengguna untuk menyunting aksi kontekstual Anda sendiri

source: Set it to run multiple instances of the program [unique]
da: Angiv den for at køre flere forekomster af programmet [unik]
id: Tata agar menjalankan instansi berganda dari program [unique]

source: Output the version number, and exit gracefully [no]
da: Vis versionsnummeret og afslut kontrolleret [nej]
id: Keluarkan nomor versi, dan keluar secara baik-baik [no]

source: User is the owner of the item
da: Bruger er ejer af elementet
id: Pengguna adalah pemilik butir

source: Item is readable by the user
da: Elementet kan læses af brugeren
id: Butir dapat dibaca oleh pengguna

source: Item is writable by the user
da: Elementet er skrivbart for brugeren
id: Butir dapat ditulisi oleh pengguna

source: Item is executable by the user
da: Elementet kan køres af brugeren
id: Butir dapat dijalankan oleh pengguna

source: Item is local
da: Elementet er lokalt
id: Butir ini lokal

source: %s (already inserted)
da: %s (allerede indsat)
id: %s (sudah pernah disisipkan)

source: Adding a new capability
da: Tilføjelse af ny egenskab
id: Menambah sebuah kapabilitas baru

source: <b>Managed capabilities</b>
da: <b>Håndterede egenskaber</b>
id: <b>Kapabilitas yang dikelola</b>

source: Adding a new scheme
da: Tilføjelse af ny type
id: Menambahkan sebuah skema baru

source: <b>Scheme</b>
da: <b>Type</b>
id: <b>Skema</b>

source: Export canceled due to user action.
da: Eksport afbrudt på grund af brugerhandling.
id: Ekspor dibatalkan karena aksi pengguna.

source: Successfully exported as
da: Eksporteret som
id: Sukses diekspor sebagai

source: You may not have write permissions on selected folder.
da: Du har muligvis ikke skriveadgang til den valgte mappe.
id: Anda mungkin tidak punya hak tulis ke folder yang dipilih.

source: Exporting actions
da: Eksport af handlinger
id: Mengekspor aksi

source: This assistant will guide you through the process of exporting actions.
da: Denne assistent vil hjælpe dig gennem processen med at eksportere handlinger.
id: Asisten ini akan memandu Anda melalui proses aksi pengeksporan.

source: Actions _list :
da: _Liste over handlinger:
id: _Daftar aksi:

source: Please select one or more actions to be exported. You may use Ctrl and Shift keys to extend the selection.
da: Vælg en eller flere handlinger, der skal eksporteres. Du kan bruge Ctrl- og skifttasterne til at forøge markeringen.

source: Selecting the exported actions
da: Valg af eksporterede handlinger
id: Memilih aksi-aksi yang diekspor

source: Selecting the target folder
da: Valg af målmappe
id: Memilih folder target

source: Which format should I use when exporting these items ?
da: Hvilket format skal jeg bruge til eksport af disse elementer?

source: Selecting the export format
da: Valg af eksportformat
id: Memilih format ekspor

source: About to export selected items:
da: Ved at eksportere valgte elementer:
id: Akan mengekspor butir-butir yang dipilih:

source: Into the destination folder:
da: Til destinationsmappe:
id: Ke dalam folder tujuan:

source: Summary
da: Sammendrag
id: Ringkasan

source: Selected items have been proceeded:
da: Valgte handlinger er udført:

source: Export is done
da: Eksport er færdig
id: Ekspor selesai

source: Not imported
da: Ikke importeret
id: Tidak diimpor

source: Importing actions
da: Import af handlinger
id: Aksi mengimpor

source: This assistant will guide you through the process of importing items, actions or menus.
da: Denne assistent vil hjælpe dig med gennem processen med at importere elementer, handlinger eller menuer.

source: Selecting files to import
da: Valg af filer til import
id: Memilih berkas yang akan diimpor

source: What should I do when importing an item whose ID already exists ?
da: Hvad skal jeg gøre, når jeg importerer et element, hvis id allerede eksisterer?

source: Managing duplicates
da: Håndtering af dubletter
id: Mengelola duplikat

source: About to import selected files:
da: Skal til at importere valgte filer:
id: Segera akan mengimpor berkas-berkas yang dipilih:

source: When importing an item whose ID already exists:
da: Når et element, hvis id allerede eksisterer, importeres:

source: Selected files have been proceeded:
da: Valgte filer er blevet behandlet:
id: Berkas-berkas yang dipilih telah diteruskan:

source: Import is done
da: Import er færdig
id: Impor selesai

source: The action “%s” is about to be exported.
da: Handlingen “%s” er ved at blive eksporteret.
id: Aksi "%s" akan segera diekspor.

source: The menu “%s” is about to be exported.
da: Menuen “%s” er ved at blive eksporteret.
id: Menu "%s" akan segera diekspor.

source: Which format should I choose to export it ?
da: I hvilket format skal jeg eksportere det?

source: About to export item(s)
da: Skal til at eksportere elementer:
id: Segera akan mengekspor butir

source: Re_member my choice in future export operations
da: Husk mit valg ved fremtidige eksporthandlinger

source: Caution: a label is mandatory for the action or the menu.
da: Advarsel: En etiket til handlingen eller menuen er obligatorisk.

source: Basename filter
da: Basisnavnefilter
id: Filter basename

source: Capability filter
da: Egenskabsfilter
id: Penyaring kapabilitas

source: Choosing a command
da: Valg af kommando
id: Memilih perintah

source: Choosing a working directory
da: Valg af arbejdsmappe
id: Memilih suatu direktori kerja

source: Icon Chooser
da: Ikonvælger
id: Pemilih Ikon

source: _Themed icons
da: _Tematiserede ikoner
id: Ikon ber_tema

source: Icons by _path
da: Ikoner efter _sti
id: Ikon menurut _path

source: (strictly lesser than)
da: (strengt mindre end)
id: (hanya kurang dari)

source: (equal to)
da: (lig med)
id: (sama dengan)

source: (strictly greater than)
da: (strengt større end)
id: (hanya lebih dari)

source: Choosing an executable
da: Valg af eksekverbar fil
id: Sedang memilih sebuah executable

source: Folder filter
da: Mappefilter
id: Filter folder

source: Select a folder
da: Vælg en mappe
id: Pilih suatu folder

source: _Open
da: _Åbn
id: _Buka

source: None
da: Ingen
id: Nihil
it: Nessuno
ta: ஒன்றுமில்லை

source: <b>Menu editable properties</b>
da: <b>Redigerbare menuegenskaber</b>
id: <b>Properti menu yang dapat disunting</b>

source: _Action
da: _Handling
id: _Aksi

source: <b>Action editable properties</b>
da: <b>Redigerbare handlingsegenskaber</b>
id: <b>Properti aksi yang dapat disunting</b>

source: Scheme filter
da: Typefilter
id: Filter skema

source: <span size="larger"><b>Parameter Legend</b></span>
da: <span size="larger"><b>Parameterforklaring</b></span>
id: <span size="larger"><b>Legenda Parameter</b></span>
it: <span size="larger"><b>Legenda dei parametri</b></span>
ta: <span size="larger"><b>அளவுரு லஜண்டு</b></span>

source: : (first) basename.
da: : (første) basisnavn.
id: : (pertama) nama dasar.

source: : space-separated list of the basenames of the selected file(s)/folder(s).
da: : mellemrumsadskilt liste over de valgte filers/mappers basisnavne.
id: : daftar nama dasar dari berkas/folder yang dipilih, dipisah spasi.

source: : count of selected item(s).
da: : antal valgte elementer.
id: : cacah butir yang dipilih.

source: : (first) base directory.
da: : (første) basismappe.
id: : direktori dasar (pertama).

source: : space-separated list of the base directories of the selected file(s)/folder(s).
da: : mellemrumsadskilt liste over de valgte filers/mappers basismapper.
id: : daftar direktori dasar dari berkas/folder yang dipilih, dipisah spasi.

source: : (first) filename.
da: : (første) filnavn.
id: : (pertama) nama berkas.

source: : space-separated list of the filenames of the selected file(s)/folder(s).
da: : mellemrumsadskilt liste over de valgte filers/mappers filnavne.
id: : daftar nama berkas dari berkas/folder yang dipilih, dipisah spasi.

source: : hostname of the (first) selected URI.
da: : den (først) valgte URI's værtsnavn.
id: : nama host dari URI (pertama) yang dipilih.

source: : (first) mimetype.
da: : (første) MIME-type.
id: : (pertama) mimetype.

source: : space-separated list of the mimetypes of the selected file(s)/folder(s).
da: : mellemrumsadskilt liste over de valgte filers/mappers MIME-typer.
id: : daftar mimetype dari berkas/folder yang dipilih, dipisah spasi.

source: : username of the (first) selected URI.
da: : den (først) valgte URI's brugernavn.
id: : nama pengguna dari URI (pertama) yang dipilih.

source: : no-op operator which forces a singular form of execution.
da: : no-op-operator som gennemtvinger en enkeltkørsel.

source: : no-op operator which forces a plural form of execution.
da: : no-op-operator som gennemtvinger en flertallig kørsel.

source: : port number of the (first) selected URI.
da: : den (først) valgte URI's portnummer.

source: : scheme of the (first) selected URI.
da: : den (først) valgte URI's type.
id: : skema dari URI (pertama) yang dipilih.

source: : (first) URI.
da: : (første) URI.
id: : URI (pertama).

source: : space-separated list of the URIs of the selected file(s)/folder(s).
da: : mellemrumsadskilt liste over de valgte filers/mappers URI'er.
id: : daftar URI dari berkas/folder yang dipilih, dipisah spasi.

source: : (first) basename without the extension.
da: : (første) basisnavn uden filendelsen.

source: : space-separated list of the basenames without the extension.
da: : mellemrumsadskilt liste over basisnavnene uden filendelser.
id: : daftar nama dasar dari tanpa ekstensi, dipisah spasi.

source: : (first) extension.
da: : (første) filendelse.
id: : (pertama) ekstensi.

source: : space-separated list of the extensions of the selected file(s)/folder(s).
da: : mellemrumsadskilt liste over de valgte filers/mappers filendelser.
id: : daftar ekstensi dari berkas/folder yang dipilih, dipisah spasi.

source: : a percent sign.
da: : et procenttegn.
id: : suatu tanda persen.

source: Current FMAObjectItem
da: Aktuelle FMAObjectItem
id: FMAObjectItem saat ini

source: A pointer to the currently edited FMAObjectItem, an action or a menu
da: En pointer til det FMAObjectItem der redigeres nu; en handling eller menu

source: Current FMAObjectProfile
da: Aktuelle FMAObjectProfile
id: Profil FMAObject saat ini

source: A pointer to the currently edited FMAObjectProfile
da: En pointer til den FMAObjectProfile der redigeres nu

source: Current FMAIContext
da: Aktuelle FMAIContext
id: FMAIContext saat ini

source: A pointer to the currently edited FMAIContext
da: En pointer til den FMAObjectContext der redigeres nu

source: Editable item ?
da: Element der kan redigeres?
id: Butir yang dapat disunting ?

source: Whether the item will be able to be updated against its I/O provider
da: Hvorvidt elementet kan opdateres mod dets I/O-udbyder

source: No edition reason
da: Årsag til ingen redigering

source: Why is this item not editable
da: Hvorfor kan dette element ikke redigeres

source: One or more actions have been modified in the filesystem. You could keep to work with your current list of actions, or you may want to reload a fresh one.
da: En eller flere handlinger er blevet ændret i filsystemet. Du kan fortsætte med at redigere den aktuelle liste over handlinger, eller du kan genindlæs en ny.

source: Note that reloading a fresh list of actions requires that you give up with your current modifications.
da: Bemærk, at genindlæsning af en ny liste over handlinger kræver, at du opgiver de aktuelle ændringer.

source: Do you want to reload a fresh list of actions ?
da: Vil du genindlæse en ny liste over handlinger?

source: Reloading a fresh list of actions requires that you give up with your current modifications.
da: Genindlæsning af en ny liste over handlinger kræver, at du opgiver de aktuelle ændringer.

source: Do you really want to do this ?
da: Vil du virkelig det?

source: Some items have been modified.
da: Nogle elementer er blevet ændret.
id: Beberapa butir telah dimodifikasi.

source: Are you sure you want to quit without saving them ?
da: Vil du afslutte uden at gemme dem?
id: Anda yakin ingin keluar tanpa menyimpannya?

source: Items _list :
da: _Liste over elementer:

source: Sort the list in ascending alphabetical order.
da: Sortér listen i stigende alfabetisk orden.
id: Urutkan daftar dalam urutan abjad menaik.

source: Do not sort the list, letting you manually reorder the items.
da: Sortér ikke listen, men håndtér selv elementernes rækkefølge.
id: Jangan mengurutkan daftar, membiarkan Anda mengatur ulang butir secara manual.

source: Sort the list in descending alphabetical order.
da: Sortér listen i faldende alfabetisk orden.
id: Urutkan daftar dalam urutan abjad menurun.

source: Display item in _selection context menu
da: Vis element i _markeringsgenvejsmenuen
