Repository: GNOME/filemanager-actions
Catalog: po/*.po
Languages: da, id, it, ta

source: _Ask me
da: _Spørg mig
id: T_anya ke saya

source: You will be asked for the format to choose each time an item is about to be exported.
da: Du vil spurgt om, hvilket format der skal vælges, hver gang et element skal eksporteres.
id: Anda akan ditanyai format yang dipilih setiap kali suatu butir akan diekspor.

source: No FMAIExporter implementation found for “%s” format.
da: Fandt ingen implementering af FMAIExporter for formatet “%s”.
id: Tidak ditemukan implementasi FMAIExporter bagi format "%s".

source: %s FMAIExporter doesn’t implement “to_buffer” interface.
da: %s-FMAIExporter implementerer ikke grænsefladen “to_buffer”.
id: %s FMAIExporter tak mengimplementasi antar muka "to_buffer".

source: %s FMAIExporter doesn’t implement “to_file” interface.
da: %s-FMAIExporter implementerer ikke grænsefladen “to_file”.
id: %s FMAIExporter tak mengimplementasi antar muka "to_berkas".

source: FileManager-Actions Configuration Tool is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
da: Konfigurationsværktøjet Nautilus-handlinger er frit og gratis software. Du kan videredistribuere det og/eller ændre det i henhold til betingelserne i GNU General Public License, som udgivet af Free Software Foundation, version 2 eller (efter eget valg) enhver senere version.
id: Alat Konfigurasi FileManager-Actions adalah sebuah perangkat lunak bebas; Anda dapat mendistribusikan ulang atau mengubahnya di bawah syarat Lisensi GNU General Public sebagaimana dipublikasikan oleh Free Software Foundation; bisa versi 2 Lisensi, atau (terserah Anda) sebarang versi setelahnya.

source: FileManager-Actions Configuration Tool is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
da: Konfigurationsværktøjet Nautilus-handlinger distribueres i håb om at det vil vise sig nyttigt, men UDEN NOGEN FORM FOR GARANTI, uden selv de underforståede garantier omkring SALGBARHED eller EGNETHED TIL ET BESTEMT FORMÅL. Yderligere detaljer kan læses i GNU General Public License.
id: Alat Konfigurasi FileManager-Actions didistribusikan dengan harapan akan berguna, tapi TANPA JAMINAN APAPUN; termasuk tanpa jaminan DAYA JUAL atau KELAIKAN UNTUK SUATU TUJUAN TERTENTU. Lihat GNU General Publik License untuk rincian lebih lanjut.

source: You should have received a copy of the GNU General Public License along with FileManager-Actions Configuration Tool ; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.
da: Du bør have modtaget en kopi af GNU General Public License sammen med dette program. Hvis ikke, så skriv til Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.
id: Anda seharusnya menerima salinan dari GNU General Public License bersama dengan Alat Konfigurasi FileManager-Actions; bila tidak, tulislah ke Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA, 02110-1301, USA.

source: A graphical interface to create and edit your file-manager actions.
da: En grafisk grænseflade til at oprette og redigere dine handlinger i Nautilus med.
id: Suatu antar muka grafis untuk membuat dan menyunting aksi manajer-berkas Anda.

source: The GNOME Translation Project <gnome-i18n@gnome.org>
da: Lasse Bang Mikkelsen Peter Bach Mads Lundby Alan Mortensen
id: Projek Penerjemahan GNOME <gnome-i18n@gnome.org>
it: Sergio Durzu
ta: GNOME மொழிபெயர்ப்பு<gnome-i18n@gnome.org>

source: FileManager-Actions
da: Nautilus-handlinger

source: Copyright %s 2005 The GNOME Foundation Copyright %s 2006-2008 Frederic Ruaudel <grumz@grumz.net> Copyright %s 2009-2015 Pierre Wieser <pwieser@trychlos.org>
da: Ophavsret %s 2005 The GNOME Foundation Ophavsret %s 2006-2008 Frederic Ruaudel <grumz@grumz.net> Ophavsret %s 2009-2015 Pierre Wieser <pwieser@trychlos.org>
id: Hak Cipta %s 2005 The GNOME Foundation Hak Cipta %s 2006-2008 Frederic Ruaudel <grumz@grumz.net> Hak Cipta %s 2009-2015 Pierre Wieser <pwieser@trychlos.org>

source: GNOME desktop
da: GNOME-skrivebord
id: Desktop GNOME

source: KDE desktop
da: KDE-skrivebord
id: Desktop KDE

source: LXDE desktop
da: LXDE-skrivebord
id: Desktop LXDE

source: ROX desktop
da: ROX-skrivebord
id: Desktop ROX

source: XFCE desktop
da: XFCE-skrivebord
id: Desktop XFCE

source: Legacy systems
da: Forældede systemer
id: Sistem warisan

source: List of patterns to be matched against the selected file(s)/folder(s)
da: Listen over mønstre som de valgte filer/mapper skal matche
id: Daftar pola yang akan dicocokkan dengan berkas/folder yang dipilih

source: A list of strings with joker “*” or “?” to be matched against the name(s) of the selected file(s)/folder(s). Each selected item must match at least one of the filename patterns for the action or the menu be candidate to display. This obviously only applies when there is a selection. Defaults to “*”.
da: En liste over strenge med jokertegnene “*” eller “?” som navnene på de valgte filer/mapper skal matche. Hvert valgte element skal matche mindst ét filnavnemønster, for at handlingen eller menuen vises. Dette gælder selvfølgelig kun, når noget er valgt. Som standard “*”.
id: Daftar string dengan wildcard "*" atau "?" untuk dicocokkan terhadap nama dari berkas/folder yang dipilih. Setiap butir yang dipilih mesti cocok dengan paling tidak satu dari pola nama berkas bagi aksi atau menu yang menjadi kandidat untuk ditampilkan Ini tentu saja hanya berlaku ketika ada pilihan. Nilai baku "*".

source: A pattern to be matched against basenames of selected file(s)/folder(s). May include wildcards (* or ?). You must set one option for each pattern you need
da: Et mønster som de valgte filers/mappers basisnavne skal matche. Kan indeholde jokertegn (? eller *). Du skal angive mindst én valgmulighed for hvert mønster
id: Sebuah pola yang akan dicocokkan terhadap nama basis dari berkas/folder yang dipilih. Boleh memuat wildcard (* atau ?). Anda mesti menata satu opsi untuk setiap pola yang Anda perlukan

source: <EXPR>
da: <UDTRYK>

source: Whether the specified basenames are case sensitive (default)
da: Hvorvidt der skelnes mellem store og små bogstaver i de angivne basisnavne (standard)
id: Apakah nama basis yang dinyatakan membedakan huruf besar kecil (baku)

source: Must be set to “true” if the filename patterns are case sensitive, to “false” otherwise. E.g., if you need to match a filename in a case-sensitive manner, set this key to “true”. If you also want, for example “*.jpg” to match “photo.JPG”, then set “false”. This obviously only applies when there is a selection. Defaults to “true”.
da: Sæt denne nøgle til “true”, hvis der skelnes mellem store og små bogstaver i filnavnemønstrene, ellers til “false”. Hvis du f.eks. vil matche et filnavn og skelne mellem store og små bogstaver, så sæt denne nøgle til “true”. Hvis du f.eks. også vil matche “*.jpg” med “foto.JPG”, så sæt den til “false”. Dette gælder selvfølgelig kun, når noget er valgt. Som standard “true”.
id: Mesti diisi "true" bila pola nama berkas membedakan huruf besar kecil, isi "false" bila tidak. Mis. bila Anda perlu mencocokkan suatu nama berkas dengan membedakan huruf besar kecil, isi kunci ini dengan "true". Bila Anda juga ingin, misalnya "*.jpg" cocok dengan "foto.JPG", maka isilah dengan "false". Ini tentu saja hanya berlaku ketika ada pilihan. Nilai baku "true".

source: List of patterns to be matched against the mimetypes of the selected file(s)/folder(s)
da: Listen over mønstre som de valgte filers/mappers mime-type skal matche
id: Daftar pola yang akan dicocokkan terhadap mimetype dari berkas/folder yang dipilih

source: A list of strings with joker “*” to be matched against the mimetypes of the selected file(s)/folder(s). Each selected item must match at least one of the mimetype patterns for the action to appear. This obviously only applies when there is a selection. Defaults to “*/*”.
da: En liste over strenge med jokertegnene “*” eller “?” som de valgte filers/mappers MIME-typer skal matche. Hvert valgte element skal matche mindst ét af MIME-typemønstrene, for at handlingen vises. Dette gælder selvfølgelig kun, når noget er valgt. Som standard “*/*”.

source: A pattern to be matched against mimetypes of selected file(s)/folder(s). May include the asterisk wildcard “*”. You must set one option for each pattern you need
da: Et mønster som de valgte filers/mappers MIME-typer skal matche. Kan indeholde jokertegnet “*”. Du skal angive en valgmulighed for hvert mønster
id: Sebuah pola yang akan dicocokkan terhadap mimetype dari berkas/folder yang dipilih. Boleh memuat wildcard bintang "*". Anda mesti menata satu opsi bagi setiap pola yang Anda perlukan

source: Whether the profile applies to files (deprecated option, see mimetype)
da: Hvorvidt profilen gælder for filer (forældet mulighed, se MIME-type)
id: Apakah profil berlaku pada berkas (opsi usang, lihat mimetype)

source: Set to “true” if the selection can have files, to “false” otherwise. This setting is tied in with the “isdir” setting. The valid combinations are: isfile=“true” and isdir=“false”: the selection may hold only files isfile=“false” and isdir=“true”: the selection may hold only folders isfile=“true” and isdir=“true”: the selection may hold both files and folders isfile=“false” and isdir=“false”: this is an invalid combination (your configuration will never appear). This obviously only applies when there is a selection. Defaults to “true”.
da: Sæt til “true”, hvis markeringen kan omfatte filer, ellers til “false”. Denne indstilling er bundet til indstillingen “isdir”. Disse kombinationer er gyldige: isfile=“true” og isdir=“false”: markeringen må kun indeholde filer isfile=“false” og isdir=“true”: markeringen må kun indeholde mapper isfile=“true” og isdir=“true”: markeringen kan indeholde både filer og mapper isfile=“false” og isdir=“false”: dette er en ugyldig kombination (din konfiguration vil aldrig blive vist)
id: Tetapkan ke "true" jika pilihan dapat memiliki berkas, untuk "false" sebaliknya. Pengaturan ini diikat dengan pengaturan "isdir". Kombinasi yang valid adalah: isfile = "true" dan isdir = "false": pilihan hanya dapat menahan berkas isfile = "false" dan isdir = "true": pilihan hanya dapat menahan folder isfile = "true" dan isdir = "true": pilihan dapat menahan kedua berkas dan folder isfile = "false" dan isdir = "false": ini adalah kombinasi yang tidak valid (konfigurasi Anda tidak akan pernah muncul). Ini jelas hanya berlaku ketika ada pilihan. Nilai baku adalah "true".

source: Whether the profile applies to folders (deprecated option, see mimetype)
da: Hvorvidt profilen gælder for mapper (forældet mulighed, se MIME-type)
id: Apakah profil berlaku pada folder (opsi usang, lihat mimetype)

source: Set to “true” if the selection can have folders, to “false” otherwise. This setting is tied in with the “isfile” setting. The valid combinations are: isfile=“true” and isdir=“false”: the selection may hold only files isfile=“false” and isdir=“true”: the selection may hold only folders isfile=“true” and isdir=“true”: the selection may hold both files and folders isfile=“false” and isdir=“false”: this is an invalid combination (your configuration will never appear). This obviously only applies when there is a selection. Defaults to “false”.
da: Sæt til “true”, hvis markeringen kan omfatte mapper, ellers til “false”. Denne indstilling er bundet til indstillingen “isfile”. Disse kombinationer er gyldige: isfile=“true” og isdir=“false”: markeringen må kun indeholde filer isfile=“false” og isdir=“true”: markeringen må kun indeholde mapper isfile=“true” og isdir=“true”: markeringen kan indeholde både filer og mapper isfile=“false” og isdir=“false”: dette er en ugyldig kombination (din konfiguration vil aldrig blive vist)
id: Tetapkan ke "true" jika pilihan dapat memiliki folder, untuk "false" sebaliknya. Pengaturan ini diikat dengan pengaturan "isfile". Kombinasi yang valid adalah: isfile = "true" dan isdir = "false": pilihan hanya dapat menahan berkas isfile = "false" dan isdir = "true": pilihan hanya dapat menahan folder isfile = "true" dan isdir = "true": pilihan dapat menahan kedua berkas dan folder isfile = "false" dan isdir = "false": ini adalah kombinasi yang tidak valid (konfigurasi Anda tidak akan pernah muncul). Ini jelas hanya berlaku ketika ada pilihan. Nilai baku adalah "false".

source: Whether the selection may be multiple (deprecated option, see selection count)
da: Hvorvidt markeringen kan være flertalligt (forældet mulighed, se markeringstælling)
id: Apakah pilihan bisa berganda (opsi usang, lihat cacah pilihan)

source: If you need more than one files or folders to be selected, set this key to “true”. If you want just one file or folder, set it to “false”. This obviously only applies when there is a selection. Defaults to “false”.
da: Sæt denne nøgle til “true", hvis du har brug for at vælge mere end én fil eller mappe. Hvis du kun har brug for én fil eller mappe, så sæt den til “false”. Dette gælder selvfølgelig kun, når noget er valgt. Som standard “false”.
id: Bila Anda perlu memilih lebih dari satu berkas atau folder, atur kunci ini ke "true". Bila Anda ingin hanya satu berkas atau folder, isi dengan "false". Jelas bahwa ini hanya berlaku bila ada pilihan. Nilai baku "false".

source: List of schemes to be matched against those of selected file(s)/folder(s)
da: Listen over typer som de valgte filer/mapper skal matche
id: Daftar skema yang akan dicocokkan terhadap berkas/folder yang dipilih

source: Defines the list of valid schemes to be matched against the selected items. The scheme is the protocol used to access the files. The keyword to use is the one used in the URI by the file manager. Examples of valid URI include: • file:///tmp/foo.txt • sftp:///root@test.example.net/tmp/foo.txt The most common schemes are: • “file”: local files • “sftp”: files accessed via SSH • “ftp”: files accessed via FTP • “smb”: files accessed via Samba (Windows share) • “dav”: files accessed via WebDAV. All schemes used by your favorite file manager may be used here. This obviously only applies when there is a selection, or when targeting the special “x-nautilus-desktop” scheme. Defaults to “file”.
da: Definerer en liste over gyldige typer, som de valgte elementer skal matche. Typen er den protokol, som bruges til at tilgå filer. Nøgleordet, som skal bruges, er den brugt i URI'en af Nautilus. Eksempler på gyldige URI'er er: file:///tmp/foo.txt sftp:///root@test.eksempel.dk/tmp/foo.txt De mest almindelige typer er: • “file”: lokale filer • “sftp”: filer tilgået via SSH • “ftp”: filer tilgået via FTP • “smb”: filer tilgået via Samba (Windows-deling) • “dav”: filer tilgået via WebDAV Alle typer brugt af din yndlingsfilhåndtering kan bruges her. Dette gælder selvfølgelig kun, når noget er valgt, eller når den særlige “x-nautilus-desktop”-type er målet. Som standard “file”.

source: A valid GIO scheme where the selected file(s)/folder(s) should be located. You must set one option for each scheme you need
da: En gyldig GIO-type hvor de valgte filer/mapper bør være. Du skal angive en valgmulighed for hver type
id: Sebuah skema GIO yang valid dimana berkas/folder yang dipilih mesti ditemukan. Anda mesti menata satu opsi bagi setiap skema yang Anda perlukan

source: <STRING>
da: <STRENG>

source: List of folders
da: Mappeliste
id: Daftar folder

source: Defines the list of valid paths to be matched against the current folder. All folders “under” the specified path are considered valid. Defaults to “/”.
da: Definerer listen over gyldige stier, som den aktuelle mappe skal matche. Alle mapper “under” den angivne sti betragtes som værende gyldige. Som standard “/”.
id: Menentukan daftar path yang valid untuk dicocokkan dengan folder saat ini. Semua folder "di bawah" path yang dinyatakan dianggap valid. Nilai baku "/".

source: The path of a (parent) directory for which the item will be displayed. You must set one option for each folder you need
da: En (overliggende) mappes sti for hvilken elementet vil blive vist. Du skal angive en valgmulighed for hver mappe

source: <PATH>
da: <STI>

source: Operator of the selection count relation
da: Optællingsrelationen for markerings operator
id: Operator dari relasi cacah seleksi

source: Whether this profile may be selected depending of the count of the selection. This is a string of the form “{'<'|'='|'>'} number”. Examples of valid strings are: “=0”, “> 1”, “< 10”. Defaults to “>0”.
da: Hvorvidt profilen kan vælges baseret på markeringstællingen. Dette er en streng af formen “{'<'|'='|'>'} tal”. Eksempler på gyldige strenge er: “=0”, “> 1”, “< 10”. Som standard “>0”.
id: Apakah profil ini dapat dipilih tergantung dari hitungan seleksi. Ini adalah string dari bentuk "{'<'|'='|'>'} bilangan". Contoh string yang valid adalah: "=0", ">1", "<10". Nilai baku ">0".

source: Selection count relation [>0]
da: Optællingsrelation for markering [>0]
id: Relasi cacah seleksi [>0]

source: Only show in environment
da: Vis kun i miljø
id: Hanya tampilkan dalam lingkungan

source: Defaults to all.
da: Som standard alle.
id: Baku ke semua.

source: The name of an only desktop environment where the item must be displayed. You must set one option for each environment you want
da: Navnet på et skrivebordsmiljø hvor elementet skal vises. Du skal angive en valgmulighed for hvert miljø
id: Nama dari satu-satunya lingkungan desktop dimana butir mesti ditampilkan. Anda mesti menata satu opsi bagi setiap lingkungan yang Anda inginkan

source: <DESKTOP>
da: <SKRIVEBORD>

source: Not show in environment
da: Vis ikke i miljø
id: Jangan tampilkan dalam lingkungan

source: Defaults to none.
da: Som standard ingen.
id: Baku ke nihil.

source: The name of a desktop environment where the item must not be displayed. You must set one option for each environment you want
da: Navnet på et skrivebordsmiljø hvor elementet ikke skal vises. Du skal angive en valgmulighed for hvert miljø
id: Nama dari lingkungan desktop dimana butir tidak boleh ditampilkan. Anda mesti menata satu opsi bagi setiap lingkungan yang Anda inginkan

source: Try exec
da: Forsøg exec
id: Coba exec

source: Note that, when specified, only the presence and the executability status of the specified file are checked. Parameters may appear in “TryExec” value, and will be substituted at runtime. Defaults to successful.
da: Bemærk at hvis angivet, tjekkes kun filens eksistens og eksekverbarhed. Parametre kan forekomme i værdien “TryExec” og vil blive erstattet ved kørselstid. Som standard succes(rig).

source: the path to a file whose executability is to be checked
da: stien til en fil hvis eksekverbarhed skal tjekkes
id: path ke suatu berkas akan diperiksa apakah dapat dieksekusi

source: Show if registered
da: Vis hvis registreret
id: Tampilkan bila terdaftar

source: The well-known name of a DBus service. The item will be candidate if the named service is registered on session DBus at runtime. Parameters may appear in “ShowIfRegistered” value, and will be substituted at runtime. Defaults to successful.
da: Det velkendte navn på en DBus-tjeneste. Elementet vil være kandidat, hvis den navngivne tjeneste er registreret på DBus-sessionen ved kørselstid. Parametre kan forekomme i værdien “ShowIfRegistered” og vil blive erstattet ved kørselstid. Som standard succes(rig).

source: The name of a service which must be registered on session DBus
da: Navnet på en tjeneste som skal være registreret på DBus-sessionen.
id: Nama dari suatu layanan yang mesti terdaftar pada DBus sesi

source: <NAME>
da: <NAVN>
id: <NAMA>

source: Show if True
da: Vis hvis True (sand)
id: Tampilkan bila True

source: A command which, when executed, should output a string on stdout. The item will be candidate if the outputed string is equal to “true”. Parameters may appear in “ShowIfTrue” value, and will be substituted at runtime. Defaults to successful.
da: En kommando som, når den udføres, skal give en streng på stdout. Elementet vil være kandidat, hvis strengen er lig “true”. Parametre kan forekomme i værdien “ShowIfTrue” og vil blive erstattet ved kørselstid. Som standard succes(rig).
id: A perintah yang, ketika dijalankan, harus mengeluarkan string pada stdout. Item akan menjadi calon jika string yang dikeluarkan sama dengan "true". Parameter mungkin muncul dalam nilai "ShowIfTrue", dan akan diganti pada saat runtime. Nilai baku sukses.

source: The path to a command which will display the “true” string
da: Stien til en kommando som vil vise strengen “true”
id: Path ke sebuah perintah yang akan menampilkan string "true"

source: Show if running
da: Vis hvis kørende
id: Tampilkan bila berjalan

source: The name of a process. The item will be candidate if the process name is found in memory at runtime. Parameters may appear in “ShowIfRunning” value, and will be substituted at runtime. Defaults to successful.
da: Navnet på en proces. Elementet vil være kandidat, hvis procesnavnet er i hukommelsen ved kørselstid. Parametre kan forekomme i værdien “ShowIfTrue” og vil blive erstattet ved kørselstid. Som standard succes(rig).
id: Nama proses. Item akan calon jika nama proses ditemukan di memori saat runtime. Parameter mungkin muncul dalam nilai "ShowIfRunning", dan akan diganti saat runtime. Default untuk berhasil.

source: The name of a binary which must be running
da: Navnet på en binærfil som skal køre
id: Nama dari sebuah biner yang mesti sedang berjalan

source: Capabilities
da: Egenskaber
id: Kapabilitas

source: A list of capabilities each item of the selection must satisfy in order for the item to be candidate. Capabilities may be negated. Capabilities have to be chosen between following predefined ones: • “Owner”: current user is the owner of selected items • “Readable”: selected items are readable by user (probably more useful when negated) • “Writable”: selected items are writable by user • “Executable”: selected items are executable by user • “Local”: selected items are local. Defaults to empty list.
da: En liste over egenskaber hvert element i markeringen skal opfylde for at elementet kan være kandidat. Egenskaber kan være negerende. Egenskaber skal vælges mellem de følgende foruddefinerede: • “Owner”: aktuelle bruger ejer de valgte elementer • “Readable”: valgte elementer kan læses af brugeren (sandsynligvis mere nyttig når den negeres) • “Writable”: valgte elementer kan skrives til af brugeren • “Executable”: valgte elementer kan køres af brugeren • “Local”: valgte elementer er lokale. Som standard er listen tom.

source: The name of a capability the selection must meet. May be “Owner”, “Readable”, “Writable”, “Executable” or “Local”
da: Navnet på en egenskab som markeringen skal opfylde. Kan være “Owner”, “Readable”, “Writable”, “Executable” eller “Local”
id: Nama dari sebuah kapabilitas yang mesti dipenuhi oleh pilihan. Bisa "Owner", "Readable", "Writable", "Executable", atau "Local"

source: Item was renumbered because the caller did not provide any check function.
da: Elementet fik nyt nummer, fordi opkalderen ikke leverede en tjekfunktion.
id: Butir dinomori ulang karena pemanggil tidak menyediakan fungsi pemeriksaan apapun.

source: Item was renumbered because the caller did not provide any ask user function.
da: Elementet fik nyt nummer, fordi opkalderen ikke leverede en “spørg bruger”-funktion.
id: Butir dinomori ulang karena pemanggil tidak menyediakan fungsi pengguna bertanya apapun.

source: Item was renumbered due to user request.
da: Elementet fik nyt nummer på grund af en brugerforespørgsel.
id: Butir dinomori ulang karena permintaan pengguna.
