Repository: GNOME/filemanager-actions
Catalog: po/*.po
Languages: da, id, it, ta

source: The field is here to give the user a human readable name for a profile in the Nact interface. If not set there will be a default auto generated string set by default
it: Il campo è qui utilizzato per fornire un nome comprensibile per un profilo nell'interfaccia Nact. Se non impostato, sarà usata una stringa generata automaticamente
ta: நாக்ட் இடைமுகத்தில் உருவரைக்கு ஒரு பெயர் கொடுக்க இந்த புலம் இருக்கிறது. அமைக்கவில்லையானால் அது தானியங்கியாக ஒரு முன்னிருப்பு சரத்தை உருவாக்கும்.

source: The path of the command to start when the user select the menu item in the Nautilus popup menu
it: Il percorso del comando da eseguire quando l'utente seleziona la voce del menù nel menù contestuale di Nautilus
ta: பயனர் நாடுலஸ் துள்ளு மெனுவில் அவரது சொடுக்கியால் சுட்டும் போது துவங்க வேண்டிய கட்டளை

source: The parameters of the command to start when the user selects the menu item in the Nautilus popup menu. The parameters can contain some special tokens which are replaced by Nautilus information before starting the command: %d: base folder of the selected file(s) %f: the name of the selected file or the first one if many are selected %m: space-separated list of the basenames of the selected file(s)/folder(s) %M: space-separated list of the selected file(s)/folder(s), with their full paths %u: GnomeVFS URI %s: scheme of the GnomeVFS URI %h: hostname of the GnomeVFS URI %U: username of the GnomeVFS URI %%: a percent sign
it: I parametri del comando da eseguire quando l'utente seleziona la voce del menù nel menù contestuale di Nautilus. I parametri possono contenere alcuni segni speciali che sono sostituiti dalle informazioni di Nautilus prima che sia eseguito il comando: %d: cartella di base del file selezionato (o dei file) %f: il nome del file selezionato o il nome del primo file, se più file sono selezionati %m: elenco, separato con spazi, dei nomi di base del e delle cartelle selezionati %M: elenco, separato con spazi, dei file o delle cartelle selezionati, con i loro percorsi completi %u: URI di GnomeVFS %s: schema dell'URI di GnomeVFS %h: nome dell'host dell'URI di GnomeVFS %U: nome utente dell'URI di GnomeVFS %%: simbolo di percentuale

source: The list of pattern to match the selected file(s)/folder(s)
it: L'elenco dei modelli con cui i file e le cartelle selezionati devono concordare
ta: தேர்ந்தெடுக்கப்பட்ட கோப்பு(கள்)/ அடைவுகளுக்கு பொருத்தமான தோரணிகளின் பட்டியல்

source: A list of strings with joker '*' or '?' to match the name of the selected file(s)/folder(s). Each selected items must match at least one of the filename patterns for the action to appear
it: Una lista con i caratteri jolly "*" o "?" con cui deve concordare il nome dei file o delle cartelle selezionati. Ogni elemento selezionato deve concordare con almeno uno dei modelli di nome di file che sono visualizzati
ta: joker '*' அல்லது '?' ஐ தேர்ந்தெடுக்கப்பட்ட கோப்பு(கள்)/கோப்புறை(கள்) பொருந்துவதற்கான பட்டியல் சரமாகும். ஒவ்வொரு தேர்ந்தெடுக்கப்பட்ட உருப்படிகளும் ஒரு கோப்புபெயருடன் பொருந்த வேண்டும்

source: 'true' if the filename patterns have to be case sensitive, 'false' otherwise
it: "true" se i modelli del nome di file devono distinguere maiuscolo e minuscolo, "false" in caso contrario
ta: 'உண்மை' எனில் தோரணிகள் எழுத்து நிலையை உணர வேண்டும், 'இல்லை' எனில் தேவையில்லை

source: If you need to match a filename in a case-sensitive manner, set this key to 'true'. If you also want, for example '*.jpg' to match 'photo.JPG', set 'false'
it: Se si ha le necessità di concordare un nome di file distinguendo tra maiuscolo e minuscolo, impostare questa chiave come "true". Se si vuole invece, per esempio, che "*.jpg" concordi con "immagine.JPG", impostare come "false"
ta: கோப்புப் பெயர் எழுத்து நிலையை உணர்ந்த வகையில் பொருத்த வேண்டும் எனில் இதை 'true' என அமை. ஆனால் உதாரணமாக '*.jpg' 'photo.JPG', எனவும் பொருந்த வேண்டுமானால் 'false' என அமை.

source: The list of patterns to match the mimetypes of the selected file(s)
it: L'elenco dei modelli con cui devono concordare i tipi MIME dei file selezionati
ta: தேர்ந்தெடுக்கப்பட்ட கோப்பு(கள்)/ அடைவுகளின் மைம் வகைக்கு பொருத்தமான தோரணிகளின் பட்டியல்

source: A list of strings with joker '*' or '?' to match the mimetypes of the selected file(s). Each selected items must match at least one of the mimetype patterns for the action to appear
it: Un elenco delle stringhe col carattere jolly "*" o "?" per concordare il tipo MIME del file selezionato (o dei file). Ogni elemento selezionato deve concordare almeno con uno dei modelli di tipo MIME di file che sono visualizzati
ta: தேர்ந்தெடுக்கப்பட்ட கோப்பு(கள்)/ அடைவுகளின் மைம் வகைக்கு பொருத்தமான '*' அல்லது '?' போன்ற ஜோக்கருடன் கூடிய சரங்களின் பட்டியல். செயல் தெரிய இதில் தேர்ந்தெடுக்கப்பட்ட உருப்படிகள் ஒரு மைம் வகையையாவது பொருந்த வேண்டும்.

source: 'true' if the selection can have files, 'false' otherwise
it: "true" se la selezione può contenere file, "false" in caso contrario
ta: 'உண்மை' எனில் தேர்வில் கோப்புகள் இருக்கலாம். 'தவறு' எனில் மற்றது.

source: This setting is tied in with the 'isdir' setting.
it: Questa impostazione è collegata a "isdir".
ta: இந்த அமைப்பு 'isdir' அமைப்புடன் பிணைந்துள்ளது.

source: 'true' if the selection can have folders, 'false' otherwise
it: "true" se la selezione può contenere cartelle, "false" in caso contrario
ta: 'உண்மை' எனில் தேர்வில் அடைவுகள் இருக்கலாம். 'தவறு' எனில் மற்றது.

source: This setting is tied in with the 'isfile' setting.
it: Questa impostazione è collegata a "isfile".
ta: இந்த அமைப்பு 'isfile' அமைப்புடன் பிணைந்துள்ளது.

source: 'true' if the selection can have several items, 'false' otherwise
it: "true" se la selezione può contenere diversi elementi, "false" in caso contrario
ta: 'உண்மை' எனில் தேர்வில் பல உருப்படிகள் இருக்கலாம். 'தவறு' எனில் மற்றது.

source: If you need one or more files or folders to be selected, set this key to 'true'. If you want just one file or folder, set 'false'
it: Se si ha le necessità di selezionare più file o cartelle, impostare questa chiave come "true". Se si vuole solo un file o una cartella, impostare a "false".
ta: ஒன்றுக்கு மேற்பட்ட கோப்புகள் அடைவுகள் தேர்ந்தெடுக்கப்பட வேண்டுமானால் இந்த விசையை 'உண்மை' என அமை ஒரே ஒரு கோப்பு அல்லது அடைவு எனில் 'தவறு' என அமை அமை

source: The list of GnomeVFS schemes where the selected files should be located
it: L'elenco degli schemi di GnomeVFS dove i file selezionati dovrebbero essere posizionati
ta: தேர்ந்தெடுக்கப்பட்ட கோப்புகள் இருக்க வேண்டிய க்னோம் விஎஃபெஸ் கருத்துகளின் பட்டியல்

source: Defines the list of valid GnomeVFS schemes to be matched against the selected items. The GnomeVFS scheme is the protocol used to access the files. The keyword to use is the one used in the GnomeVFS URI. Examples of GnomeVFS URI include: file:///tmp/foo.txt sftp:///root@test.example.net/tmp/foo.txt The most common schemes are: 'file': local files 'sftp': files accessed via SSH 'ftp': files accessed via FTP 'smb': files accessed via Samba (Windows share) 'dav': files accessed via WebDav All GnomeVFS schemes used by Nautilus can be used here.
it: Definisce l'elenco degli schemi validi di GnomeVFS con cui devono concordare gli elementi selezionati. Lo schema di GnomeVFS è il protocollo utilizzato per accedere ai file. La parola chiave da utilizzare è quella usata nell'URI di GnomeVFS. Esempi di URI di GnomeVFS includono: file:///tmp/foo.txt sftp:///root@test.example.net/tmp/foo.txt Gli schemi più comuni sono i seguenti: "file": file locali "sftp": file a cui si accede tramite SSH "ftp": file a cui si accede tramite FTP "smb": file a cui si accede tramite (condivisione di Windows) "dav": file a cui si accede via WebDav Tutti gli schemi di GnomeVFS utilizzati da Nautilus possono essere utilizzati.

source: The version of the configuration format
it: La versione del formato della configurazione
ta: அமைப்பு ஒழுங்கின் பதிப்பு

source: The version of the configuration format that will be used to manage backward compatibility
it: La versione del formato della configurazione che sarà utilizzato per gestire la retro compatibilità
ta: பின் நோக்கு இசைவுக்கு பயன்படுத்த அமைப்பு ஒழுங்கின் பதிப்பு

source: The action '%s' already exists with the name '%s', please first remove the existing one before trying to add this one
it: L'azione '%s' esiste già con il nome '%s', occorre eliminarla, o rinominarla, prima di crearne una con lo stesso nome
ta: இந்த '%s' செயல் '%s' பெயரில் ஏற்கெனவே உள்ளது. இதை சேர்க்க முயற்சிக்கும் முன் இருப்பதை நீக்கவும்.

source: Can't save action '%s'
it: Impossibile salvare l'azione «%s»
ta: செயல் '%s' ஐ சேமிக்க முடியாது

source: A profile already exists with the name '%s', please first remove or rename the existing one before trying to add this one
it: Il profilo esiste già con il nome «%s», occorre eliminarlo, o rinominarlo, prima di crearne uno con lo stesso nome
ta: '%s' பெயரில் ஏற்கெனவே ஒரு உருவரை உள்ளது. இதை சேர்க்க முயற்சிக்கும் முன் இருப்பதை நீக்கவும் அல்லது மறுபெயரிடவும்

source: Can't find profile named '%s'
it: Impossibile trovare il profilo denominato «%s»

source: and some profiles are incomplete:
it: e alcuni profili sono incompleti:
ta: மற்றும் சில உருவரைகள் பூர்த்தி ஆகவில்லை:

source: %s (one missing key: %s)%s
it: %s (una chiave mancante: %s)%s
ta: %s (காணாமல் போன ஒரு விசை: %s)%s

source: This XML file is not a valid Nautilus-actions config file (found <%s> element instead of <%s>)
it: Questo file XML non è valido come configurazione di un'azione di Nautilus (trovato l'elemento <%s> invece di <%s>)
ta: இந்த XML கோப்பு செல்லுபடியாகும் நாடுலஸ்-செயல்கள் அமைப்பு கோப்பு இல்லை. (<%s> இதற்கு பதிலாக இருக்கிறது <%s>)

source: This XML file is not a valid Nautilus-actions config file (missing key: %s)%s
it: Questo file XML non è valido come configurazione di un'azione di Nautilus (chiave mancante: %s)%s
ta: இந்த XML கோப்பு செல்லுபடியாகும் நாடுலஸ்-செயல்கள் அமைப்பு கோப்பு இல்லை. (காணாத விசை: %s)%s

source: This XML file is not a valid Nautilus-actions config file (missing key: %s)
it: Questo file XML non è valido come configurazione di un'azione di Nautilus (chiave mancante: %s)
ta: இந்த XML கோப்பு ஒரு சரியான Nautilus-actions கட்டமைப்பு கோப்பில்லை (விடுபட்ட விசை: %s)

source: This XML file is not a valid Nautilus-actions config file (root node is <%s> instead of <%s>)
it: Questo file XML non è valido come configurazione di un'azione di Nautilus (il nodo principale è <%s> invece di <%s>)
ta: இந்த XML கோப்பு செல்லுபடியாகும் நாடுலஸ்-செயல்கள் அமைப்பு கோப்பு இல்லை. (ரூட் நோட் <%s> இதற்கு பதிலாக <%s>)

source: The valid combinations are: isfile=TRUE and isdir=FALSE: the selection may hold only files isfile=FALSE and isdir=TRUE: the selection may hold only folders isfile=TRUE and isdir=TRUE: the selection may hold both files and folders isfile=FALSE and isdir=FALSE: this is an invalid combination (your configuration will never appear)
ta: செல்லுபடியாகும் கலப்பு: isfile=TRUE and isdir=FALSE: தேர்வில் கோப்புகள் மட்டுமே இருக்கலாம். isfile=FALSE and isdir=TRUE: தேர்வில் அடைவுகள் மட்டுமே இருக்கலாம். isfile=TRUE and isdir=TRUE: தேர்வில் கோப்புகள் அடைவுகள் இரண்டும் இருக்கலாம். isfile=FALSE and isdir=FALSE: செல்லுபடியாகாத தேர்வு. (உங்கள் அமைப்பு தெரியவே தெரியாது.)

source: This config file is more recent than this version of Nautilus-actions can support. Please upgrade Nautilus-actions to the latest version if you want to be able to import it (File version: %s (max supported version : %s))
ta: இந்த அமைப்பு கோப்பு நாடுலஸ் செயல்கள் ஆதரவு தரும் இந்த பதிப்பை விட புதியது. இதை இறக்குமதி செய்ய வேண்டுமானால் நீங்கள் தயை செய்து புதிய நாடுலஸ் செயல்கள் பொதிக்கு மாறவும். (கோப்பு பதிப்பு: %s (அதிக பட்ச ஆதரவு பதிப்பு : %s))

source: Another instance of Nautilus Actions Configurator is already running.
ta: நாடுலஸ் செயல்கள் அமைப்பு கருவி ஒன்றூ ஏற்கெனெவே இயங்குகிறது.

source: Please switch back to it.
ta: தயவு செய்து அதற்கே மாறுங்கள்

source: Nautilus Actions Configuration Tool
ta: நாடுலஸ் செயல்கள் அமைப்பு கருவி

source: Add a new action
ta: புதிய செயலை சேர்

source: Edit action "%s"
ta: செயல் "%s" ஐ திருத்து

source: Project website
ta: திட்ட இணைய தளம்
