Repository: GNOME/filemanager-actions
Catalog: po/*.po
Languages: da, id, it, ta

source: Existing item was overridden due to user request.
da: Eksisterende element blev tilsidesat på grund af brugerforespørgsel.

source: Item %s already exists.
da: Elementet %s findes allerede.
id: Butir %s sudah ada.

source: Import was canceled due to user request.
da: Import blev afbrudt på grund af en brugerforespørgsel.
id: Impor dibatalkan karena permintaan pengguna.

source: (renumbered)
da: (fik nyt nummer)
id: (dinomori ulang)

source: Do _not import the item
da: Importér ikke _elementet
id: Ja_ngan impor butir

source: This used to be the historical behavior. The selected file will be marked as “NOT OK” in the Summary page. The existing item will not be modified.
da: Dette var den tidligere opførsel. Den valgte fil vil blive markeret som “IKKE OK” på siden Sammendrag. Det eksisterende element vil ikke blive ændret.
id: Ini biasanya adalah perilaku historis. Berkas yang dipilih akan ditandai sebagai "NOT OK" di halaman Ringkasan. Item yang ada tidak akan dimodifikasi.

source: Import the item, _allocating it a new identifier
da: Importér elementet og _tildel det en ny identifikator
id: Impor butir, _alokasikan identifier baru

source: The selected file will be imported with a slightly modified label indicating the renumbering. The existing item will not be modified.
da: Den valgte fil vil blive importeret med en let ændret etiket, som angiver det nye nummer. Det eksisterende element vil ikke blive ændret.
id: Berkas yang dipilih akan diimpor dengan label yang sedikit diubah menandakan penomoran ulang. Butir yang ada tidak akan diubah.

source: _Override the existing item
da: Tilsides_æt det eksisterende element
id: Timp_a butir yang ada

source: The item found in the selected file will silently override the current one which has the same identifier. Be warned: this mode may be dangerous. You will not be prompted another time.
da: Elementet fundet i den valgte fil vil tavst tilsidesætte det aktuelle element, som har den samme identifikator. Advarsel: Denne tilstand kan være farlig. Du vil ikke blive spurgt igen.
id: Butir yang ditemukan pada berkas yang dipilih akan secara diam-diam menimpa yang saat ini punya identifier sama. Anda telah diperingatkan: mode ini mungkin berbahaya. Anda tidak akan ditanyai lagi lain waktu.

source: You will be asked each time an imported ID already exists.
da: Du vil blive spurgt, hver gang et importeret id allerede findes.
id: Anda akan ditanyai setiap kali sebuah ID yang diimpor telah ada.

source: %s is not loadable (empty or too big or not a regular file)
da: %s kan ikke indlæses (tom, for stor eller ikke en regulær fil)
id: %s tidak dapat dimuat (kosong atau terlalu besar atau bukan berkas biasa)

source: Unable to load “ImporterAskDialog” from %s
da: Kunne ikke indlæse “ImporterAskDialog” fra %s
id: Tidak bisa memuat "ImporterAskDialog" dari %s

source: The action “%s” imported from “%s” has the same identifier than the already existing “%s”.
da: Handlingen “%s” importeret fra “%s” har samme identifikator som den allerede eksisterende “%s”.
id: Aksi "%s" yang diimpor dari "%s" memiliki identifier sama dengan "%s" yang sudah ada.

source: The menu “%s” imported from “%s” has the same identifier than the already existing “%s”.
da: Menuen “%s” importeret fra “%s” har samme identifikator som den allerede eksisterende “%s”.
id: Menu "%s" yang diimpor dari "%s" memiliki identifier sama dengan "%s" yang sudah ada.

source: Already existing item
da: Allerede eksisterende element
id: Butir yang telah ada

source: Re_member my choice in future import operations
da: H_usk mit valg for fremtidige importhandlinger
id: Ingat pilihan saya dala_m operasi impor di masa mendatang

source: What should I do with this ?
da: Hvad skal jeg gøre med denne?
id: Apa yang mesti saya lakukan dengan yang ini?

source: A duplicate is detected
da: Fandt en dublet
id: Suatu duplikasi terdeteksi

source: Please, be kind enough to fill out a bug report on https://gitlab.gnome.org/GNOME/filemanager-actions/issues.
da: Vær venlig at udfylde en fejlrapport på https://gitlab.gnome.org/GNOME/filemanager-actions/issues.
id: Mohon berbaik hati mengisi laporan kutu pada https://gitlab.gnome.org/GNOME/filemanager-actions/issues.

source: Unavailable I/O provider.
da: Utilgængelig I/O-udbyder.
id: Penyedia I/O tidak tersedia.

source: I/O provider implementation lacks of required API.
da: Implementeringen af I/O-udbyder mangler påkrævet API.
id: Implementasi penyedia I/O kekurangan API yang diperlukan.

source: I/O provider is not willing to write.
da: I/O-udbyderen er ikke villig til at skrive.
id: Penyedia I/O tidak bersedia menulis.

source: I/O provider announces itself as unable to write.
da: I/O-udbyderen meddeler, at den ikke er i stand til at skrive.
id: Penyedia I/O mengumumkan bahwa dirinya tidak bisa menulis.

source: I/O provider has been locked down by an administrator.
da: I/O-udbyderen er blevet låst af en administrator.
id: Penyedia I/O telah dikunci oleh seorang administrator.

source: I/O provider has been locked down by the user.
da: I/O-udbyderen er blevet låst af brugeren.
id: Penyedia I/O telah dikunci oleh pengguna.

source: Item is read-only.
da: Elementet er skrivebeskyttet.
id: Butir hanya-baca.

source: No writable I/O provider found.
da: Fandt ingen skrivbar I/O-udbyder.
id: Tidak ditemukan penyedia I/O.

source: Item is not writable for an unknown reason (%d). %s
da: Elementet er af en ukendt grund skrivebeskyttet (%d). %s
id: Butir tidak dapat ditulisi karena alasan yang tidak diketahui (%d). %s

source: Program flow error. %s
da: Fejl i programafviklingen. %s
id: Kesalahan alur program. %s

source: The I/O provider is not willing to do that.
da: I/O-udbyderen er ikke villig til at gøre dette.
id: Penyedia I/O tidak bersedia melakukan itu.

source: Write error in I/O provider.
da: Skrivefejl i I/O-udbyderen.
id: Kesalahan tulis dalam penyedia I/O.

source: Unable to delete GConf schemas.
da: Kunne ikke slette GConf-skemaer.
id: Tidak dapat menghapus skema GConf.

source: Unable to delete configuration.
da: Kunne ikke slette konfigurationen.
id: Tidak bisa menghapus konfigurasi.

source: Unknown return code (%d). %s
da: Ukendt returkode (%d). %s
id: Kode balikan tidak dikenal (%d). %s

source: New file-manager action
da: Ny Nautilus-handling
id: Aksi manajer-berkas baru

source: Profile automatically created from pre-v2 action
da: Automatisk oprettet profil fra præ-v2-handling
id: Profil dibuat secara otomatis dari aksi pra-v2

source: Targets the selection context menu
da: Rettet mod markeringsgenvejsmenuen
id: Menarget menu konteks pilihan

source: Whether the action targets the selection file manager context menus. This used to be the historical behavior. Note that menus are always potential candidate to the display in selection context menus provided that they contain at least one action. Defaults to TRUE.
da: Hvorvidt handlingen er rettet mod genvejsmenuerne i markeringsfilhåndteringen. Dette var den oprindelige opførsel. Bemærk, at menuer altid er kandidater til at blive vist i markeringsgenvejsmenuer, under forudsætning af at de indeholder mindst en handling. Som standard TRUE.
id: Apakah tindakan menargetkan menu konteks manajer berkas pilihan. Ini biasanya adalah perilaku historis. Perhatikan bahwa menu adalah selalu kandidat potensial untuk menampilkan dalam menu konteks seleksi asalkan mereka mengandung setidaknya satu tindakan. Default ke TRUE.

source: Targets the selection context menu [true]
da: Rettet mod markeringsgenvejsmenuen [sand]
id: Menarget menu konteks pilihan [true]

source: Targets the location context menu
da: Rettet mod placeringsgenvejsmenuen
id: Menarget menu konteks lokasi

source: Whether the action targets the file manager context menus when there is no selection, thus applying to current location. Note that menus are always potential candidate to the display in selection context menus provided that they contain at least one action. Defaults to FALSE
da: Hvorvidt handlingen er rettet mod Nautilus' genvejsmenuer, når der ikke er valgt noget, så den virker på den aktuelle placering. Bemærk, at menuer altid er kandidater til at blive vist i markeringsgenvejsmenuer, under forudsætning af at de indeholder mindst en handling. Som standard FALSE.
id: Apakah tindakan menargetkan menu konteks manajer berkas ketika tidak ada pilihan, sehingga menerapkan untuk lokasi saat ini. Perhatikan bahwa menu adalah selalu kandidat potensial untuk menampilkan dalam menu konteks seleksi asalkan mereka mengandung setidaknya satu tindakan. Default ke FALSE

source: Targets the location context menu [false]
da: Rettet mod placeringsgenvejsmenuen [falsk]
id: Menarget menu konteks lokasi [false]

source: Targets the toolbar
da: Rettet mod værktøjslinjen
id: Menarget bilah alat

source: Whether the action is candidate to be displayed in file manager toolbar. This only applies to current location. Note that menus are never displayed in the toolbar. Defaults to FALSE.
da: Hvorvidt handlingen er kandidat til at blive vist i Nautilus' værktøjslinje. Dette gælder kun for den aktuelle placering. Bemærk at menuer aldrig vises i værktøjslinjen. Som standard FALSE.
id: Apakah tindakan adalah kandidat untuk ditampilkan dalam bilah alat manajer berkas. Ini hanya berlaku untuk lokasi saat ini. Perhatikan bahwa menu tidak pernah ditampilkan di bilah alat. Default ke FALSE.

source: Targets the toolbar [false]
da: Rettet mod værktøjslinjen [falsk]
id: Menarget bilah alat [false]

source: Label of the toolbar item
da: Værktøjslinjeelementets etiket
id: Label dari butir bilah alat

source: The label displayed besides of the icon in the file manager toolbar. Note that actual display may depend of your own Desktop Environment preferences. Defaults to label of the context menu when not set or empty.
da: Etiketten som vises ved siden af ikonet i Nautilus' værktøjslinje. Bemærk at den aktuelle visning kan afhænge af dine egne indstillinger for skrivebordsmiljøet. Som standard er den genvejsmenuens etiket, når den ikke er angivet eller er tom.
id: Label yang ditampilkan di sebelah ikon di bilah alat manajer berkas. Perhatikan bahwa tampilan aktual mungkin tergantung pada preferensi Lingkungan Desktop Anda sendiri. Default ke label menu konteks ketika tidak ditetapkan atau kosong.

source: Copy of %s
da: Kopi af %s
id: Salinan %s

source: Type of the item
da: Elementtype
id: Tipe butir

source: Defines if the item is an action or a menu. Possible values are : • “Action”, • “Menu”. The value is case sensitive and must not be localized.
da: Definerer om elementet er en handling eller en menu. Mulige værdier er: • “Action”, • “Menu”. Der skelnes mellem store og små bogstaver, og værdierne må ikke oversættes.
id: Menentukan apakah item tersebut merupakan tindakan atau menu. Nilai yang mungkin adalah: • "Action", • "Menu". Nilai peka huruf besar kecil dan tidak boleh dilokalkan.

source: Label of the context menu item (mandatory)
da: Genvejsmenuelementets etiket (obligatorisk)
id: Label dari butir menu konteks (wajib)

source: The label of the menu item that will appear in the file manager context menu when the selection matches the appearance condition settings. It is also used as a default for the toolbar label of an action.
da: Etiketten til menuelementet som vises i Nautilus' genvejsmenu, når markeringen matcher indstillingerne til visningskravene. Den bruges også som en standard til en handlings værktøjslinjeetiket.
id: Label item menu yang akan muncul dalam menu konteks manajer berkas ketika pilihan cocok dengan pengaturan kondisi penampilan. Hal ini juga digunakan sebagai default untuk label bilah alat tindakan.

source: Empty label
da: Tom etiket
id: Label kosong

source: Tooltip of the context menu item
da: Værktøjstip til element i genvejsmenuen
id: Tooltip dari butir menu konteks

source: The tooltip of the menu item that will appear in the file manager statusbar when the user points to the file manager context menu item with his/her mouse.
da: Værktøjstippet til menuelementet som vises i Nautilus' statusbjælke, når brugeren med musen peger på punktet i Nautilus' genvejsmenu.
id: Tooltip butir menu yang akan muncul di bilah status pengelola berkas saat pengguna mengarahkan ke butir menu konteks manajer berkas dengan tetikusnya.

source: Icon of the context menu item
da: Ikon til element i genvejsmenuen
id: Ikon dari butir menu konteks

source: The icon of the menu item that will appear next to the label in the file manager context menu when the selection matches the appearance conditions settings. May be the localized name of a themed icon, or a full path to any appropriate image.
da: Ikonet til menuelementet som vises ved siden af etiketten i Nautilus' genvejsmenu, når markeringen matcher indstillingerne for visningskrav. Kan være det oversatte navn på et tematiseret ikon eller en fuld sti til et passende billede.
id: Ikon item menu yang akan muncul di samping label di menu konteks manajer berkas saat pilihan cocok dengan pengaturan kondisi tampilan. Mungkin nama lokal ikon bertema, atau path lengkap untuk sebarang gambar yang sesuai.

source: <PATH|NAME>
da: <STI|NAVN>
id: <PATH|NAMA>

source: Description relative to the item
da: Beskrivelse i relation til elementet
id: Deskripsi relatif terhadap butir

source: Some text which explains the goal of the menu or the action. May be used, e.g. when displaying available items on a web site.
da: Noget tekst som forklarer menuens eller handlingens mål. Kan f.eks. bruges ved visning af tilgængelige elementer på et websted.
id: Beberapa teks yang menjelaskan tujuan dari menu atau tindakan. Dapat digunakan, mis, ketika menampilkan item yang tersedia di situs web.

source: Suggested shortcut
da: Foreslået genvej
id: Pintasan yang disarankan

source: A shortcut suggested for the action or the menu. Please note that this might be only a suggestion as the shortcut may be already reserved for another use. Implementation should not override an already existing shortcut to define this one. The format may look like “<Control>a” or “<Shift><Alt>F1”. Defaults to empty.
da: En foreslået genvej for handlingen eller menuen. Bemærk venligst at dette kun er et forslag, da genvejen allerede kan være reserveret til anden brug. Implementering bør ikke overskrive en allerede eksisterende genvej for at definere denne. Formatet kan se sådan ud “<Control>a” eller “<Shift><Alt>F1”. Som standard tom.
id: Pintasan yang disarankan untuk aksi atau menu. Harap dicatat bahwa ini mungkin hanya saran karena pintasan mungkin sudah dicadangkan untuk penggunaan lain. Implementasi tidak boleh menimpa pintasan yang sudah ada untuk mendefinisikan yang satu ini. Formatnya mungkin terlihat seperti "<Control>a" atau "<Shift><Alt>F1". Nilai bakunya kosong.

source: List of subitem ids
da: Liste over underelement-id'er
id: Daftar id sub butir

source: Ordered list of the IDs of the subitems. This may be actions or menus if the item is a menu, or profiles if the item is an action. If this list doesn’t exist or is empty for an action or a menu, subitems are attached in the order of the read operations.
da: Sorteret liste over underelementers id. Dette kan være handlinger eller menuer, hvis elementet er en menu, eller profiler hvis elementet er en handling. Hvis listen ikke eksisterer eller er tom for en handling eller menu, tilføjes underelementer i læsehandlingens rækkefølge.
id: Daftar terurut ID sub item. Ini mungkin tindakan atau menu jika item adalah menu, atau profil jika item adalah tindakan. Jika daftar ini tidak ada atau kosong untuk tindakan atau menu, sub item dilampirkan dalam urutan operasi baca.

source: Whether the action or the menu is enabled
da: Hvorvidt handlingen eller menuen er aktiveret
id: Menentukan apakah aksi atau menu difungsikan

source: If the or the menu action is disabled, it will never appear in the file manager context menu. Defaults to TRUE.
da: Hvis menuen eller handlingen er deaktiveret, vil den aldrig optræde i Nautilus' genvejsmenu. Som standard TRUE.
id: Jika tindakan menu dinonaktifkan, itu tidak akan pernah muncul dalam menu konteks manajer berkas. Default ke TRUE.

source: Whether the action or the menu is enabled [enabled]
da: Hvorvidt handlingen eller menuen er aktiveret [aktiveret]
id: Menentukan apakah aksi atau menu difungsikan [difungsikan]

source: Version of the format
da: Formatets version
id: Versi dari format

source: The version of the configuration format that will be used to manage backward compatibility.
da: Konfigurationsformatets version som bruges til håndtering af bagud-kompatibilitet.
id: Versi format konfigurasi yang akan digunakan untuk mengelola kompatibilitas mundur.

source: New file-manager menu
da: Ny Nautilus-menu
id: Menu manajer berkas baru

source: Default profile
da: Standardprofil
id: Profil baku

source: Name of the profile
da: Profilens navn
id: Nama profil

source: May be used as a description for the function of the profile. If not set, it defaults to an auto-generated name.
da: Kan bruges som beskrivelse af profilens funktion. Hvis ikke angivet, er den som standard et automatisk genereret navn.
id: Dapat digunakan sebagai deskripsi untuk fungsi profil. Jika tidak diatur, defaultnya adalah nama yang dihasilkan secara otomatis.

source: Path of the command
da: Stien til kommandoen
id: Path perintah

source: The path of the command to be executed when the user select the menu item in the file manager context menu or in the toolbar.
da: Stien til kommandoen som køres, når brugeren vælger menuelementet i Nautilus' genvejsmenu eller på værktøjslinjen.
id: Path perintah yang akan dieksekusi saat pengguna memilih item menu dalam menu konteks manajer berkas atau di bilah alat.

source: Parameters of the command
da: Kommandoens parametre
id: Parameter perintah

source: The parameters of the command to be executed when the user selects the menu item in the file manager context menu or in the toolbar. The parameters may contain some special tokens which are replaced by the information provided by the file manager before starting the command: • up to version 2.0: %d: base folder of the selected file(s) %f: the name of the selected file or the first one if several are selected %h: hostname of the URI %m: space-separated list of the basenames of the selected file(s)/folder(s) %M: space-separated list of the selected file(s)/folder(s), with their full paths %p: port number of the first URI %R: space-separated list of selected URIs %s: scheme of the URI %u: URI %U: username of the URI %%: a percent sign. • starting from version 3: %b: (first) basename %B: space-separated list of the basenames of the selected file(s)/folder(s) %c: count the selected file(s)/folder(s) %d: (first) base directory %D: space-separated list of base directories of the selected file(s)/folder(s) %f: (first) filename %F: space-separated list of the filenames of the selected file(s)/folder(s) %h: hostname of the (first) URI %m: (first) mimetype %M: space-separated list of the mimetypes of the selected file(s)/folder(s) %n: username of the (first) URI %o: no-op operator which forces the singular form of execution (since 3.0.2) %O: no-op operator which forces the plural form of execution (since 3.0.2) %p: port number of the (first) URI %s: scheme of the (first) URI %u: (first) URI %U: space-separated list of the URIs of the selected file(s)/folder(s) %w: (first) basename without the extension %W: space-separated list of basenames without the extension %x: (first) extension %X: space-separated list of the extensions of the selected file(s)/folder(s) %%: a percent sign.
da: Parametrene til kommandoen som skal køres, når brugeren vælger menuelementet i Nautilus' genvejsmenu eller på værktøjslinjen. Parametrene kan indeholde nogle særlige symboler, der erstattes af informationen, som Nautilus leverer før kørsel af kommandoen: • til og med version 2.0: %d: de valgte filers basismappe %f: navnet på den valgte fil eller den første fil hvis flere er valgt %h: URI'ens værtsnavn %m: mellemrumsadskilt liste over de valgte filers/mappers basisnavne %M: mellemrumsadskilt liste over de valgte filer/mapper med deres fulde sti %p: den første URI's portnummer %R: mellemrumsadskilt liste over de valgte URI'er %s: URI-typen %u: URI %U: URI'ens brugernavn %%: procenttegn. • fra og med version 3: %b: (første) basisnavn %B: mellemrumsadskilt liste over de valgte filers/mappers basisnavne %c: antal valgte filer/mapper %d: (første) basismappe %D: mellemrumsadskilt liste over de valgte filers/mappers basismapper %f: (første) filnavn %F: mellemrumsadskilt liste over de valgte filers/mappers filnavne %h: (første) URI's værtsnavn %m: (første) MIME-type %M: mellemrumsadskilt liste over de valgte filers/mappers MIME-typer %n: (første) URI's brugernavn %o: no-op-operator som gennemtvinger enkeltkørsel (siden 3.0.2) %O: no-op-operator som gennemtvinger flertallig kørsel (siden 3.0.2) %p: (første) URI's portnummer %s: (første) URI's type %u: (første) URI %U: mellemrumsadskilt liste over de valgte filers/mappers URI'er %w: (første) basisnavn uden suffiks %W: mellemrumsadskilt liste over basisnavne uden suffikser %x: (første) suffiks %X: mellemrumsadskilt liste over de valgte filers/mappers suffikser %%: et procenttegn.

source: Working directory
da: Arbejdsmappe
id: Direktori kerja

source: The working directory the command will be started in. Defaults to “%d”.
da: Arbejdsmappen som kommandoen vil starte i. Som standard “%d”.
id: Direktori kerja tempat perintah akan dimulai. Defaultnya adalah "%d".

source: Execution mode
da: Kørselstilstand
id: Mode eksekusi

source: Execution mode of the program. This may be chosen between following values: • “Normal”: starts as a standard graphical user interface • “Terminal”: starts the preferred terminal of the graphical environment, and runs the command in it • “Embedded”: makes use of a special feature of the file manager which allows a terminal to be ran inside of it; an acceptable fallback is Terminal • “DisplayOutput”: the ran terminal may be closed at end of the command, but standard streams (stdout, stderr) should be collected and displayed; an acceptable fallback is Terminal. Defaults to “Normal”.
da: Programmets kørselstilstand. Følgende værdier kan vælges: • “Normal”: starter som en almindelig grafisk brugergrænseflade • “Terminal”: starter det grafiske miljøs foretrukne terminal, og kører kommandoen i den • “Embedded”: gør brug af en særlig funktion i Nautilus, som tillader, at en terminal kan køre inden i den; et acceptabelt alternativ er Terminal • “DisplayOutput”: den kørte terminal kan lukkes ved afslutning af kommandoen, men standardstrømme (stdout, stderr) bør samles og vises; et acceptabelt alternativ er Terminal. Som standard “Normal”.
id: Modus eksekusi program. Ini dapat dipilih antara nilai berikut: • "Normal": dimulai sebagai antarmuka pengguna grafis standar • "Terminal": memulai terminal pilihan dari lingkungan grafis, dan menjalankan perintah di dalamnya • "Embedded": memanfaatkan fitur khusus dari berkas Manager yang memungkinkan terminal untuk dijalankan di dalamnya; fallback yang dapat diterima adalah terminal • "DisplayOutput": terminal berlari dapat ditutup di akhir perintah, tetapi aliran standar (stdout, stderr) harus dikumpulkan dan ditampilkan; fallback yang dapat diterima adalah terminal. Default ke "Normal".

source: Startup notify
da: Påmindelse ved opstart
id: Beritahu saat awal mula

source: Only relevant when ExecutionMode=Normal. Defaults to FALSE.
da: Kun relevant når ExecutionMode=Normal. Som standard FALSE.
id: Hanya relevan ketika ExecutionMode=Normal. Default ke FALSE.

source: Startup WM Class
da: Opstarts-WM-klasse
id: Kelas WM Awal Mula

source: Only relevant when ExecutionMode=Normal. Defaults to empty.
da: Kun relevant når ExecutionMode=Normal. Som standard tom.
id: Hanya relevan ketika ExecutionMode=Normal. Defaultnya kosong.
