Repository: GNOME/filemanager-actions
Catalog: po/*.po
Languages: da, id, it, ta

source: Record all the modified actions. Invalid actions will be silently ignored
da: Registrér alle de ændrede handlinger. Ugyldige handlinger vil tavst blive ignoreret

source: Cut the selected item(s) to the clipboard
da: Klip de valgte elementer til udklipsholderen
id: Memotong item terpilih ke papan klip

source: Copy the selected item(s) to the clipboard
da: Kopiér de valgte elementer til udklipsholderen
id: Menyalin item terpilih ke papan klip

source: Insert the content of the clipboard just before the current position
da: Indsæt indholdet af udklipsholderen lige før den aktuelle placering
id: Menyisipkan isi papan klip tepat sebelum posisi saat ini

source: Insert the content of the clipboard as first child of the current item
da: Indsæt indholdet af udklipsholderen som første underpunkt i det aktuelle element
id: Menyisipkan konten papan klip sebagai anak pertama dari item saat ini

source: Duplicate the selected item(s)
da: Duplikér de valgte elementer
id: Menduplikasi item yang dipilih

source: Delete the selected item(s)
da: Slet de valgte elementer
id: Menghapus item yang dipilih

source: Cancel your current modifications and reload the initial list of menus and actions
da: Fortryd dine aktuelle ændringer og genindlæs den oprindelige liste over menuer og handlinger
id: Membatalkan modifikasi Anda saat ini dan memuat ulang daftar menu dan tindakan awal

source: Entirely expand the items hierarchy
da: Fold elementhierarkiet helt ud
id: Sepenuhnya membuat mengembang hirarki item

source: Entirely collapse the items hierarchy
da: Sammenfold hele elementhierarkiet
id: Sepenuhnya menguncupkan hirarki item

source: Display the File toolbar
da: Vis filværktøjslinjen
id: Tampilkan bilah alat Berkas

source: Display the Edit toolbar
da: Vis redigérværktøjslinjen
id: Tampilkan bilah alat Sunting

source: Display the Tools toolbar
da: Vis værktøjslinjen med værktøjer

source: Display the Help toolbar
da: Vis hjælpværktøjslinjen
id: Tampilkan bilah alat Bantuan

source: Switch the position of the notebook tabs
da: Skift placering af notesbogens faneblade

source: Import one or more actions from external files into your configuration
da: Importér en eller flere handlinger fra eksterne filer ind i din konfiguration

source: Export one or more actions from your configuration to external files
da: Eksportér en eller flere handlinger fra din konfiguration til eksterne filer

source: _Maintainer
da: _Vedligeholder
id: Pe_melihara

source: %d menu(s), %d action(s), %d profile(s) are currently loaded
da: %d menuer, %d handlinger, %d profiler er for nærværende indlæst
id: %d menu, %d aksi, %d profil saat ini sedang dimuat

source: Not all items have been cut as following ones are not modifiable:
da: Ikke alle elementer er blevet klippet, da følgende ikke kan ændres:

source: Not all items have been deleted as following ones are not modifiable:
da: Ikke alle elementer er blevet slettet, da følgende ikke kan ændres:

source: Save error
da: Fejl i forsøget på at gemme
id: Simpan galat

source: Some items may not have been saved
da: Nogle elementer er muligvis ikke blevet gemt

source: Unable to rewrite the level-zero items list
da: Kan ikke genskrive niveau 0-elementlisten

source: Some items have not been deleted
da: Nogle elementer er ikke blevet slettet

source: New profile
da: Ny profil
id: Profil baru

source: Automatically saving pending modifications…
da: Gemmer automatisk ventende ændringer …
id: Secara otomatis menyimpan modifikasi yang tertunda…

source: FileManager-Actions Preferences
da: Indstillinger for Nautilus-handlinger

source: _Ascending alphabetical order
da: _Stigende alfabetisk rækkefølge

source: Menus and actions will be displayed in the ascending alphabetical order of their label, both in the Nautilus context menu and in the fma-config-tool user interface.
da: Menuer og handlinger vil blive vist i stigende alfabetisk rækkefølge af deres etiketter både i Nautilus' genvejsmenu og i brugergrænsefladen for fma-config-tool.

source: _Descending alphabetical order
da: _Faldende alfabetisk rækkefølge

source: Menus and actions will be displayed in the descending alphabetical order of their label, both in the Nautilus context menu and in the fma-config-tool user interface.
da: Menuer og handlinger vil blive vist i faldende alfabetisk rækkefølge af deres etiketter både i Nautilus' genvejsmenu og i brugergrænsefladen for fma-config-tool.

source: _Manual order
da: _Manuel rækkefølge

source: Display order of menus and actions, both in the Nautilus context menu and in the fma-config-tools user interface, must be manually adjusted.
da: Rækkefølgen for visning af menuer og handlinger, både i Nautilus' genvejsmenu og i brugergrænsefladen for fma-config-tool, skal håndteres manuelt.

source: <b>Items ordering</b>
da: <b>Elementers rækkefølge</b>
id: <b>Pengurutan butir</b>

source: _Create a root “FileManager-Actions” menu
da: O_pret en rodmenu til “Nautilus-handlinger”

source: When this option is checked, menus and actions will actually be displayed as sub-items of a root “FileManager-Actions” menu in the Nautilus context menu.
da: Når denne valgmulighed er markeret, vil menuer og handlinger blive vist som underelementer i en “Nautilus-handlinger”-rodmenu i Nautilus' genvejsmenu.

source: Add an “A_bout FileManager-Actions” item in the Nautilus context menus
da: Tilføj et “O_m Nautilus-handlinger”-element i Nautilus' genvejsmenu

source: When this option is checked, an “About FileManager-Actions” item will be added to the root FileManager-Actions menu in the Nautilus context menu. Note that this item will be displayed only if a unique menu is defined in the Nautilus context menu (e.g. when having checked the root “FileManager-Actions” menu option above).
da: Når denne valgmulighed er markeret, vil et “Om Nautilus-handlinger”-element blive tilføjet til “Nautilus-handlinger”-rodmenuen i Nautilus' genvejsmenu. Bemærk at dette element kun vil blive vist, hvis en entydig menu er defineret i Nautilus' genvejsmenu (f.eks. når indstillingen “Nautilus-handlinger”-rodmenu er markeret ovenfor).

source: This tab lets you choose how the actions are ordered in the displayed list as well as in the Nautilus context menu. You may also choose here how actions will be displayed in the Nautilus context menu.
da: Dette faneblad lader dig vælge rækkefølgen for handlingerne i den viste liste og i Nautilus' genvejsmenu. Du kan også vælge, hvordan handlinger vil blive vist i Nautilus' genvejsmenu.

source: _Runtime preferences
da: K_ørselsindstillinger

source: _Command pattern :
da: _Kommandomønster:
id: _Pola perintah :

source: <b>Execution in a terminal</b>
da: <b>Kørsel i en terminal</b>
id: <b>Eksekusi dalam sebuah terminal</b>

source: Running _desktop environment :
da: Kørende _skrivebordsmiljø:

source: <i>Currently detected :</i>
da: <i>Aktuelt registreret:</i>
id: <i>Saat ini terdeteksi :</i>

source: <b>Desktop environment</b>
da: <b>Skrivebordsmiljø</b>
id: <b>Lingkungan desktop</b>

source: This tab lets you specify parameters needed for some execution modes.
da: Dette faneblad lader dig angive parametre til brug for nogle kørselstilstande.

source: Runtime E_xecution
da: Kørselstids_udførelse

source: What to do when pasting or duplicating an item in the tree ?
da: Hvad skal der ske, når et element indsættes eller duplikeres i træet?

source: Relabel _menus
da: Giv _menuer nye navne

source: When a menu is copied/pasted, or duplicated, the new menu will be relabelled as “Copy of …”.
da: Når en menu kopieres/indsættes eller duplikeres, vil den nye menu få navnet “Kopi af …”.

source: Relabel _actions
da: Giv _handlinger nye navne

source: When an action is copied/pasted, or duplicated, the new action will be relabelled as “Copy of …”.
da: Når en handling kopieres/indsættes eller duplikeres, vil den nye handling få navnet “Kopi af …”.

source: Relabel _profiles
da: Giv _profiler nye navne

source: When a profile is copied/pasted, or duplicated, the new profile will be relabelled as “Copy of …”.
da: Når en profil kopieres/indsættes eller duplikeres, vil den nye profil få navnet “Kopi af …”.

source: <b>Relabeling items</b>
da: <b>Omdøbning af elementer</b>
id: <b>Melabel ulang butir</b>

source: Esc key _quits the assistant
da: Esc-tasten _afslutter assistenten

source: When this option is checked, the “Escape” key will let you quit the current assistant. Else, quitting the assistant is only possible by hitting the “Cancel” button.
da: Når denne valgmulighed er markeret, vil Esc-tasten lade dig afslutte den aktuelle assistent. Afslutning af assistenten er ellers kun mulig med “Annullér”-knappen.

source: Ask for a _confirmation when quitting the assistant on Esc key
da: Sp_ørg efter bekræftelse, når assistenten afsluttes med Esc

source: This option is only relevant when the “Escape” key lets the user quit the assistant. When checked, the user will be prompted for a confirmation in order to help prevent erroneous hits of the Esc key.
da: Denne valgmulighed er kun relevant, når Esc-tasten lader brugeren afslutte assistenten. Når markeret vil brugeren blive bedt om bekræftelse for at undgå fejlagtig aktivering af Esc-tasten.

source: <b>Assistants</b>
da: <b>Assistenter</b>
id: <b>Asisten</b>

source: Automatically _saves pending modifications
da: _Gemmer automatisk ventende ændringer

source: When this option is checked, pending modification will be periodically and automatically saved.
da: Når denne valgmulighed er markeret, vil ventende ændringer blive gemt regelmæssigt og automatisk.

source: Periodicity :
da: Interval:
id: Periodisitas :

source: minutes
da: minutter
id: menit

source: <b>Auto-save</b>
da: <b>Auto-gem</b>

source: This tab allows the user to choose custom preferences for the FileManager-Actions Configuration Tool user interface.
da: Dette faneblad lader brugeren vælge tilpassede indstillinger for brugergrænsefladen til Nautilus-handlingers konfigurationsværktøj.

source: _UI Preferences
da: Indstillinger for _brugergrænseflade

source: What to do when an item, action or menu, selected to be imported, has the same identifier that a currently existing one ?
da: Hvad skal der ske, når et element, en handling eller en menu udvalgt til import har den samme identifikator som en eksisterende?

source: <b>Import mode</b>
da: <b>Importtilstand</b>
id: <b>Mode impor</b>

source: This tab lets you decide on the default behavior of import operations.
da: Dette faneblad lader dig bestemme importhandlingers standardopførsel.

source: _Import
da: _Importér
id: _Impor

source: What is your preferred export format ?
da: Hvilket er dit foretrukne eksportformat?

source: <b>Export format</b>
da: <b>Eksportformat</b>
id: <b>Format ekspor</b>

source: This tab lets you decide on the default behavior of export operations.
da: Dette faneblad lader dig bestemme eksporthandlingers standardopførsel.

source: _Export
da: _Eksportér
id: _Ekspor

source: Click to add a new default scheme.
da: Klik for at tilføje en ny standardtype.

source: Click to remove the selected default scheme.
da: Klik for at fjerne den valgte standardtype.

source: You may define here any number of schemes. They will be proposed as default schemes when defining conditions for an action. If the list becomes empty, fma-config-tool will automatically re-fill in with this default list. You can add a new scheme by clicking on the “+” button.
da: Du kan definere så mange typer, du vil. De vil blive foreslået som standardtyper, når en handlings betingelser defineres. Hvis listen bliver tom, vil fma-config-tool automatisk genopfylde den med denne standardliste. Du kan tilføje en ny type ved at trykke på “+”-knappen.

source: <b>Default schemes</b>
da: <b>Standardtyper</b>
id: <b>Skema baku</b>

source: This tab lets you decide which schemes are proposed by default when editing advanced conditions for an item.
da: Dette faneblad lader dig afgøre, hvilke typer der som standard foreslås, når et elements avancerede betingelser redigeres.

source: Define here, for available I/O providers, if you want them to be read at startup, to be writable, and the order in which they will be tested when trying to write a new menu or action.
da: Definér for tilgængelige I/O-udbydere, om de skal læses under opstart, være skrivbare og rækkefølgen de skal prøves i, når en ny menu eller handling skrives.

source: _Up
da: _Op
id: _Naik

source: Move up the selected I/O provider in the order of priority when trying to write a new item.
da: Flyt den valgte I/O-udbyder op i prioritetsrækkefølgen, når et nyt element skrives.

source: _Down
da: _Ned
id: _Turun

source: <b>Activation and priority</b>
da: <b>Aktivering og prioritet</b>
id: <b>Aktivasi dan prioritas</b>

source: This tab lets you decide whether the I/O providers are enabled or not, and in which order they will be tried when writing a new item.
da: Dette faneblad lader dig afgøre, om I/O-udbyderne er aktiverede eller ej, og i hvilken rækkefølge de vil blive forsøgt, når et nyt element skal skrives.

source: I/O _Providers
da: I/O-_udbydere
id: _Penyedia I/O

source: Rely on runtime detection
da: Brug registrering under kørslen

source: Ex.:
da: Eks.:
id: Mis.:

source: Readable
da: Læsbar

source: Writable
da: Skrivbar
id: Ditulisi

source: I/O Provider
da: I/O-udbyder
id: Penyedia I/O

source: no name
da: intet navn
id: tanpa nama

source: unavailable I/O provider
da: utilgængelig I/O-udbyder
id: penyedia I/O yang tidak tersedia

source: Keyword
da: Nøgleord
id: Kata-kunci

source: Description
da: Beskrivelse
id: Deskripsi
it: Descrizione
ta: விவரணம்

source: Local files
da: Lokale filer
id: Berkas lokal

source: SSH files
da: SSH-filer
id: Berkas SSH

source: Windows files
da: Windows-filer
id: Berkas Windows

source: FTP files
da: FTP-filer
id: Berkas FTP

source: WebDAV files
da: WebDAV-filer
id: Berkas WebDav

source: %s (already used)
da: %s (allerede i brug)
id: %s (sudah dipakai)

source: new-scheme
da: ny-type
id: skema-baru
it: nuovo schema
ta: புதிய-திட்டம்

source: New scheme description
da: Ny typebeskrivelse
id: Keterangan skema baru

source: C_ut
da: Kli_p
id: _Potong

source: C_opy
da: K_opiér
id: S_alin

source: P_aste
da: Inds_æt
id: _Tempel

source: _Delete
da: _Slet
id: Ha_pus

source: _Reload
da: _Genindlæs
id: Muat _Ulang

source: _Preferences
da: _Indstillinger
id: _Preferensi

source: New _action
da: N_y handling

source: Save the items tree
da: Gem elementtræet

source: _Save
da: _Gem
id: _Simpan

source: _Quit
da: _Afslut
id: _Keluar

source: _Help
da: _Hjælp
id: _Bantuan

source: _About…
da: _Om …
id: Tent_ang…

source: _Import…
da: _Importér …
id: _Impor…

source: Unable to drop a profile here
da: Kan ikke slippe en profil her

source: Unable to drop an action or a menu here
da: Kan ikke slippe en handling eller menu her

source: Unable to drop here as parent is not writable
da: Kan ikke slippe her, da ophavet er skrivebeskyttet

source: Unable to drop here as level zero is not writable
da: Kan ikke slippe her, da niveau nul er skrivebeskyttet

source: Some messages have occurred during drop operation.
da: Der kom nogle beskeder, mens der blev sluppet.

source: Pre_ferences
da: In_dstillinger
id: Pre_ferensi

source: _About FileManager-Actions
da: _Om Nautilus-handlinger

source: _File
da: _Fil
id: _Berkas

source: New _menu
da: Ny _menu
id: _Menu baru

source: _New action
da: _Ny handling

source: New _profile
da: Ny _profil
id: _Profil baru

source: _Edit
da: _Redigér
id: _Sunting

source: _Cut
da: K_lip

source: _Paste
da: I_ndsæt
id: Tem_pel

source: paste _into
da: s_æt ind i
id: temp_el ke

source: D_uplicate
da: D_uplikér

source: _Reload the items
da: _Genindlæs elementerne

source: _View
da: _Vis
id: _Tampilan

source: E_xpand all
da: _Udfold alle

source: _Collapse all
da: _Sammenfold alle

source: _Toolbars
da: _Værktøjslinjer
id: _Toolbar

source: _Tools
da: _Værktøjer
id: _Perkakas

source: _Notebook labels
da: _Notesbogetiketter

source: _Top
da: _Øverst
id: _Puncak

source: _Right
da: _Højre
id: Kan_an

source: _Bottom
da: _Nederst
id: _Dasar

source: _Left
da: _Venstre
id: _Kiri

source: _Import assistant…
da: _Importassistent …
id: Asisten _impor…

source: E_xport assistant…
da: _Eksportassistent …
id: Asisten e_kspor…

source: _Content
da: _Indhold
id: _Isi

source: _Dump the selection
da: _Dump markeringen

source: _Brief tree store dump
da: Skriv kortfattet dump af _trælager

source: _List modified items
da: _Oplist ændrede elementer

source: _Dump the clipboard
da: _Dump udklipsholderen

source: _Test a function
da: _Test en funktion
id: Uji sua_tu fungsi

source: Configure items to be added to the File-Manager context menus
da: Konfigurér elementer, som skal tilføjes til Nautilus' genvejsmenuer

source: FileManager-Actions actions
da: Nautilus-handlingers handlinger

source: A submenu which embeds the currently available FileManager-Actions actions and menus
da: En undermenu med de aktuelt tilgængelige Nautilus-handlingers handlinger og menuer indlejret

source: About FileManager-Actions
da: Om Nautilus-handlinger

source: Display some information about FileManager-Actions
da: Vis information om Nautilus-handlinger

source: The URI of the file to be imported
da: URI for filen der skal importeres
id: URI berkas yang akan diimpor

source: Output the version number
da: Skriv versionsnummeret
id: Keluarkan nomor versi

source: Import a file.
da: Importér en fil.
id: Impor suatu berkas.

source: Bug reports are welcomed at https://gitlab.gnome.org/GNOME/filemanager-actions/issues/
da: Fejlrapporter er velkomne på http://gitlab.gnome.org/GNOME/filemanager-actions/issues/

source: Miscellaneous options
da: Diverse indstillinger
id: Opsi lain-lain

source: Syntax error: %s
da: Syntaksfejl: %s
id: Kesalahan sintaksis: %s

source: Error: uri is mandatory.
da: Fejl: URI er obligatorisk.
id: Galat: uri adalah wajib.

source: Try %s --help for usage.
da: Prøv %s --help for brugsanvisning.
id: Coba %s --help untuk cara pakai.

source: The XPath to the tree to be deleted
da: XPath til træet som skal slettes
id: XPath ke pohon yang akan dihapus

source: The filename of the XML backend
da: XML-motorens filnavn
id: Nama berkas backend XML

source: Error: a XPath is mandatory.
da: Fejl: En XPath er obligatorisk.
id: Galat: suatu XPath adalah wajib.

source: Error: a XML filename is mandatory.
da: Fejl: Et XML-filnavn er obligatorisk.

source: Delete a XPath from a XML document.
da: Slet en XPath i et XML-dokument.
id: Hapus suatu XPath dari sebuah dokumen XML.

source: Error: unable to parse file “%s”
da: Fejl: Kan ikke fortolke filen “%s”
id: Galat: tidak dapat mengurai berkas “%s”

source: Error: unable to create new XPath context
da: Fejl: Kan ikke oprette ny XPath-kontekst
id: Galat: tidak dapat membuat konteks XPath baru

source: Error: unable to evaluate XPath expression “%s”
da: Fejl: Kan ikke evaluere XPath-udtrykket “%s”
id: Galat: tidak dapat mengevaluasi ekspresi XPath “%s”

source: Set it if the item should be disabled at creation
da: Angiv denne hvis elementet skal være deaktiveret ved oprettelsen

source: Set it if the item doesn’t target the selection context menu
da: Angiv denne hvis elementet ikke har markeringsgenvejsmenuen som mål

source: Set it if the item doesn’t target the location context menu
da: Angiv denne hvis elementet ikke har placeringsgenvejsmenuen som mål

source: Set it if the item doesn’t target the toolbar
da: Angiv denne hvis elementet ikke har værktøjslinjen som mål

source: Set it if the basename patterns are case insensitive
da: Angiv denne hvis der i basisnavnemønstrene skelnes mellem store og små bogstaver

source: Output the new item content on stdout (default)
da: Send indholdet af det nye element til stdout (standard)

source: Create the new item as a .desktop file
da: Opret det nye element som en .desktop-fil
id: Buat suatu butir baru sebagai sebuah berkas .desktop

source: Error: “%s” and “%s” options cannot both be specified
da: Fejl: Valgmulighederne “%s” og “%s” kan ikke være angivet samtidig
id: Galat: opsi "%s" dan "%s" tidak dapat dinyatkan bersama

source: “%s” option is deprecated, see %s
da: Valgmuligheden “%s” er forældet; se %s
id: opsi "%s" usang, lihat %s

source: Error: an action label is mandatory.
da: Fejl: En handlingsetiket er obligatorisk.
id: Galat: sebuah label aksi adalah wajib.

source: Error: only one output option may be specified.
da: Fejl: kun én outputmulighed kan angives.
id: Galat: hanya satu opsi keluaran yang mungkin dinyatakan.

source: Define a new action.
da: Definér en ny handling.
id: Definisikan suatu aksi baru.

source: The created action defaults to be written to stdout. It can also be written to an output folder, in a file later suitable for an import in user configuration tool. Or you may choose to directly write the action as a .desktop file into your FileManager-Actions configuration.
da: Den oprettede handling sendes som standard til stdout. Den kan også gemmes i en fil i en outputmappe, som er egnet til import med brugerkonfigurationsværktøjet. Eller du kan vælge at gemme handlingen som en .desktop-fil i din Nautilus-handlingers konfiguration.

source: Output of the program
da: Programmets output
id: Keluaran program

source: Choose where the program creates the action
da: Vælg hvor programmet opretter handlingen

source: Error: unable to find “io-desktop” i/o provider.
da: Fejl: Kan ikke finde “io-desktop”-I/O-udbyderen.

source: Print a menu or an action to stdout.
da: Udskriv en menu eller en handling til stdout.
id: Cetak sebuah menu aksi atau aksi ke stdout.

source: The identifier of the menu or the action to be printed
da: Identifikatoren for menuen eller handlingen som skal udskrives
id: Pengidentifikasi menu atau tindakan yang akan dicetak

source: An export format [Desktop1]
da: Et eksportformat [Desktop1]

source: Error: a menu or action id is mandatory.
da: Fejl: Et menu- eller handlings-id er obligatorisk.
id: Galat: suatu menu atau id aksi adalah wajib.

source: Error: %s: unknown export format.
da: Fejl: %s: ukendt eksportformat.
id: Galat: %s: format ekspor tak dikenal.

source: Error: item “%s” doesn’t exist.
da: Fejl: Elementet “%s” findes ikke.
id: Galat: butir "%s" tidak ada.

source: Output the schema on stdout
da: Skriv skemaet på stdout
id: Keluarkan skema pada stdout

source: Output the action schemas [default]
da: Skriv handlingsskemaerne [standard]
id: Keluarkan skema aksi [baku]

source: Output the menu schemas
da: Skriv menuskemaerne
id: Keluarkan skema menu

source: Output the FileManager-Actions GConf schemas on stdout.
da: Skriv Nautilus-handlingers GConf-skemaer på stdout.

source: As of version 3.1.0, GConf as an I/O provider is deprecated. This program is no more maintained.
da: Fra og med version 3.1.0 er GConf som I/O-udbyder forældet. Programmet vedligeholdes ikke længere.
id: Pada versi 3.1.0, GConf sebagai penyedia I/O tidak dipakai lagi. Program ini tidak dipelihara lagi.

source: Type options
da: Indstillinger for type
id: Opsi tipe

source: The internal identifier of the action to be launched
da: Den interne identifikator for handlingen som skal køres
id: Pengidentifikasi internal tindakan yang akan diluncurkan

source: A target, file or folder, for the action. More than one target may be specified
da: Et mål, en fil eller mappe til handlingen. Mere end et mål kan angives
id: Target, berkas, atau folder, untuk tindakan. Lebih dari satu target dapat dinyatakan

source: Error: action id is mandatory.
da: Fejl: Handlings-id er obligatorisk.
id: Galat: id aksi adalah wajib.

source: No current selection. Nothing to do. Exiting.
da: Ingen aktuel markering. Intet at udføre. Afslutter.
id: Tidak ada pilihan saat ini. Tidak akan melakukan apapun. Keluar.

source: Action %s is not a valid candidate. Exiting.
da: Handlingen %s er ikke en gyldig kandidat. Afslutter.
id: Aksi %s bukan kandidat yang valid. Keluar.
